una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s4.h
// *****************************************************************************
//              SOFTWARE API DEFINITION  FOR Digital to Analog Convertor
// *****************************************************************************
typedef struct _AT91S_ACC {
	AT91_REG	 ACC_CR; 	// Control Register
	AT91_REG	 ACC_MR; 	// Mode Register
	AT91_REG	 Reserved0[7]; 	// 
	AT91_REG	 ACC_IER; 	// Interrupt Enable Register
	AT91_REG	 ACC_IDR; 	// Interrupt Disable Register
	AT91_REG	 ACC_IMR; 	// Interrupt Mask Register
	AT91_REG	 ACC_ISR; 	// Interrupt Status Register
	AT91_REG	 Reserved1[24]; 	// 
	AT91_REG	 ACC_ACR; 	// Analog Control Register
	AT91_REG	 Reserved2[19]; 	// 
	AT91_REG	 ACC_MODE; 	// Write Protection Mode Register
	AT91_REG	 ACC_STATUS; 	// Write Protection Status
	AT91_REG	 ACC_ADDRSIZE; 	// ACC ADDRSIZE REGISTER 
	AT91_REG	 ACC_IPNAME1; 	// ACC IPNAME1 REGISTER 
	AT91_REG	 ACC_IPNAME2; 	// ACC IPNAME2 REGISTER 
	AT91_REG	 ACC_FEATURES; 	// ACC FEATURES REGISTER 
	AT91_REG	 ACC_VER; 	// ACC VERSION REGISTER
} AT91S_ACC, *AT91PS_ACC;

// -------- ACC_IER : (ACC Offset: 0x24) Data Ready for Conversion Interrupt Enable -------- 
#define AT91C_ACC_DATRDY      ((unsigned int) 0x1 <<  0) // (ACC) Data Ready for Conversion
// -------- ACC_IDR : (ACC Offset: 0x28) Data Ready for Conversion Interrupt Disable -------- 
// -------- ACC_IMR : (ACC Offset: 0x2c) Data Ready for Conversion Interrupt Mask -------- 
// -------- ACC_ISR : (ACC Offset: 0x30) Status Register -------- 
// -------- ACC_VER : (ACC Offset: 0xfc) ACC VER -------- 
#define AT91C_ACC_VER         ((unsigned int) 0xF <<  0) // (ACC) ACC VER

// *****************************************************************************
//              SOFTWARE API DEFINITION  FOR Context Based Direct Memory Access Controller Interface
// *****************************************************************************
typedef struct _AT91S_HCBDMA {
	AT91_REG	 HCBDMA_CBDSCR; 	// CB DMA Descriptor Base Register
	AT91_REG	 HCBDMA_CBNXTEN; 	// CB DMA Next Descriptor Enable Register
	AT91_REG	 HCBDMA_CBEN; 	// CB DMA Enable Register
	AT91_REG	 HCBDMA_CBDIS; 	// CB DMA Disable Register
	AT91_REG	 HCBDMA_CBSR; 	// CB DMA Status Register
	AT91_REG	 HCBDMA_CBIER; 	// CB DMA Interrupt Enable Register
	AT91_REG	 HCBDMA_CBIDR; 	// CB DMA Interrupt Disable Register
	AT91_REG	 HCBDMA_CBIMR; 	// CB DMA Interrupt mask Register
	AT91_REG	 HCBDMA_CBISR; 	// CB DMA Interrupt Status Register
	AT91_REG	 HCBDMA_CBDLIER; 	// CB DMA Loaded Interrupt Enable Register
	AT91_REG	 HCBDMA_CBDLIDR; 	// CB DMA Loaded Interrupt Disable Register
	AT91_REG	 HCBDMA_CBDLIMR; 	// CB DMA Loaded Interrupt mask Register
	AT91_REG	 HCBDMA_CBDLISR; 	// CB DMA Loaded Interrupt Status Register
	AT91_REG	 HCBDMA_CBCRCCR; 	// CB DMA CRC Control Resgister
	AT91_REG	 HCBDMA_CBCRCMR; 	// CB DMA CRC Mode Resgister
	AT91_REG	 HCBDMA_CBCRCSR; 	// CB DMA CRC Status Resgister
	AT91_REG	 HCBDMA_CBCRCIER; 	// CB DMA CRC Interrupt Enable Resgister
	AT91_REG	 HCBDMA_CBCRCIDR; 	// CB DMA CRC Interrupt Disable Resgister
	AT91_REG	 HCBDMA_CBCRCIMR; 	// CB DMA CRC Interrupt Mask Resgister
	AT91_REG	 HCBDMA_CBCRCISR; 	// CB DMA CRC Interrupt Status Resgister
	AT91_REG	 Reserved0[39]; 	// 
	AT91_REG	 HCBDMA_ADDRSIZE; 	// HCBDMA ADDRSIZE REGISTER 
	AT91_REG	 HCBDMA_IPNAME1; 	// HCBDMA IPNAME1 REGISTER 
	AT91_REG	 HCBDMA_IPNAME2; 	// HCBDMA IPNAME2 REGISTER 
	AT91_REG	 HCBDMA_FEATURES; 	// HCBDMA FEATURES REGISTER 
	AT91_REG	 HCBDMA_VER; 	// HCBDMA VERSION REGISTER
} AT91S_HCBDMA, *AT91PS_HCBDMA;

// -------- HCBDMA_CBDSCR : (HCBDMA Offset: 0x0) CB DMA Descriptor Base Register -------- 
#define AT91C_HCBDMA_DSCR     ((unsigned int) 0x0 <<  0) // (HCBDMA) Descriptor Base Address
// -------- HCBDMA_CBNXTEN : (HCBDMA Offset: 0x4) Next Descriptor Enable Register -------- 
#define AT91C_HCBDMA_NXTID0   ((unsigned int) 0x1 <<  0) // (HCBDMA) Next Descriptor Identifier for the Channel 0
#define AT91C_HCBDMA_NXTID1   ((unsigned int) 0x1 <<  1) // (HCBDMA) Next Descriptor Identifier for the Channel 1
#define AT91C_HCBDMA_NXTID2   ((unsigned int) 0x1 <<  2) // (HCBDMA) Next Descriptor Identifier for the Channel 2
#define AT91C_HCBDMA_NXTID3   ((unsigned int) 0x1 <<  3) // (HCBDMA) Next Descriptor Identifier for the Channel 3
#define AT91C_HCBDMA_NXTID4   ((unsigned int) 0x1 <<  4) // (HCBDMA) Next Descriptor Identifier for the Channel 4
#define AT91C_HCBDMA_NXTID5   ((unsigned int) 0x1 <<  5) // (HCBDMA) Next Descriptor Identifier for the Channel 5
#define AT91C_HCBDMA_NXTID6   ((unsigned int) 0x1 <<  6) // (HCBDMA) Next Descriptor Identifier for the Channel 6
#define AT91C_HCBDMA_NXTID7   ((unsigned int) 0x1 <<  7) // (HCBDMA) Next Descriptor Identifier for the Channel 7
#define AT91C_HCBDMA_NXTID8   ((unsigned int) 0x1 <<  8) // (HCBDMA) Next Descriptor Identifier for the Channel 8
#define AT91C_HCBDMA_NXTID9   ((unsigned int) 0x1 <<  9) // (HCBDMA) Next Descriptor Identifier for the Channel 9
#define AT91C_HCBDMA_NXTID10  ((unsigned int) 0x1 << 10) // (HCBDMA) Next Descriptor Identifier for the Channel 10
#define AT91C_HCBDMA_NXTID11  ((unsigned int) 0x1 << 11) // (HCBDMA) Next Descriptor Identifier for the Channel 11
#define AT91C_HCBDMA_NXTID12  ((unsigned int) 0x1 << 12) // (HCBDMA) Next Descriptor Identifier for the Channel 12
#define AT91C_HCBDMA_NXTID13  ((unsigned int) 0x1 << 13) // (HCBDMA) Next Descriptor Identifier for the Channel 13
#define AT91C_HCBDMA_NXTID14  ((unsigned int) 0x1 << 14) // (HCBDMA) Next Descriptor Identifier for the Channel 14
#define AT91C_HCBDMA_NXTID15  ((unsigned int) 0x1 << 15) // (HCBDMA) Next Descriptor Identifier for the Channel 15
#define AT91C_HCBDMA_NXTID16  ((unsigned int) 0x1 << 16) // (HCBDMA) Next Descriptor Identifier for the Channel 16
#define AT91C_HCBDMA_NXTID17  ((unsigned int) 0x1 << 17) // (HCBDMA) Next Descriptor Identifier for the Channel 17
#define AT91C_HCBDMA_NXTID18  ((unsigned int) 0x1 << 18) // (HCBDMA) Next Descriptor Identifier for the Channel 18
#define AT91C_HCBDMA_NXTID19  ((unsigned int) 0x1 << 19) // (HCBDMA) Next Descriptor Identifier for the Channel 19
#define AT91C_HCBDMA_NXTID20  ((unsigned int) 0x1 << 20) // (HCBDMA) Next Descriptor Identifier for the Channel 20
#define AT91C_HCBDMA_NXTID21  ((unsigned int) 0x1 << 21) // (HCBDMA) Next Descriptor Identifier for the Channel 21
#define AT91C_HCBDMA_NXTID22  ((unsigned int) 0x1 << 22) // (HCBDMA) Next Descriptor Identifier for the Channel 22
#define AT91C_HCBDMA_NXTID23  ((unsigned int) 0x1 << 23) // (HCBDMA) Next Descriptor Identifier for the Channel 23
#define AT91C_HCBDMA_NXTID24  ((unsigned int) 0x1 << 24) // (HCBDMA) Next Descriptor Identifier for the Channel 24
#define AT91C_HCBDMA_NXTID25  ((unsigned int) 0x1 << 25) // (HCBDMA) Next Descriptor Identifier for the Channel 25
#define AT91C_HCBDMA_NXTID26  ((unsigned int) 0x1 << 26) // (HCBDMA) Next Descriptor Identifier for the Channel 26
#define AT91C_HCBDMA_NXTID27  ((unsigned int) 0x1 << 27) // (HCBDMA) Next Descriptor Identifier for the Channel 27
#define AT91C_HCBDMA_NXTID28  ((unsigned int) 0x1 << 28) // (HCBDMA) Next Descriptor Identifier for the Channel 28
#define AT91C_HCBDMA_NXTID29  ((unsigned int) 0x1 << 29) // (HCBDMA) Next Descriptor Identifier for the Channel 29
#define AT91C_HCBDMA_NXTID30  ((unsigned int) 0x1 << 30) // (HCBDMA) Next Descriptor Identifier for the Channel 30
#define AT91C_HCBDMA_NXTID31  ((unsigned int) 0x1 << 31) // (HCBDMA) Next Descriptor Identifier for the Channel 31
// -------- HCBDMA_CBEN : (HCBDMA Offset: 0x8) CB DMA Enable Register -------- 
#define AT91C_HCBDMA_CBEN0    ((unsigned int) 0x1 <<  0) // (HCBDMA) Enable for the Channel 0
#define AT91C_HCBDMA_CBEN1    ((unsigned int) 0x1 <<  1) // (HCBDMA) Enable for the Channel 1
#define AT91C_HCBDMA_CBEN2    ((unsigned int) 0x1 <<  2) // (HCBDMA) Enable for the Channel 2
#define AT91C_HCBDMA_CBEN3    ((unsigned int) 0x1 <<  3) // (HCBDMA) Enable for the Channel 3
#define AT91C_HCBDMA_CBEN4    ((unsigned int) 0x1 <<  4) // (HCBDMA) Enable for the Channel 4
#define AT91C_HCBDMA_CBEN5    ((unsigned int) 0x1 <<  5) // (HCBDMA) Enable for the Channel 5
#define AT91C_HCBDMA_CBEN6    ((unsigned int) 0x1 <<  6) // (HCBDMA) Enable for the Channel 6
#define AT91C_HCBDMA_CBEN7    ((unsigned int) 0x1 <<  7) // (HCBDMA) Enable for the Channel 7
#define AT91C_HCBDMA_CBEN8    ((unsigned int) 0x1 <<  8) // (HCBDMA) Enable for the Channel 8
#define AT91C_HCBDMA_CBEN9    ((unsigned int) 0x1 <<  9) // (HCBDMA) Enable for the Channel 9
#define AT91C_HCBDMA_CBEN10   ((unsigned int) 0x1 << 10) // (HCBDMA) Enable for the Channel 10
#define AT91C_HCBDMA_CBEN11   ((unsigned int) 0x1 << 11) // (HCBDMA) Enable for the Channel 11
#define AT91C_HCBDMA_CBEN12   ((unsigned int) 0x1 << 12) // (HCBDMA) Enable for the Channel 12
#define AT91C_HCBDMA_CBEN13   ((unsigned int) 0x1 << 13) // (HCBDMA) Enable for the Channel 13
#define AT91C_HCBDMA_CBEN14   ((unsigned int) 0x1 << 14) // (HCBDMA) Enable for the Channel 14
#define AT91C_HCBDMA_CBEN15   ((unsigned int) 0x1 << 15) // (HCBDMA) Enable for the Channel 15
#define AT91C_HCBDMA_CBEN16   ((unsigned int) 0x1 << 16) // (HCBDMA) Enable for the Channel 16
#define AT91C_HCBDMA_CBEN17   ((unsigned int) 0x1 << 17) // (HCBDMA) Enable for the Channel 17
#define AT91C_HCBDMA_CBEN18   ((unsigned int) 0x1 << 18) // (HCBDMA) Enable for the Channel 18
#define AT91C_HCBDMA_CBEN19   ((unsigned int) 0x1 << 19) // (HCBDMA) Enable for the Channel 19
#define AT91C_HCBDMA_CBEN20   ((unsigned int) 0x1 << 20) // (HCBDMA) Enable for the Channel 20
#define AT91C_HCBDMA_CBEN21   ((unsigned int) 0x1 << 21) // (HCBDMA) Enable for the Channel 21
#define AT91C_HCBDMA_CBEN22   ((unsigned int) 0x1 << 22) // (HCBDMA) Enable for the Channel 22
#define AT91C_HCBDMA_CBEN23   ((unsigned int) 0x1 << 23) // (HCBDMA) Enable for the Channel 23
#define AT91C_HCBDMA_CBEN24   ((unsigned int) 0x1 << 24) // (HCBDMA) Enable for the Channel 24
#define AT91C_HCBDMA_CBEN25   ((unsigned int) 0x1 << 25) // (HCBDMA) Enable for the Channel 25
#define AT91C_HCBDMA_CBEN26   ((unsigned int) 0x1 << 26) // (HCBDMA) Enable for the Channel 26
#define AT91C_HCBDMA_CBEN27   ((unsigned int) 0x1 << 27) // (HCBDMA) Enable for the Channel 27
#define AT91C_HCBDMA_CBEN28   ((unsigned int) 0x1 << 28) // (HCBDMA) Enable for the Channel 28
#define AT91C_HCBDMA_CBEN29   ((unsigned int) 0x1 << 29) // (HCBDMA) Enable for the Channel 29
#define AT91C_HCBDMA_CBEN30   ((unsigned int) 0x1 << 30) // (HCBDMA) Enable for the Channel 30
#define AT91C_HCBDMA_CBEN31   ((unsigned int) 0x1 << 31) // (HCBDMA) Enable for the Channel 31
// -------- HCBDMA_CBDIS : (HCBDMA Offset: 0xc) CB DMA Disable Register -------- 
#define AT91C_HCBDMA_CBDIS0   ((unsigned int) 0x1 <<  0) // (HCBDMA) Disable for the Channel 0
#define AT91C_HCBDMA_CBDIS1   ((unsigned int) 0x1 <<  1) // (HCBDMA) Disable for the Channel 1
#define AT91C_HCBDMA_CBDIS2   ((unsigned int) 0x1 <<  2) // (HCBDMA) Disable for the Channel 2
#define AT91C_HCBDMA_CBDIS3   ((unsigned int) 0x1 <<  3) // (HCBDMA) Disable for the Channel 3
#define AT91C_HCBDMA_CBDIS4   ((unsigned int) 0x1 <<  4) // (HCBDMA) Disable for the Channel 4
#define AT91C_HCBDMA_CBDIS5   ((unsigned int) 0x1 <<  5) // (HCBDMA) Disable for the Channel 5
#define AT91C_HCBDMA_CBDIS6   ((unsigned int) 0x1 <<  6) // (HCBDMA) Disable for the Channel 6
#define AT91C_HCBDMA_CBDIS7   ((unsigned int) 0x1 <<  7) // (HCBDMA) Disable for the Channel 7
#define AT91C_HCBDMA_CBDIS8   ((unsigned int) 0x1 <<  8) // (HCBDMA) Disable for the Channel 8
#define AT91C_HCBDMA_CBDIS9   ((unsigned int) 0x1 <<  9) // (HCBDMA) Disable for the Channel 9
#define AT91C_HCBDMA_CBDIS10  ((unsigned int) 0x1 << 10) // (HCBDMA) Disable for the Channel 10
#define AT91C_HCBDMA_CBDIS11  ((unsigned int) 0x1 << 11) // (HCBDMA) Disable for the Channel 11
#define AT91C_HCBDMA_CBDIS12  ((unsigned int) 0x1 << 12) // (HCBDMA) Disable for the Channel 12
#define AT91C_HCBDMA_CBDIS13  ((unsigned int) 0x1 << 13) // (HCBDMA) Disable for the Channel 13
#define AT91C_HCBDMA_CBDIS14  ((unsigned int) 0x1 << 14) // (HCBDMA) Disable for the Channel 14
#define AT91C_HCBDMA_CBDIS15  ((unsigned int) 0x1 << 15) // (HCBDMA) Disable for the Channel 15
#define AT91C_HCBDMA_CBDIS16  ((unsigned int) 0x1 << 16) // (HCBDMA) Disable for the Channel 16
#define AT91C_HCBDMA_CBDIS17  ((unsigned int) 0x1 << 17) // (HCBDMA) Disable for the Channel 17
#define AT91C_HCBDMA_CBDIS18  ((unsigned int) 0x1 << 18) // (HCBDMA) Disable for the Channel 18
#define AT91C_HCBDMA_CBDIS19  ((unsigned int) 0x1 << 19) // (HCBDMA) Disable for the Channel 19
#define AT91C_HCBDMA_CBDIS20  ((unsigned int) 0x1 << 20) // (HCBDMA) Disable for the Channel 20
#define AT91C_HCBDMA_CBDIS21  ((unsigned int) 0x1 << 21) // (HCBDMA) Disable for the Channel 21
#define AT91C_HCBDMA_CBDIS22  ((unsigned int) 0x1 << 22) // (HCBDMA) Disable for the Channel 22
#define AT91C_HCBDMA_CBDIS23  ((unsigned int) 0x1 << 23) // (HCBDMA) Disable for the Channel 23
#define AT91C_HCBDMA_CBDIS24  ((unsigned int) 0x1 << 24) // (HCBDMA) Disable for the Channel 24
#define AT91C_HCBDMA_CBDIS25  ((unsigned int) 0x1 << 25) // (HCBDMA) Disable for the Channel 25
#define AT91C_HCBDMA_CBDIS26  ((unsigned int) 0x1 << 26) // (HCBDMA) Disable for the Channel 26
#define AT91C_HCBDMA_CBDIS27  ((unsigned int) 0x1 << 27) // (HCBDMA) Disable for the Channel 27
#define AT91C_HCBDMA_CBDIS28  ((unsigned int) 0x1 << 28) // (HCBDMA) Disable for the Channel 28
#define AT91C_HCBDMA_CBDIS29  ((unsigned int) 0x1 << 29) // (HCBDMA) Disable for the Channel 29
#define AT91C_HCBDMA_CBDIS30  ((unsigned int) 0x1 << 30) // (HCBDMA) Disable for the Channel 30
#define AT91C_HCBDMA_CBDIS31  ((unsigned int) 0x1 << 31) // (HCBDMA) Disable for the Channel 31
// -------- HCBDMA_CBSR : (HCBDMA Offset: 0x10) CB DMA Status Register -------- 
#define AT91C_HCBDMA_CBSR0    ((unsigned int) 0x1 <<  0) // (HCBDMA) Status for the Channel 0
#define AT91C_HCBDMA_CBSR1    ((unsigned int) 0x1 <<  1) // (HCBDMA) Status for the Channel 1
#define AT91C_HCBDMA_CBSR2    ((unsigned int) 0x1 <<  2) // (HCBDMA) Status for the Channel 2
#define AT91C_HCBDMA_CBSR3    ((unsigned int) 0x1 <<  3) // (HCBDMA) Status for the Channel 3
#define AT91C_HCBDMA_CBSR4    ((unsigned int) 0x1 <<  4) // (HCBDMA) Status for the Channel 4
#define AT91C_HCBDMA_CBSR5    ((unsigned int) 0x1 <<  5) // (HCBDMA) Status for the Channel 5
#define AT91C_HCBDMA_CBSR6    ((unsigned int) 0x1 <<  6) // (HCBDMA) Status for the Channel 6
#define AT91C_HCBDMA_CBSR7    ((unsigned int) 0x1 <<  7) // (HCBDMA) Status for the Channel 7
#define AT91C_HCBDMA_CBSR8    ((unsigned int) 0x1 <<  8) // (HCBDMA) Status for the Channel 8
#define AT91C_HCBDMA_CBSR9    ((unsigned int) 0x1 <<  9) // (HCBDMA) Status for the Channel 9
#define AT91C_HCBDMA_CBSR10   ((unsigned int) 0x1 << 10) // (HCBDMA) Status for the Channel 10
#define AT91C_HCBDMA_CBSR11   ((unsigned int) 0x1 << 11) // (HCBDMA) Status for the Channel 11
#define AT91C_HCBDMA_CBSR12   ((unsigned int) 0x1 << 12) // (HCBDMA) Status for the Channel 12
#define AT91C_HCBDMA_CBSR13   ((unsigned int) 0x1 << 13) // (HCBDMA) Status for the Channel 13
#define AT91C_HCBDMA_CBSR14   ((unsigned int) 0x1 << 14) // (HCBDMA) Status for the Channel 14
#define AT91C_HCBDMA_CBSR15   ((unsigned int) 0x1 << 15) // (HCBDMA) Status for the Channel 15
#define AT91C_HCBDMA_CBSR16   ((unsigned int) 0x1 << 16) // (HCBDMA) Status for the Channel 16
#define AT91C_HCBDMA_CBSR17   ((unsigned int) 0x1 << 17) // (HCBDMA) Status for the Channel 17
#define AT91C_HCBDMA_CBSR18   ((unsigned int) 0x1 << 18) // (HCBDMA) Status for the Channel 18
#define AT91C_HCBDMA_CBSR19   ((unsigned int) 0x1 << 19) // (HCBDMA) Status for the Channel 19
#define AT91C_HCBDMA_CBSR20   ((unsigned int) 0x1 << 20) // (HCBDMA) Status for the Channel 20
#define AT91C_HCBDMA_CBSR21   ((unsigned int) 0x1 << 21) // (HCBDMA) Status for the Channel 21
#define AT91C_HCBDMA_CBSR22   ((unsigned int) 0x1 << 22) // (HCBDMA) Status for the Channel 22
#define AT91C_HCBDMA_CBSR23   ((unsigned int) 0x1 << 23) // (HCBDMA) Status for the Channel 23
#define AT91C_HCBDMA_CBSR24   ((unsigned int) 0x1 << 24) // (HCBDMA) Status for the Channel 24
#define AT91C_HCBDMA_CBSR25   ((unsigned int) 0x1 << 25) // (HCBDMA) Status for the Channel 25
#define AT91C_HCBDMA_CBSR26   ((unsigned int) 0x1 << 26) // (HCBDMA) Status for the Channel 26
#define AT91C_HCBDMA_CBSR27   ((unsigned int) 0x1 << 27) // (HCBDMA) Status for the Channel 27
#define AT91C_HCBDMA_CBSR28   ((unsigned int) 0x1 << 28) // (HCBDMA) Status for the Channel 28
#define AT91C_HCBDMA_CBSR29   ((unsigned int) 0x1 << 29) // (HCBDMA) Status for the Channel 29
#define AT91C_HCBDMA_CBSR30   ((unsigned int) 0x1 << 30) // (HCBDMA) Status for the Channel 30
#define AT91C_HCBDMA_CBSR31   ((unsigned int) 0x1 << 31) // (HCBDMA) Status for the Channel 31
// -------- HCBDMA_CBIER : (HCBDMA Offset: 0x14) CB DMA Interrupt Enable Register -------- 
#define AT91C_HCBDMA_CBIER0   ((unsigned int) 0x1 <<  0) // (HCBDMA) Interrupt enable for the Channel 0
#define AT91C_HCBDMA_CBIER1   ((unsigned int) 0x1 <<  1) // (HCBDMA) Interrupt enable for the Channel 1
#define AT91C_HCBDMA_CBIER2   ((unsigned int) 0x1 <<  2) // (HCBDMA) Interrupt enable for the Channel 2
#define AT91C_HCBDMA_CBIER3   ((unsigned int) 0x1 <<  3) // (HCBDMA) Interrupt enable for the Channel 3
#define AT91C_HCBDMA_CBIER4   ((unsigned int) 0x1 <<  4) // (HCBDMA) Interrupt enable for the Channel 4
#define AT91C_HCBDMA_CBIER5   ((unsigned int) 0x1 <<  5) // (HCBDMA) Interrupt enable for the Channel 5
#define AT91C_HCBDMA_CBIER6   ((unsigned int) 0x1 <<  6) // (HCBDMA) Interrupt enable for the Channel 6
#define AT91C_HCBDMA_CBIER7   ((unsigned int) 0x1 <<  7) // (HCBDMA) Interrupt enable for the Channel 7
#define AT91C_HCBDMA_CBIER8   ((unsigned int) 0x1 <<  8) // (HCBDMA) Interrupt enable for the Channel 8
#define AT91C_HCBDMA_CBIER9   ((unsigned int) 0x1 <<  9) // (HCBDMA) Interrupt enable for the Channel 9
#define AT91C_HCBDMA_CBIER10  ((unsigned int) 0x1 << 10) // (HCBDMA) Interrupt enable for the Channel 10
#define AT91C_HCBDMA_CBIER11  ((unsigned int) 0x1 << 11) // (HCBDMA) Interrupt enable for the Channel 11
#define AT91C_HCBDMA_CBIER12  ((unsigned int) 0x1 << 12) // (HCBDMA) Interrupt enable for the Channel 12
#define AT91C_HCBDMA_CBIER13  ((unsigned int) 0x1 << 13) // (HCBDMA) Interrupt enable for the Channel 13
#define AT91C_HCBDMA_CBIER14  ((unsigned int) 0x1 << 14) // (HCBDMA) Interrupt enable for the Channel 14
#define AT91C_HCBDMA_CBIER15  ((unsigned int) 0x1 << 15) // (HCBDMA) Interrupt enable for the Channel 15
#define AT91C_HCBDMA_CBIER16  ((unsigned int) 0x1 << 16) // (HCBDMA) Interrupt enable for the Channel 16
#define AT91C_HCBDMA_CBIER17  ((unsigned int) 0x1 << 17) // (HCBDMA) Interrupt enable for the Channel 17
#define AT91C_HCBDMA_CBIER18  ((unsigned int) 0x1 << 18) // (HCBDMA) Interrupt enable for the Channel 18
#define AT91C_HCBDMA_CBIER19  ((unsigned int) 0x1 << 19) // (HCBDMA) Interrupt enable for the Channel 19
#define AT91C_HCBDMA_CBIER20  ((unsigned int) 0x1 << 20) // (HCBDMA) Interrupt enable for the Channel 20
#define AT91C_HCBDMA_CBIER21  ((unsigned int) 0x1 << 21) // (HCBDMA) Interrupt enable for the Channel 21
#define AT91C_HCBDMA_CBIER22  ((unsigned int) 0x1 << 22) // (HCBDMA) Interrupt enable for the Channel 22
#define AT91C_HCBDMA_CBIER23  ((unsigned int) 0x1 << 23) // (HCBDMA) Interrupt enable for the Channel 23
#define AT91C_HCBDMA_CBIER24  ((unsigned int) 0x1 << 24) // (HCBDMA) Interrupt enable for the Channel 24
#define AT91C_HCBDMA_CBIER25  ((unsigned int) 0x1 << 25) // (HCBDMA) Interrupt enable for the Channel 25
#define AT91C_HCBDMA_CBIER26  ((unsigned int) 0x1 << 26) // (HCBDMA) Interrupt enable for the Channel 26
#define AT91C_HCBDMA_CBIER27  ((unsigned int) 0x1 << 27) // (HCBDMA) Interrupt enable for the Channel 27
#define AT91C_HCBDMA_CBIER28  ((unsigned int) 0x1 << 28) // (HCBDMA) Interrupt enable for the Channel 28
#define AT91C_HCBDMA_CBIER29  ((unsigned int) 0x1 << 29) // (HCBDMA) Interrupt enable for the Channel 29
#define AT91C_HCBDMA_CBIER30  ((unsigned int) 0x1 << 30) // (HCBDMA) Interrupt enable for the Channel 30
#define AT91C_HCBDMA_CBIER31  ((unsigned int) 0x1 << 31) // (HCBDMA) Interrupt enable for the Channel 31
// -------- HCBDMA_CBIDR : (HCBDMA Offset: 0x18) CB DMA Interrupt Disable Register -------- 
#define AT91C_HCBDMA_CBIDR0   ((unsigned int) 0x1 <<  0) // (HCBDMA) Interrupt disable for the Channel 0
#define AT91C_HCBDMA_CBIDR1   ((unsigned int) 0x1 <<  1) // (HCBDMA) Interrupt disable for the Channel 1
#define AT91C_HCBDMA_CBIDR2   ((unsigned int) 0x1 <<  2) // (HCBDMA) Interrupt disable for the Channel 2
#define AT91C_HCBDMA_CBIDR3   ((unsigned int) 0x1 <<  3) // (HCBDMA) Interrupt disable for the Channel 3
#define AT91C_HCBDMA_CBIDR4   ((unsigned int) 0x1 <<  4) // (HCBDMA) Interrupt disable for the Channel 4
#define AT91C_HCBDMA_CBIDR5   ((unsigned int) 0x1 <<  5) // (HCBDMA) Interrupt disable for the Channel 5
#define AT91C_HCBDMA_CBIDR6   ((unsigned int) 0x1 <<  6) // (HCBDMA) Interrupt disable for the Channel 6
#define AT91C_HCBDMA_CBIDR7   ((unsigned int) 0x1 <<  7) // (HCBDMA) Interrupt disable for the Channel 7
#define AT91C_HCBDMA_CBIDR8   ((unsigned int) 0x1 <<  8) // (HCBDMA) Interrupt disable for the Channel 8
#define AT91C_HCBDMA_CBIDR9   ((unsigned int) 0x1 <<  9) // (HCBDMA) Interrupt disable for the Channel 9
#define AT91C_HCBDMA_CBIDR10  ((unsigned int) 0x1 << 10) // (HCBDMA) Interrupt disable for the Channel 10
#define AT91C_HCBDMA_CBIDR11  ((unsigned int) 0x1 << 11) // (HCBDMA) Interrupt disable for the Channel 11
#define AT91C_HCBDMA_CBIDR12  ((unsigned int) 0x1 << 12) // (HCBDMA) Interrupt disable for the Channel 12
#define AT91C_HCBDMA_CBIDR13  ((unsigned int) 0x1 << 13) // (HCBDMA) Interrupt disable for the Channel 13
#define AT91C_HCBDMA_CBIDR14  ((unsigned int) 0x1 << 14) // (HCBDMA) Interrupt disable for the Channel 14
#define AT91C_HCBDMA_CBIDR15  ((unsigned int) 0x1 << 15) // (HCBDMA) Interrupt disable for the Channel 15
#define AT91C_HCBDMA_CBIDR16  ((unsigned int) 0x1 << 16) // (HCBDMA) Interrupt disable for the Channel 16
#define AT91C_HCBDMA_CBIDR17  ((unsigned int) 0x1 << 17) // (HCBDMA) Interrupt disable for the Channel 17
#define AT91C_HCBDMA_CBIDR18  ((unsigned int) 0x1 << 18) // (HCBDMA) Interrupt disable for the Channel 18
#define AT91C_HCBDMA_CBIDR19  ((unsigned int) 0x1 << 19) // (HCBDMA) Interrupt disable for the Channel 19
#define AT91C_HCBDMA_CBIDR20  ((unsigned int) 0x1 << 20) // (HCBDMA) Interrupt disable for the Channel 20
#define AT91C_HCBDMA_CBIDR21  ((unsigned int) 0x1 << 21) // (HCBDMA) Interrupt disable for the Channel 21
#define AT91C_HCBDMA_CBIDR22  ((unsigned int) 0x1 << 22) // (HCBDMA) Interrupt disable for the Channel 22
#define AT91C_HCBDMA_CBIDR23  ((unsigned int) 0x1 << 23) // (HCBDMA) Interrupt disable for the Channel 23
#define AT91C_HCBDMA_CBIDR24  ((unsigned int) 0x1 << 24) // (HCBDMA) Interrupt disable for the Channel 24
#define AT91C_HCBDMA_CBIDR25  ((unsigned int) 0x1 << 25) // (HCBDMA) Interrupt disable for the Channel 25
#define AT91C_HCBDMA_CBIDR26  ((unsigned int) 0x1 << 26) // (HCBDMA) Interrupt disable for the Channel 26
#define AT91C_HCBDMA_CBIDR27  ((unsigned int) 0x1 << 27) // (HCBDMA) Interrupt disable for the Channel 27
#define AT91C_HCBDMA_CBIDR28  ((unsigned int) 0x1 << 28) // (HCBDMA) Interrupt disable for the Channel 28
#define AT91C_HCBDMA_CBIDR29  ((unsigned int) 0x1 << 29) // (HCBDMA) Interrupt disable for the Channel 29
#define AT91C_HCBDMA_CBIDR30  ((unsigned int) 0x1 << 30) // (HCBDMA) Interrupt disable for the Channel 30
