una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s4.h
#define AT91C_HCBDMA_CBIDR31  ((unsigned int) 0x1 << 31) // (HCBDMA) Interrupt disable for the Channel 31
// -------- HCBDMA_CBIMR : (HCBDMA Offset: 0x1c) CB DMA Interrupt Mask Register -------- 
#define AT91C_HCBDMA_CBIMR0   ((unsigned int) 0x1 <<  0) // (HCBDMA) Interrupt mask for the Channel 0
#define AT91C_HCBDMA_CBIMR1   ((unsigned int) 0x1 <<  1) // (HCBDMA) Interrupt mask for the Channel 1
#define AT91C_HCBDMA_CBIMR2   ((unsigned int) 0x1 <<  2) // (HCBDMA) Interrupt mask for the Channel 2
#define AT91C_HCBDMA_CBIMR3   ((unsigned int) 0x1 <<  3) // (HCBDMA) Interrupt mask for the Channel 3
#define AT91C_HCBDMA_CBIMR4   ((unsigned int) 0x1 <<  4) // (HCBDMA) Interrupt mask for the Channel 4
#define AT91C_HCBDMA_CBIMR5   ((unsigned int) 0x1 <<  5) // (HCBDMA) Interrupt mask for the Channel 5
#define AT91C_HCBDMA_CBIMR6   ((unsigned int) 0x1 <<  6) // (HCBDMA) Interrupt mask for the Channel 6
#define AT91C_HCBDMA_CBIMR7   ((unsigned int) 0x1 <<  7) // (HCBDMA) Interrupt mask for the Channel 7
#define AT91C_HCBDMA_CBIMR8   ((unsigned int) 0x1 <<  8) // (HCBDMA) Interrupt mask for the Channel 8
#define AT91C_HCBDMA_CBIMR9   ((unsigned int) 0x1 <<  9) // (HCBDMA) Interrupt mask for the Channel 9
#define AT91C_HCBDMA_CBIMR10  ((unsigned int) 0x1 << 10) // (HCBDMA) Interrupt mask for the Channel 10
#define AT91C_HCBDMA_CBIMR11  ((unsigned int) 0x1 << 11) // (HCBDMA) Interrupt mask for the Channel 11
#define AT91C_HCBDMA_CBIMR12  ((unsigned int) 0x1 << 12) // (HCBDMA) Interrupt mask for the Channel 12
#define AT91C_HCBDMA_CBIMR13  ((unsigned int) 0x1 << 13) // (HCBDMA) Interrupt mask for the Channel 13
#define AT91C_HCBDMA_CBIMR14  ((unsigned int) 0x1 << 14) // (HCBDMA) Interrupt mask for the Channel 14
#define AT91C_HCBDMA_CBIMR15  ((unsigned int) 0x1 << 15) // (HCBDMA) Interrupt mask for the Channel 15
#define AT91C_HCBDMA_CBIMR16  ((unsigned int) 0x1 << 16) // (HCBDMA) Interrupt mask for the Channel 16
#define AT91C_HCBDMA_CBIMR17  ((unsigned int) 0x1 << 17) // (HCBDMA) Interrupt mask for the Channel 17
#define AT91C_HCBDMA_CBIMR18  ((unsigned int) 0x1 << 18) // (HCBDMA) Interrupt mask for the Channel 18
#define AT91C_HCBDMA_CBIMR19  ((unsigned int) 0x1 << 19) // (HCBDMA) Interrupt mask for the Channel 19
#define AT91C_HCBDMA_CBIMR20  ((unsigned int) 0x1 << 20) // (HCBDMA) Interrupt mask for the Channel 20
#define AT91C_HCBDMA_CBIMR21  ((unsigned int) 0x1 << 21) // (HCBDMA) Interrupt mask for the Channel 21
#define AT91C_HCBDMA_CBIMR22  ((unsigned int) 0x1 << 22) // (HCBDMA) Interrupt mask for the Channel 22
#define AT91C_HCBDMA_CBIMR23  ((unsigned int) 0x1 << 23) // (HCBDMA) Interrupt mask for the Channel 23
#define AT91C_HCBDMA_CBIMR24  ((unsigned int) 0x1 << 24) // (HCBDMA) Interrupt mask for the Channel 24
#define AT91C_HCBDMA_CBIMR25  ((unsigned int) 0x1 << 25) // (HCBDMA) Interrupt mask for the Channel 25
#define AT91C_HCBDMA_CBIMR26  ((unsigned int) 0x1 << 26) // (HCBDMA) Interrupt mask for the Channel 26
#define AT91C_HCBDMA_CBIMR27  ((unsigned int) 0x1 << 27) // (HCBDMA) Interrupt mask for the Channel 27
#define AT91C_HCBDMA_CBIMR28  ((unsigned int) 0x1 << 28) // (HCBDMA) Interrupt mask for the Channel 28
#define AT91C_HCBDMA_CBIMR29  ((unsigned int) 0x1 << 29) // (HCBDMA) Interrupt mask for the Channel 29
#define AT91C_HCBDMA_CBIMR30  ((unsigned int) 0x1 << 30) // (HCBDMA) Interrupt mask for the Channel 30
#define AT91C_HCBDMA_CBIMR31  ((unsigned int) 0x1 << 31) // (HCBDMA) Interrupt mask for the Channel 31
// -------- HCBDMA_CBISR : (HCBDMA Offset: 0x20) CB DMA Interrupt Satus Register -------- 
#define AT91C_HCBDMA_CBISR0   ((unsigned int) 0x1 <<  0) // (HCBDMA) Interrupt status for the Channel 0
#define AT91C_HCBDMA_CBISR1   ((unsigned int) 0x1 <<  1) // (HCBDMA) Interrupt status for the Channel 1
#define AT91C_HCBDMA_CBISR2   ((unsigned int) 0x1 <<  2) // (HCBDMA) Interrupt status for the Channel 2
#define AT91C_HCBDMA_CBISR3   ((unsigned int) 0x1 <<  3) // (HCBDMA) Interrupt status for the Channel 3
#define AT91C_HCBDMA_CBISR4   ((unsigned int) 0x1 <<  4) // (HCBDMA) Interrupt status for the Channel 4
#define AT91C_HCBDMA_CBISR5   ((unsigned int) 0x1 <<  5) // (HCBDMA) Interrupt status for the Channel 5
#define AT91C_HCBDMA_CBISR6   ((unsigned int) 0x1 <<  6) // (HCBDMA) Interrupt status for the Channel 6
#define AT91C_HCBDMA_CBISR7   ((unsigned int) 0x1 <<  7) // (HCBDMA) Interrupt status for the Channel 7
#define AT91C_HCBDMA_CBISR8   ((unsigned int) 0x1 <<  8) // (HCBDMA) Interrupt status for the Channel 8
#define AT91C_HCBDMA_CBISR9   ((unsigned int) 0x1 <<  9) // (HCBDMA) Interrupt status for the Channel 9
#define AT91C_HCBDMA_CBISR10  ((unsigned int) 0x1 << 10) // (HCBDMA) Interrupt status for the Channel 10
#define AT91C_HCBDMA_CBISR11  ((unsigned int) 0x1 << 11) // (HCBDMA) Interrupt status for the Channel 11
#define AT91C_HCBDMA_CBISR12  ((unsigned int) 0x1 << 12) // (HCBDMA) Interrupt status for the Channel 12
#define AT91C_HCBDMA_CBISR13  ((unsigned int) 0x1 << 13) // (HCBDMA) Interrupt status for the Channel 13
#define AT91C_HCBDMA_CBISR14  ((unsigned int) 0x1 << 14) // (HCBDMA) Interrupt status for the Channel 14
#define AT91C_HCBDMA_CBISR15  ((unsigned int) 0x1 << 15) // (HCBDMA) Interrupt status for the Channel 15
#define AT91C_HCBDMA_CBISR16  ((unsigned int) 0x1 << 16) // (HCBDMA) Interrupt status for the Channel 16
#define AT91C_HCBDMA_CBISR17  ((unsigned int) 0x1 << 17) // (HCBDMA) Interrupt status for the Channel 17
#define AT91C_HCBDMA_CBISR18  ((unsigned int) 0x1 << 18) // (HCBDMA) Interrupt status for the Channel 18
#define AT91C_HCBDMA_CBISR19  ((unsigned int) 0x1 << 19) // (HCBDMA) Interrupt status for the Channel 19
#define AT91C_HCBDMA_CBISR20  ((unsigned int) 0x1 << 20) // (HCBDMA) Interrupt status for the Channel 20
#define AT91C_HCBDMA_CBISR21  ((unsigned int) 0x1 << 21) // (HCBDMA) Interrupt status for the Channel 21
#define AT91C_HCBDMA_CBISR22  ((unsigned int) 0x1 << 22) // (HCBDMA) Interrupt status for the Channel 22
#define AT91C_HCBDMA_CBISR23  ((unsigned int) 0x1 << 23) // (HCBDMA) Interrupt status for the Channel 23
#define AT91C_HCBDMA_CBISR24  ((unsigned int) 0x1 << 24) // (HCBDMA) Interrupt status for the Channel 24
#define AT91C_HCBDMA_CBISR25  ((unsigned int) 0x1 << 25) // (HCBDMA) Interrupt status for the Channel 25
#define AT91C_HCBDMA_CBISR26  ((unsigned int) 0x1 << 26) // (HCBDMA) Interrupt status for the Channel 26
#define AT91C_HCBDMA_CBISR27  ((unsigned int) 0x1 << 27) // (HCBDMA) Interrupt status for the Channel 27
#define AT91C_HCBDMA_CBISR28  ((unsigned int) 0x1 << 28) // (HCBDMA) Interrupt status for the Channel 28
#define AT91C_HCBDMA_CBISR29  ((unsigned int) 0x1 << 29) // (HCBDMA) Interrupt status for the Channel 29
#define AT91C_HCBDMA_CBISR30  ((unsigned int) 0x1 << 30) // (HCBDMA) Interrupt status for the Channel 30
#define AT91C_HCBDMA_CBISR31  ((unsigned int) 0x1 << 31) // (HCBDMA) Interrupt status for the Channel 31
// -------- HCBDMA_CBDLIER : (HCBDMA Offset: 0x24) CB DMA Loaded Interrupt Enable Register -------- 
#define AT91C_HCBDMA_CBDLIER0 ((unsigned int) 0x1 <<  0) // (HCBDMA) Interrupt enable for the Channel 0
#define AT91C_HCBDMA_CBDLIER1 ((unsigned int) 0x1 <<  1) // (HCBDMA) Interrupt enable for the Channel 1
#define AT91C_HCBDMA_CBDLIER2 ((unsigned int) 0x1 <<  2) // (HCBDMA) Interrupt enable for the Channel 2
#define AT91C_HCBDMA_CBDLIER3 ((unsigned int) 0x1 <<  3) // (HCBDMA) Interrupt enable for the Channel 3
#define AT91C_HCBDMA_CBDLIER4 ((unsigned int) 0x1 <<  4) // (HCBDMA) Interrupt enable for the Channel 4
#define AT91C_HCBDMA_CBDLIER5 ((unsigned int) 0x1 <<  5) // (HCBDMA) Interrupt enable for the Channel 5
#define AT91C_HCBDMA_CBDLIER6 ((unsigned int) 0x1 <<  6) // (HCBDMA) Interrupt enable for the Channel 6
#define AT91C_HCBDMA_CBDLIER7 ((unsigned int) 0x1 <<  7) // (HCBDMA) Interrupt enable for the Channel 7
#define AT91C_HCBDMA_CBDLIER8 ((unsigned int) 0x1 <<  8) // (HCBDMA) Interrupt enable for the Channel 8
#define AT91C_HCBDMA_CBDLIER9 ((unsigned int) 0x1 <<  9) // (HCBDMA) Interrupt enable for the Channel 9
#define AT91C_HCBDMA_CBDLIER10 ((unsigned int) 0x1 << 10) // (HCBDMA) Interrupt enable for the Channel 10
#define AT91C_HCBDMA_CBDLIER11 ((unsigned int) 0x1 << 11) // (HCBDMA) Interrupt enable for the Channel 11
#define AT91C_HCBDMA_CBDLIER12 ((unsigned int) 0x1 << 12) // (HCBDMA) Interrupt enable for the Channel 12
#define AT91C_HCBDMA_CBDLIER13 ((unsigned int) 0x1 << 13) // (HCBDMA) Interrupt enable for the Channel 13
#define AT91C_HCBDMA_CBDLIER14 ((unsigned int) 0x1 << 14) // (HCBDMA) Interrupt enable for the Channel 14
#define AT91C_HCBDMA_CBDLIER15 ((unsigned int) 0x1 << 15) // (HCBDMA) Interrupt enable for the Channel 15
#define AT91C_HCBDMA_CBDLIER16 ((unsigned int) 0x1 << 16) // (HCBDMA) Interrupt enable for the Channel 16
#define AT91C_HCBDMA_CBDLIER17 ((unsigned int) 0x1 << 17) // (HCBDMA) Interrupt enable for the Channel 17
#define AT91C_HCBDMA_CBDLIER18 ((unsigned int) 0x1 << 18) // (HCBDMA) Interrupt enable for the Channel 18
#define AT91C_HCBDMA_CBDLIER19 ((unsigned int) 0x1 << 19) // (HCBDMA) Interrupt enable for the Channel 19
#define AT91C_HCBDMA_CBDLIER20 ((unsigned int) 0x1 << 20) // (HCBDMA) Interrupt enable for the Channel 20
#define AT91C_HCBDMA_CBDLIER21 ((unsigned int) 0x1 << 21) // (HCBDMA) Interrupt enable for the Channel 21
#define AT91C_HCBDMA_CBDLIER22 ((unsigned int) 0x1 << 22) // (HCBDMA) Interrupt enable for the Channel 22
#define AT91C_HCBDMA_CBDLIER23 ((unsigned int) 0x1 << 23) // (HCBDMA) Interrupt enable for the Channel 23
#define AT91C_HCBDMA_CBDLIER24 ((unsigned int) 0x1 << 24) // (HCBDMA) Interrupt enable for the Channel 24
#define AT91C_HCBDMA_CBDLIER25 ((unsigned int) 0x1 << 25) // (HCBDMA) Interrupt enable for the Channel 25
#define AT91C_HCBDMA_CBDLIER26 ((unsigned int) 0x1 << 26) // (HCBDMA) Interrupt enable for the Channel 26
#define AT91C_HCBDMA_CBDLIER27 ((unsigned int) 0x1 << 27) // (HCBDMA) Interrupt enable for the Channel 27
#define AT91C_HCBDMA_CBDLIER28 ((unsigned int) 0x1 << 28) // (HCBDMA) Interrupt enable for the Channel 28
#define AT91C_HCBDMA_CBDLIER29 ((unsigned int) 0x1 << 29) // (HCBDMA) Interrupt enable for the Channel 29
#define AT91C_HCBDMA_CBDLIER30 ((unsigned int) 0x1 << 30) // (HCBDMA) Interrupt enable for the Channel 30
#define AT91C_HCBDMA_CBDLIER31 ((unsigned int) 0x1 << 31) // (HCBDMA) Interrupt enable for the Channel 31
// -------- HCBDMA_CBDLIDR : (HCBDMA Offset: 0x28) CB DMA Interrupt Disable Register -------- 
#define AT91C_HCBDMA_CBDLIDR0 ((unsigned int) 0x1 <<  0) // (HCBDMA) Interrupt disable for the Channel 0
#define AT91C_HCBDMA_CBDLIDR1 ((unsigned int) 0x1 <<  1) // (HCBDMA) Interrupt disable for the Channel 1
#define AT91C_HCBDMA_CBDLIDR2 ((unsigned int) 0x1 <<  2) // (HCBDMA) Interrupt disable for the Channel 2
#define AT91C_HCBDMA_CBDLIDR3 ((unsigned int) 0x1 <<  3) // (HCBDMA) Interrupt disable for the Channel 3
#define AT91C_HCBDMA_CBDLIDR4 ((unsigned int) 0x1 <<  4) // (HCBDMA) Interrupt disable for the Channel 4
#define AT91C_HCBDMA_CBDLIDR5 ((unsigned int) 0x1 <<  5) // (HCBDMA) Interrupt disable for the Channel 5
#define AT91C_HCBDMA_CBDLIDR6 ((unsigned int) 0x1 <<  6) // (HCBDMA) Interrupt disable for the Channel 6
#define AT91C_HCBDMA_CBDLIDR7 ((unsigned int) 0x1 <<  7) // (HCBDMA) Interrupt disable for the Channel 7
#define AT91C_HCBDMA_CBDLIDR8 ((unsigned int) 0x1 <<  8) // (HCBDMA) Interrupt disable for the Channel 8
#define AT91C_HCBDMA_CBDLIDR9 ((unsigned int) 0x1 <<  9) // (HCBDMA) Interrupt disable for the Channel 9
#define AT91C_HCBDMA_CBDLIDR10 ((unsigned int) 0x1 << 10) // (HCBDMA) Interrupt disable for the Channel 10
#define AT91C_HCBDMA_CBDLIDR11 ((unsigned int) 0x1 << 11) // (HCBDMA) Interrupt disable for the Channel 11
#define AT91C_HCBDMA_CBDLIDR12 ((unsigned int) 0x1 << 12) // (HCBDMA) Interrupt disable for the Channel 12
#define AT91C_HCBDMA_CBDLIDR13 ((unsigned int) 0x1 << 13) // (HCBDMA) Interrupt disable for the Channel 13
#define AT91C_HCBDMA_CBDLIDR14 ((unsigned int) 0x1 << 14) // (HCBDMA) Interrupt disable for the Channel 14
#define AT91C_HCBDMA_CBDLIDR15 ((unsigned int) 0x1 << 15) // (HCBDMA) Interrupt disable for the Channel 15
#define AT91C_HCBDMA_CBDLIDR16 ((unsigned int) 0x1 << 16) // (HCBDMA) Interrupt disable for the Channel 16
#define AT91C_HCBDMA_CBDLIDR17 ((unsigned int) 0x1 << 17) // (HCBDMA) Interrupt disable for the Channel 17
#define AT91C_HCBDMA_CBDLIDR18 ((unsigned int) 0x1 << 18) // (HCBDMA) Interrupt disable for the Channel 18
#define AT91C_HCBDMA_CBDLIDR19 ((unsigned int) 0x1 << 19) // (HCBDMA) Interrupt disable for the Channel 19
#define AT91C_HCBDMA_CBDLIDR20 ((unsigned int) 0x1 << 20) // (HCBDMA) Interrupt disable for the Channel 20
#define AT91C_HCBDMA_CBDLIDR21 ((unsigned int) 0x1 << 21) // (HCBDMA) Interrupt disable for the Channel 21
#define AT91C_HCBDMA_CBDLIDR22 ((unsigned int) 0x1 << 22) // (HCBDMA) Interrupt disable for the Channel 22
#define AT91C_HCBDMA_CBDLIDR23 ((unsigned int) 0x1 << 23) // (HCBDMA) Interrupt disable for the Channel 23
#define AT91C_HCBDMA_CBDLIDR24 ((unsigned int) 0x1 << 24) // (HCBDMA) Interrupt disable for the Channel 24
#define AT91C_HCBDMA_CBDLIDR25 ((unsigned int) 0x1 << 25) // (HCBDMA) Interrupt disable for the Channel 25
#define AT91C_HCBDMA_CBDLIDR26 ((unsigned int) 0x1 << 26) // (HCBDMA) Interrupt disable for the Channel 26
#define AT91C_HCBDMA_CBDLIDR27 ((unsigned int) 0x1 << 27) // (HCBDMA) Interrupt disable for the Channel 27
#define AT91C_HCBDMA_CBDLIDR28 ((unsigned int) 0x1 << 28) // (HCBDMA) Interrupt disable for the Channel 28
#define AT91C_HCBDMA_CBDLIDR29 ((unsigned int) 0x1 << 29) // (HCBDMA) Interrupt disable for the Channel 29
#define AT91C_HCBDMA_CBDLIDR30 ((unsigned int) 0x1 << 30) // (HCBDMA) Interrupt disable for the Channel 30
#define AT91C_HCBDMA_CBDLIDR31 ((unsigned int) 0x1 << 31) // (HCBDMA) Interrupt disable for the Channel 31
// -------- HCBDMA_CBDLIMR : (HCBDMA Offset: 0x2c) CB DMA Interrupt Mask Register -------- 
#define AT91C_HCBDMA_CBDLIMR0 ((unsigned int) 0x1 <<  0) // (HCBDMA) Interrupt mask for the Channel 0
#define AT91C_HCBDMA_CBDLIMR1 ((unsigned int) 0x1 <<  1) // (HCBDMA) Interrupt mask for the Channel 1
#define AT91C_HCBDMA_CBDLIMR2 ((unsigned int) 0x1 <<  2) // (HCBDMA) Interrupt mask for the Channel 2
#define AT91C_HCBDMA_CBDLIMR3 ((unsigned int) 0x1 <<  3) // (HCBDMA) Interrupt mask for the Channel 3
#define AT91C_HCBDMA_CBDLIMR4 ((unsigned int) 0x1 <<  4) // (HCBDMA) Interrupt mask for the Channel 4
#define AT91C_HCBDMA_CBDLIMR5 ((unsigned int) 0x1 <<  5) // (HCBDMA) Interrupt mask for the Channel 5
#define AT91C_HCBDMA_CBDLIMR6 ((unsigned int) 0x1 <<  6) // (HCBDMA) Interrupt mask for the Channel 6
#define AT91C_HCBDMA_CBDLIMR7 ((unsigned int) 0x1 <<  7) // (HCBDMA) Interrupt mask for the Channel 7
#define AT91C_HCBDMA_CBDLIMR8 ((unsigned int) 0x1 <<  8) // (HCBDMA) Interrupt mask for the Channel 8
#define AT91C_HCBDMA_CBDLIMR9 ((unsigned int) 0x1 <<  9) // (HCBDMA) Interrupt mask for the Channel 9
#define AT91C_HCBDMA_CBDLIMR10 ((unsigned int) 0x1 << 10) // (HCBDMA) Interrupt mask for the Channel 10
#define AT91C_HCBDMA_CBDLIMR11 ((unsigned int) 0x1 << 11) // (HCBDMA) Interrupt mask for the Channel 11
#define AT91C_HCBDMA_CBDLIMR12 ((unsigned int) 0x1 << 12) // (HCBDMA) Interrupt mask for the Channel 12
#define AT91C_HCBDMA_CBDLIMR13 ((unsigned int) 0x1 << 13) // (HCBDMA) Interrupt mask for the Channel 13
#define AT91C_HCBDMA_CBDLIMR14 ((unsigned int) 0x1 << 14) // (HCBDMA) Interrupt mask for the Channel 14
#define AT91C_HCBDMA_CBDLIMR15 ((unsigned int) 0x1 << 15) // (HCBDMA) Interrupt mask for the Channel 15
#define AT91C_HCBDMA_CBDLIMR16 ((unsigned int) 0x1 << 16) // (HCBDMA) Interrupt mask for the Channel 16
#define AT91C_HCBDMA_CBDLIMR17 ((unsigned int) 0x1 << 17) // (HCBDMA) Interrupt mask for the Channel 17
#define AT91C_HCBDMA_CBDLIMR18 ((unsigned int) 0x1 << 18) // (HCBDMA) Interrupt mask for the Channel 18
#define AT91C_HCBDMA_CBDLIMR19 ((unsigned int) 0x1 << 19) // (HCBDMA) Interrupt mask for the Channel 19
#define AT91C_HCBDMA_CBDLIMR20 ((unsigned int) 0x1 << 20) // (HCBDMA) Interrupt mask for the Channel 20
#define AT91C_HCBDMA_CBDLIMR21 ((unsigned int) 0x1 << 21) // (HCBDMA) Interrupt mask for the Channel 21
#define AT91C_HCBDMA_CBDLIMR22 ((unsigned int) 0x1 << 22) // (HCBDMA) Interrupt mask for the Channel 22
#define AT91C_HCBDMA_CBDLIMR23 ((unsigned int) 0x1 << 23) // (HCBDMA) Interrupt mask for the Channel 23
#define AT91C_HCBDMA_CBDLIMR24 ((unsigned int) 0x1 << 24) // (HCBDMA) Interrupt mask for the Channel 24
#define AT91C_HCBDMA_CBDLIMR25 ((unsigned int) 0x1 << 25) // (HCBDMA) Interrupt mask for the Channel 25
#define AT91C_HCBDMA_CBDLIMR26 ((unsigned int) 0x1 << 26) // (HCBDMA) Interrupt mask for the Channel 26
#define AT91C_HCBDMA_CBDLIMR27 ((unsigned int) 0x1 << 27) // (HCBDMA) Interrupt mask for the Channel 27
#define AT91C_HCBDMA_CBDLIMR28 ((unsigned int) 0x1 << 28) // (HCBDMA) Interrupt mask for the Channel 28
#define AT91C_HCBDMA_CBDLIMR29 ((unsigned int) 0x1 << 29) // (HCBDMA) Interrupt mask for the Channel 29
#define AT91C_HCBDMA_CBDLIMR30 ((unsigned int) 0x1 << 30) // (HCBDMA) Interrupt mask for the Channel 30
#define AT91C_HCBDMA_CBDLIMR31 ((unsigned int) 0x1 << 31) // (HCBDMA) Interrupt mask for the Channel 31
// -------- HCBDMA_CBDLISR : (HCBDMA Offset: 0x30) CB DMA Interrupt Satus Register -------- 
#define AT91C_HCBDMA_CBDLISR0 ((unsigned int) 0x1 <<  0) // (HCBDMA) Interrupt status for the Channel 0
#define AT91C_HCBDMA_CBDLISR1 ((unsigned int) 0x1 <<  1) // (HCBDMA) Interrupt status for the Channel 1
#define AT91C_HCBDMA_CBDLISR2 ((unsigned int) 0x1 <<  2) // (HCBDMA) Interrupt status for the Channel 2
#define AT91C_HCBDMA_CBDLISR3 ((unsigned int) 0x1 <<  3) // (HCBDMA) Interrupt status for the Channel 3
#define AT91C_HCBDMA_CBDLISR4 ((unsigned int) 0x1 <<  4) // (HCBDMA) Interrupt status for the Channel 4
#define AT91C_HCBDMA_CBDLISR5 ((unsigned int) 0x1 <<  5) // (HCBDMA) Interrupt status for the Channel 5
#define AT91C_HCBDMA_CBDLISR6 ((unsigned int) 0x1 <<  6) // (HCBDMA) Interrupt status for the Channel 6
#define AT91C_HCBDMA_CBDLISR7 ((unsigned int) 0x1 <<  7) // (HCBDMA) Interrupt status for the Channel 7
#define AT91C_HCBDMA_CBDLISR8 ((unsigned int) 0x1 <<  8) // (HCBDMA) Interrupt status for the Channel 8
#define AT91C_HCBDMA_CBDLISR9 ((unsigned int) 0x1 <<  9) // (HCBDMA) Interrupt status for the Channel 9
#define AT91C_HCBDMA_CBDLISR10 ((unsigned int) 0x1 << 10) // (HCBDMA) Interrupt status for the Channel 10
#define AT91C_HCBDMA_CBDLISR11 ((unsigned int) 0x1 << 11) // (HCBDMA) Interrupt status for the Channel 11
#define AT91C_HCBDMA_CBDLISR12 ((unsigned int) 0x1 << 12) // (HCBDMA) Interrupt status for the Channel 12
#define AT91C_HCBDMA_CBDLISR13 ((unsigned int) 0x1 << 13) // (HCBDMA) Interrupt status for the Channel 13
#define AT91C_HCBDMA_CBDLISR14 ((unsigned int) 0x1 << 14) // (HCBDMA) Interrupt status for the Channel 14
#define AT91C_HCBDMA_CBDLISR15 ((unsigned int) 0x1 << 15) // (HCBDMA) Interrupt status for the Channel 15
#define AT91C_HCBDMA_CBDLISR16 ((unsigned int) 0x1 << 16) // (HCBDMA) Interrupt status for the Channel 16
#define AT91C_HCBDMA_CBDLISR17 ((unsigned int) 0x1 << 17) // (HCBDMA) Interrupt status for the Channel 17
#define AT91C_HCBDMA_CBDLISR18 ((unsigned int) 0x1 << 18) // (HCBDMA) Interrupt status for the Channel 18
#define AT91C_HCBDMA_CBDLISR19 ((unsigned int) 0x1 << 19) // (HCBDMA) Interrupt status for the Channel 19
#define AT91C_HCBDMA_CBDLISR20 ((unsigned int) 0x1 << 20) // (HCBDMA) Interrupt status for the Channel 20
#define AT91C_HCBDMA_CBDLISR21 ((unsigned int) 0x1 << 21) // (HCBDMA) Interrupt status for the Channel 21
#define AT91C_HCBDMA_CBDLISR22 ((unsigned int) 0x1 << 22) // (HCBDMA) Interrupt status for the Channel 22
#define AT91C_HCBDMA_CBDLISR23 ((unsigned int) 0x1 << 23) // (HCBDMA) Interrupt status for the Channel 23
#define AT91C_HCBDMA_CBDLISR24 ((unsigned int) 0x1 << 24) // (HCBDMA) Interrupt status for the Channel 24
#define AT91C_HCBDMA_CBDLISR25 ((unsigned int) 0x1 << 25) // (HCBDMA) Interrupt status for the Channel 25
#define AT91C_HCBDMA_CBDLISR26 ((unsigned int) 0x1 << 26) // (HCBDMA) Interrupt status for the Channel 26
#define AT91C_HCBDMA_CBDLISR27 ((unsigned int) 0x1 << 27) // (HCBDMA) Interrupt status for the Channel 27
#define AT91C_HCBDMA_CBDLISR28 ((unsigned int) 0x1 << 28) // (HCBDMA) Interrupt status for the Channel 28
#define AT91C_HCBDMA_CBDLISR29 ((unsigned int) 0x1 << 29) // (HCBDMA) Interrupt status for the Channel 29
#define AT91C_HCBDMA_CBDLISR30 ((unsigned int) 0x1 << 30) // (HCBDMA) Interrupt status for the Channel 30
#define AT91C_HCBDMA_CBDLISR31 ((unsigned int) 0x1 << 31) // (HCBDMA) Interrupt status for the Channel 31
// -------- HCBDMA_CBCRCCR : (HCBDMA Offset: 0x34) CB DMA CRC Control Resgister -------- 
#define AT91C_CRC_START       ((unsigned int) 0x1 <<  0) // (HCBDMA) CRC compuration initialization
// -------- HCBDMA_CBCRCMR : (HCBDMA Offset: 0x38) CB DMA CRC Mode Resgister -------- 
#define AT91C_CRC_ENABLE      ((unsigned int) 0x1 <<  0) // (HCBDMA) CRC Enable
#define AT91C_CRC_COMPARE     ((unsigned int) 0x1 <<  1) // (HCBDMA) CRC Compare
#define AT91C_CRC_PTYPE       ((unsigned int) 0x3 <<  2) // (HCBDMA) Primitive polynomial type
#define 	AT91C_CRC_PTYPE_CCIT802_3            ((unsigned int) 0x0 <<  2) // (HCBDMA) 
#define 	AT91C_CRC_PTYPE_CASTAGNOLI           ((unsigned int) 0x1 <<  2) // (HCBDMA) 
#define 	AT91C_CRC_PTYPE_CCIT_16              ((unsigned int) 0x2 <<  2) // (HCBDMA) 
#define AT91C_CRC_DIVIDER     ((unsigned int) 0xF <<  4) // (HCBDMA) Request Divider
#define AT91C_CRC_ID          ((unsigned int) 0x1F <<  8) // (HCBDMA) CRC channel Identifier
#define 	AT91C_CRC_ID_CHANNEL_0            ((unsigned int) 0x0 <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_1            ((unsigned int) 0x1 <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_2            ((unsigned int) 0x2 <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_3            ((unsigned int) 0x3 <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_4            ((unsigned int) 0x4 <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_5            ((unsigned int) 0x5 <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_6            ((unsigned int) 0x6 <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_7            ((unsigned int) 0x7 <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_8            ((unsigned int) 0x8 <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_9            ((unsigned int) 0x9 <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_10           ((unsigned int) 0xA <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_11           ((unsigned int) 0xB <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_12           ((unsigned int) 0xC <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_13           ((unsigned int) 0xD <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_14           ((unsigned int) 0xE <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_15           ((unsigned int) 0xF <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_16           ((unsigned int) 0x10 <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_17           ((unsigned int) 0x11 <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_18           ((unsigned int) 0x12 <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_19           ((unsigned int) 0x13 <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_20           ((unsigned int) 0x14 <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_21           ((unsigned int) 0x15 <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_22           ((unsigned int) 0x16 <<  8) // (HCBDMA) 
#define 	AT91C_CRC_ID_CHANNEL_23           ((unsigned int) 0x17 <<  8) // (HCBDMA) 
