una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s4.h
// *****************************************************************************
//               REGISTER ADDRESS DEFINITION FOR AT91SAM3S4
// *****************************************************************************
// ========== Register definition for SYS peripheral ========== 
#define AT91C_SYS_GPBR  ((AT91_REG *) 	0x400E1490) // (SYS) General Purpose Register
// ========== Register definition for SMC peripheral ========== 
#define AT91C_SMC_DELAY2 ((AT91_REG *) 	0x400E00C4) // (SMC) SMC Delay Control Register
#define AT91C_SMC_CYCLE4 ((AT91_REG *) 	0x400E0048) // (SMC)  Cycle Register for CS 4
#define AT91C_SMC_CTRL5 ((AT91_REG *) 	0x400E005C) // (SMC)  Control Register for CS 5
#define AT91C_SMC_IPNAME2 ((AT91_REG *) 	0x400E00F4) // (SMC) HSMC3 IPNAME2 REGISTER 
#define AT91C_SMC_DELAY5 ((AT91_REG *) 	0x400E00D0) // (SMC) SMC Delay Control Register
#define AT91C_SMC_DELAY4 ((AT91_REG *) 	0x400E00CC) // (SMC) SMC Delay Control Register
#define AT91C_SMC_CYCLE0 ((AT91_REG *) 	0x400E0008) // (SMC)  Cycle Register for CS 0
#define AT91C_SMC_PULSE1 ((AT91_REG *) 	0x400E0014) // (SMC)  Pulse Register for CS 1
#define AT91C_SMC_DELAY6 ((AT91_REG *) 	0x400E00D4) // (SMC) SMC Delay Control Register
#define AT91C_SMC_FEATURES ((AT91_REG *) 	0x400E00F8) // (SMC) HSMC3 FEATURES REGISTER 
#define AT91C_SMC_DELAY3 ((AT91_REG *) 	0x400E00C8) // (SMC) SMC Delay Control Register
#define AT91C_SMC_CTRL1 ((AT91_REG *) 	0x400E001C) // (SMC)  Control Register for CS 1
#define AT91C_SMC_PULSE7 ((AT91_REG *) 	0x400E0074) // (SMC)  Pulse Register for CS 7
#define AT91C_SMC_CTRL7 ((AT91_REG *) 	0x400E007C) // (SMC)  Control Register for CS 7
#define AT91C_SMC_VER   ((AT91_REG *) 	0x400E00FC) // (SMC) HSMC3 VERSION REGISTER
#define AT91C_SMC_SETUP5 ((AT91_REG *) 	0x400E0050) // (SMC)  Setup Register for CS 5
#define AT91C_SMC_CYCLE3 ((AT91_REG *) 	0x400E0038) // (SMC)  Cycle Register for CS 3
#define AT91C_SMC_SETUP3 ((AT91_REG *) 	0x400E0030) // (SMC)  Setup Register for CS 3
#define AT91C_SMC_DELAY1 ((AT91_REG *) 	0x400E00C0) // (SMC) SMC Delay Control Register
#define AT91C_SMC_ADDRSIZE ((AT91_REG *) 	0x400E00EC) // (SMC) HSMC3 ADDRSIZE REGISTER 
#define AT91C_SMC_PULSE3 ((AT91_REG *) 	0x400E0034) // (SMC)  Pulse Register for CS 3
#define AT91C_SMC_PULSE5 ((AT91_REG *) 	0x400E0054) // (SMC)  Pulse Register for CS 5
#define AT91C_SMC_PULSE4 ((AT91_REG *) 	0x400E0044) // (SMC)  Pulse Register for CS 4
#define AT91C_SMC_SETUP2 ((AT91_REG *) 	0x400E0020) // (SMC)  Setup Register for CS 2
#define AT91C_SMC_DELAY8 ((AT91_REG *) 	0x400E00DC) // (SMC) SMC Delay Control Register
#define AT91C_SMC_CYCLE7 ((AT91_REG *) 	0x400E0078) // (SMC)  Cycle Register for CS 7
#define AT91C_SMC_CTRL0 ((AT91_REG *) 	0x400E000C) // (SMC)  Control Register for CS 0
#define AT91C_SMC_CYCLE2 ((AT91_REG *) 	0x400E0028) // (SMC)  Cycle Register for CS 2
#define AT91C_SMC_IPNAME1 ((AT91_REG *) 	0x400E00F0) // (SMC) HSMC3 IPNAME1 REGISTER 
#define AT91C_SMC_SETUP1 ((AT91_REG *) 	0x400E0010) // (SMC)  Setup Register for CS 1
#define AT91C_SMC_CTRL2 ((AT91_REG *) 	0x400E002C) // (SMC)  Control Register for CS 2
#define AT91C_SMC_CTRL4 ((AT91_REG *) 	0x400E004C) // (SMC)  Control Register for CS 4
#define AT91C_SMC_SETUP6 ((AT91_REG *) 	0x400E0060) // (SMC)  Setup Register for CS 6
#define AT91C_SMC_CYCLE5 ((AT91_REG *) 	0x400E0058) // (SMC)  Cycle Register for CS 5
#define AT91C_SMC_CTRL6 ((AT91_REG *) 	0x400E006C) // (SMC)  Control Register for CS 6
#define AT91C_SMC_SETUP4 ((AT91_REG *) 	0x400E0040) // (SMC)  Setup Register for CS 4
#define AT91C_SMC_PULSE2 ((AT91_REG *) 	0x400E0024) // (SMC)  Pulse Register for CS 2
#define AT91C_SMC_DELAY7 ((AT91_REG *) 	0x400E00D8) // (SMC) SMC Delay Control Register
#define AT91C_SMC_SETUP7 ((AT91_REG *) 	0x400E0070) // (SMC)  Setup Register for CS 7
#define AT91C_SMC_CYCLE1 ((AT91_REG *) 	0x400E0018) // (SMC)  Cycle Register for CS 1
#define AT91C_SMC_CTRL3 ((AT91_REG *) 	0x400E003C) // (SMC)  Control Register for CS 3
#define AT91C_SMC_SETUP0 ((AT91_REG *) 	0x400E0000) // (SMC)  Setup Register for CS 0
#define AT91C_SMC_PULSE0 ((AT91_REG *) 	0x400E0004) // (SMC)  Pulse Register for CS 0
#define AT91C_SMC_PULSE6 ((AT91_REG *) 	0x400E0064) // (SMC)  Pulse Register for CS 6
#define AT91C_SMC_CYCLE6 ((AT91_REG *) 	0x400E0068) // (SMC)  Cycle Register for CS 6
// ========== Register definition for MATRIX peripheral ========== 
#define AT91C_MATRIX_SFR2  ((AT91_REG *) 	0x400E0318) // (MATRIX)  Special Function Register 2
#define AT91C_MATRIX_SFR3  ((AT91_REG *) 	0x400E031C) // (MATRIX)  Special Function Register 3
#define AT91C_MATRIX_SCFG8 ((AT91_REG *) 	0x400E0260) // (MATRIX)  Slave Configuration Register 8
#define AT91C_MATRIX_MCFG2 ((AT91_REG *) 	0x400E0208) // (MATRIX)  Master Configuration Register 2
#define AT91C_MATRIX_MCFG7 ((AT91_REG *) 	0x400E021C) // (MATRIX)  Master Configuration Register 7
#define AT91C_MATRIX_SCFG3 ((AT91_REG *) 	0x400E024C) // (MATRIX)  Slave Configuration Register 3
#define AT91C_MATRIX_SCFG0 ((AT91_REG *) 	0x400E0240) // (MATRIX)  Slave Configuration Register 0
#define AT91C_MATRIX_SFR12 ((AT91_REG *) 	0x400E0340) // (MATRIX)  Special Function Register 12
#define AT91C_MATRIX_SCFG1 ((AT91_REG *) 	0x400E0244) // (MATRIX)  Slave Configuration Register 1
#define AT91C_MATRIX_SFR8  ((AT91_REG *) 	0x400E0330) // (MATRIX)  Special Function Register 8
#define AT91C_MATRIX_VER ((AT91_REG *) 	0x400E03FC) // (MATRIX) HMATRIX2 VERSION REGISTER 
#define AT91C_MATRIX_SFR13 ((AT91_REG *) 	0x400E0344) // (MATRIX)  Special Function Register 13
#define AT91C_MATRIX_SFR5  ((AT91_REG *) 	0x400E0324) // (MATRIX)  Special Function Register 5
#define AT91C_MATRIX_MCFG0 ((AT91_REG *) 	0x400E0200) // (MATRIX)  Master Configuration Register 0 : ARM I and D
#define AT91C_MATRIX_SCFG6 ((AT91_REG *) 	0x400E0258) // (MATRIX)  Slave Configuration Register 6
#define AT91C_MATRIX_SFR14 ((AT91_REG *) 	0x400E0348) // (MATRIX)  Special Function Register 14
#define AT91C_MATRIX_SFR1  ((AT91_REG *) 	0x400E0314) // (MATRIX)  Special Function Register 1
#define AT91C_MATRIX_SFR15 ((AT91_REG *) 	0x400E034C) // (MATRIX)  Special Function Register 15
#define AT91C_MATRIX_SFR6  ((AT91_REG *) 	0x400E0328) // (MATRIX)  Special Function Register 6
#define AT91C_MATRIX_SFR11 ((AT91_REG *) 	0x400E033C) // (MATRIX)  Special Function Register 11
#define AT91C_MATRIX_IPNAME2 ((AT91_REG *) 	0x400E03F4) // (MATRIX) HMATRIX2 IPNAME2 REGISTER 
#define AT91C_MATRIX_ADDRSIZE ((AT91_REG *) 	0x400E03EC) // (MATRIX) HMATRIX2 ADDRSIZE REGISTER 
#define AT91C_MATRIX_MCFG5 ((AT91_REG *) 	0x400E0214) // (MATRIX)  Master Configuration Register 5
#define AT91C_MATRIX_SFR9  ((AT91_REG *) 	0x400E0334) // (MATRIX)  Special Function Register 9
#define AT91C_MATRIX_MCFG3 ((AT91_REG *) 	0x400E020C) // (MATRIX)  Master Configuration Register 3
#define AT91C_MATRIX_SCFG4 ((AT91_REG *) 	0x400E0250) // (MATRIX)  Slave Configuration Register 4
#define AT91C_MATRIX_MCFG1 ((AT91_REG *) 	0x400E0204) // (MATRIX)  Master Configuration Register 1 : ARM S
#define AT91C_MATRIX_SCFG7 ((AT91_REG *) 	0x400E025C) // (MATRIX)  Slave Configuration Register 5
#define AT91C_MATRIX_SFR10 ((AT91_REG *) 	0x400E0338) // (MATRIX)  Special Function Register 10
#define AT91C_MATRIX_SCFG2 ((AT91_REG *) 	0x400E0248) // (MATRIX)  Slave Configuration Register 2
#define AT91C_MATRIX_SFR7  ((AT91_REG *) 	0x400E032C) // (MATRIX)  Special Function Register 7
#define AT91C_MATRIX_IPNAME1 ((AT91_REG *) 	0x400E03F0) // (MATRIX) HMATRIX2 IPNAME1 REGISTER 
#define AT91C_MATRIX_MCFG4 ((AT91_REG *) 	0x400E0210) // (MATRIX)  Master Configuration Register 4
#define AT91C_MATRIX_SFR0  ((AT91_REG *) 	0x400E0310) // (MATRIX)  Special Function Register 0
#define AT91C_MATRIX_FEATURES ((AT91_REG *) 	0x400E03F8) // (MATRIX) HMATRIX2 FEATURES REGISTER 
#define AT91C_MATRIX_SCFG5 ((AT91_REG *) 	0x400E0254) // (MATRIX)  Slave Configuration Register 5
#define AT91C_MATRIX_MCFG6 ((AT91_REG *) 	0x400E0218) // (MATRIX)  Master Configuration Register 6
#define AT91C_MATRIX_SCFG9 ((AT91_REG *) 	0x400E0264) // (MATRIX)  Slave Configuration Register 9
#define AT91C_MATRIX_SFR4  ((AT91_REG *) 	0x400E0320) // (MATRIX)  Special Function Register 4
// ========== Register definition for CCFG peripheral ========== 
#define AT91C_CCFG_FLASH0 ((AT91_REG *) 	0x400E0318) // (CCFG)  FLASH0 configuration
#define AT91C_CCFG_RAM0 ((AT91_REG *) 	0x400E0310) // (CCFG)  RAM0 configuration
#define AT91C_CCFG_ROM  ((AT91_REG *) 	0x400E0314) // (CCFG)  ROM  configuration
#define AT91C_CCFG_EBICSA ((AT91_REG *) 	0x400E031C) // (CCFG)  EBI Chip Select Assignement Register
#define AT91C_CCFG_BRIDGE ((AT91_REG *) 	0x400E0320) // (CCFG)  BRIDGE configuration
// ========== Register definition for NVIC peripheral ========== 
#define AT91C_NVIC_MMAR ((AT91_REG *) 	0xE000ED34) // (NVIC) Mem Manage Address Register
#define AT91C_NVIC_STIR ((AT91_REG *) 	0xE000EF00) // (NVIC) Software Trigger Interrupt Register
#define AT91C_NVIC_MMFR2 ((AT91_REG *) 	0xE000ED58) // (NVIC) Memory Model Feature register2
#define AT91C_NVIC_CPUID ((AT91_REG *) 	0xE000ED00) // (NVIC) CPUID Base Register
#define AT91C_NVIC_DFSR ((AT91_REG *) 	0xE000ED30) // (NVIC) Debug Fault Status Register
#define AT91C_NVIC_HAND4PR ((AT91_REG *) 	0xE000ED18) // (NVIC) System Handlers 4-7 Priority Register
#define AT91C_NVIC_HFSR ((AT91_REG *) 	0xE000ED2C) // (NVIC) Hard Fault Status Register
#define AT91C_NVIC_PID6 ((AT91_REG *) 	0xE000EFD8) // (NVIC) Peripheral identification register
#define AT91C_NVIC_PFR0 ((AT91_REG *) 	0xE000ED40) // (NVIC) Processor Feature register0
#define AT91C_NVIC_VTOFFR ((AT91_REG *) 	0xE000ED08) // (NVIC) Vector Table Offset Register
#define AT91C_NVIC_ISPR ((AT91_REG *) 	0xE000E200) // (NVIC) Set Pending Register
#define AT91C_NVIC_PID0 ((AT91_REG *) 	0xE000EFE0) // (NVIC) Peripheral identification register b7:0
#define AT91C_NVIC_PID7 ((AT91_REG *) 	0xE000EFDC) // (NVIC) Peripheral identification register
#define AT91C_NVIC_STICKRVR ((AT91_REG *) 	0xE000E014) // (NVIC) SysTick Reload Value Register
#define AT91C_NVIC_PID2 ((AT91_REG *) 	0xE000EFE8) // (NVIC) Peripheral identification register b23:16
#define AT91C_NVIC_ISAR0 ((AT91_REG *) 	0xE000ED60) // (NVIC) ISA Feature register0
#define AT91C_NVIC_SCR  ((AT91_REG *) 	0xE000ED10) // (NVIC) System Control Register
#define AT91C_NVIC_PID4 ((AT91_REG *) 	0xE000EFD0) // (NVIC) Peripheral identification register
#define AT91C_NVIC_ISAR2 ((AT91_REG *) 	0xE000ED68) // (NVIC) ISA Feature register2
#define AT91C_NVIC_ISER ((AT91_REG *) 	0xE000E100) // (NVIC) Set Enable Register
#define AT91C_NVIC_IPR  ((AT91_REG *) 	0xE000E400) // (NVIC) Interrupt Mask Register
#define AT91C_NVIC_AIRCR ((AT91_REG *) 	0xE000ED0C) // (NVIC) Application Interrupt/Reset Control Reg
#define AT91C_NVIC_CID2 ((AT91_REG *) 	0xE000EFF8) // (NVIC) Component identification register b23:16
#define AT91C_NVIC_ICPR ((AT91_REG *) 	0xE000E280) // (NVIC) Clear Pending Register
#define AT91C_NVIC_CID3 ((AT91_REG *) 	0xE000EFFC) // (NVIC) Component identification register b31:24
#define AT91C_NVIC_CFSR ((AT91_REG *) 	0xE000ED28) // (NVIC) Configurable Fault Status Register
#define AT91C_NVIC_AFR0 ((AT91_REG *) 	0xE000ED4C) // (NVIC) Auxiliary Feature register0
#define AT91C_NVIC_ICSR ((AT91_REG *) 	0xE000ED04) // (NVIC) Interrupt Control State Register
#define AT91C_NVIC_CCR  ((AT91_REG *) 	0xE000ED14) // (NVIC) Configuration Control Register
#define AT91C_NVIC_CID0 ((AT91_REG *) 	0xE000EFF0) // (NVIC) Component identification register b7:0
#define AT91C_NVIC_ISAR1 ((AT91_REG *) 	0xE000ED64) // (NVIC) ISA Feature register1
#define AT91C_NVIC_STICKCVR ((AT91_REG *) 	0xE000E018) // (NVIC) SysTick Current Value Register
#define AT91C_NVIC_STICKCSR ((AT91_REG *) 	0xE000E010) // (NVIC) SysTick Control and Status Register
#define AT91C_NVIC_CID1 ((AT91_REG *) 	0xE000EFF4) // (NVIC) Component identification register b15:8
#define AT91C_NVIC_DFR0 ((AT91_REG *) 	0xE000ED48) // (NVIC) Debug Feature register0
#define AT91C_NVIC_MMFR3 ((AT91_REG *) 	0xE000ED5C) // (NVIC) Memory Model Feature register3
#define AT91C_NVIC_MMFR0 ((AT91_REG *) 	0xE000ED50) // (NVIC) Memory Model Feature register0
#define AT91C_NVIC_STICKCALVR ((AT91_REG *) 	0xE000E01C) // (NVIC) SysTick Calibration Value Register
#define AT91C_NVIC_PID1 ((AT91_REG *) 	0xE000EFE4) // (NVIC) Peripheral identification register b15:8
#define AT91C_NVIC_HAND12PR ((AT91_REG *) 	0xE000ED20) // (NVIC) System Handlers 12-15 Priority Register
#define AT91C_NVIC_MMFR1 ((AT91_REG *) 	0xE000ED54) // (NVIC) Memory Model Feature register1
#define AT91C_NVIC_AFSR ((AT91_REG *) 	0xE000ED3C) // (NVIC) Auxiliary Fault Status Register
#define AT91C_NVIC_HANDCSR ((AT91_REG *) 	0xE000ED24) // (NVIC) System Handler Control and State Register
#define AT91C_NVIC_ISAR4 ((AT91_REG *) 	0xE000ED70) // (NVIC) ISA Feature register4
#define AT91C_NVIC_ABR  ((AT91_REG *) 	0xE000E300) // (NVIC) Active Bit Register
#define AT91C_NVIC_PFR1 ((AT91_REG *) 	0xE000ED44) // (NVIC) Processor Feature register1
#define AT91C_NVIC_PID5 ((AT91_REG *) 	0xE000EFD4) // (NVIC) Peripheral identification register
#define AT91C_NVIC_ICTR ((AT91_REG *) 	0xE000E004) // (NVIC) Interrupt Control Type Register
#define AT91C_NVIC_ICER ((AT91_REG *) 	0xE000E180) // (NVIC) Clear enable Register
#define AT91C_NVIC_PID3 ((AT91_REG *) 	0xE000EFEC) // (NVIC) Peripheral identification register b31:24
#define AT91C_NVIC_ISAR3 ((AT91_REG *) 	0xE000ED6C) // (NVIC) ISA Feature register3
#define AT91C_NVIC_HAND8PR ((AT91_REG *) 	0xE000ED1C) // (NVIC) System Handlers 8-11 Priority Register
#define AT91C_NVIC_BFAR ((AT91_REG *) 	0xE000ED38) // (NVIC) Bus Fault Address Register
// ========== Register definition for MPU peripheral ========== 
#define AT91C_MPU_REG_BASE_ADDR3 ((AT91_REG *) 	0xE000EDB4) // (MPU) MPU Region Base Address Register alias 3
#define AT91C_MPU_REG_NB ((AT91_REG *) 	0xE000ED98) // (MPU) MPU Region Number Register
#define AT91C_MPU_ATTR_SIZE1 ((AT91_REG *) 	0xE000EDA8) // (MPU) MPU  Attribute and Size Register alias 1
#define AT91C_MPU_REG_BASE_ADDR1 ((AT91_REG *) 	0xE000EDA4) // (MPU) MPU Region Base Address Register alias 1
#define AT91C_MPU_ATTR_SIZE3 ((AT91_REG *) 	0xE000EDB8) // (MPU) MPU  Attribute and Size Register alias 3
#define AT91C_MPU_CTRL  ((AT91_REG *) 	0xE000ED94) // (MPU) MPU Control Register
#define AT91C_MPU_ATTR_SIZE2 ((AT91_REG *) 	0xE000EDB0) // (MPU) MPU  Attribute and Size Register alias 2
#define AT91C_MPU_REG_BASE_ADDR ((AT91_REG *) 	0xE000ED9C) // (MPU) MPU Region Base Address Register
#define AT91C_MPU_REG_BASE_ADDR2 ((AT91_REG *) 	0xE000EDAC) // (MPU) MPU Region Base Address Register alias 2
#define AT91C_MPU_ATTR_SIZE ((AT91_REG *) 	0xE000EDA0) // (MPU) MPU  Attribute and Size Register
#define AT91C_MPU_TYPE  ((AT91_REG *) 	0xE000ED90) // (MPU) MPU Type Register
// ========== Register definition for CM3 peripheral ========== 
#define AT91C_CM3_SHCSR ((AT91_REG *) 	0xE000ED24) // (CM3) System Handler Control and State Register
#define AT91C_CM3_CCR   ((AT91_REG *) 	0xE000ED14) // (CM3) Configuration Control Register
#define AT91C_CM3_ICSR  ((AT91_REG *) 	0xE000ED04) // (CM3) Interrupt Control State Register
#define AT91C_CM3_CPUID ((AT91_REG *) 	0xE000ED00) // (CM3) CPU ID Base Register
#define AT91C_CM3_SCR   ((AT91_REG *) 	0xE000ED10) // (CM3) System Controller Register
#define AT91C_CM3_AIRCR ((AT91_REG *) 	0xE000ED0C) // (CM3) Application Interrupt and Reset Control Register
#define AT91C_CM3_SHPR  ((AT91_REG *) 	0xE000ED18) // (CM3) System Handler Priority Register
#define AT91C_CM3_VTOR  ((AT91_REG *) 	0xE000ED08) // (CM3) Vector Table Offset Register
// ========== Register definition for PDC_DBGU0 peripheral ========== 
#define AT91C_DBGU0_TPR ((AT91_REG *) 	0x400E0708) // (PDC_DBGU0) Transmit Pointer Register
#define AT91C_DBGU0_PTCR ((AT91_REG *) 	0x400E0720) // (PDC_DBGU0) PDC Transfer Control Register
#define AT91C_DBGU0_TNCR ((AT91_REG *) 	0x400E071C) // (PDC_DBGU0) Transmit Next Counter Register
#define AT91C_DBGU0_PTSR ((AT91_REG *) 	0x400E0724) // (PDC_DBGU0) PDC Transfer Status Register
#define AT91C_DBGU0_RNCR ((AT91_REG *) 	0x400E0714) // (PDC_DBGU0) Receive Next Counter Register
#define AT91C_DBGU0_RPR ((AT91_REG *) 	0x400E0700) // (PDC_DBGU0) Receive Pointer Register
#define AT91C_DBGU0_TCR ((AT91_REG *) 	0x400E070C) // (PDC_DBGU0) Transmit Counter Register
#define AT91C_DBGU0_RNPR ((AT91_REG *) 	0x400E0710) // (PDC_DBGU0) Receive Next Pointer Register
#define AT91C_DBGU0_TNPR ((AT91_REG *) 	0x400E0718) // (PDC_DBGU0) Transmit Next Pointer Register
#define AT91C_DBGU0_RCR ((AT91_REG *) 	0x400E0704) // (PDC_DBGU0) Receive Counter Register
// ========== Register definition for DBGU0 peripheral ========== 
#define AT91C_DBGU0_CR  ((AT91_REG *) 	0x400E0600) // (DBGU0) Control Register
#define AT91C_DBGU0_IDR ((AT91_REG *) 	0x400E060C) // (DBGU0) Interrupt Disable Register
#define AT91C_DBGU0_CIDR ((AT91_REG *) 	0x400E0740) // (DBGU0) Chip ID Register
#define AT91C_DBGU0_IPNAME2 ((AT91_REG *) 	0x400E06F4) // (DBGU0) DBGU IPNAME2 REGISTER 
#define AT91C_DBGU0_FEATURES ((AT91_REG *) 	0x400E06F8) // (DBGU0) DBGU FEATURES REGISTER 
#define AT91C_DBGU0_FNTR ((AT91_REG *) 	0x400E0648) // (DBGU0) Force NTRST Register
#define AT91C_DBGU0_RHR ((AT91_REG *) 	0x400E0618) // (DBGU0) Receiver Holding Register
#define AT91C_DBGU0_THR ((AT91_REG *) 	0x400E061C) // (DBGU0) Transmitter Holding Register
#define AT91C_DBGU0_ADDRSIZE ((AT91_REG *) 	0x400E06EC) // (DBGU0) DBGU ADDRSIZE REGISTER 
#define AT91C_DBGU0_MR  ((AT91_REG *) 	0x400E0604) // (DBGU0) Mode Register
#define AT91C_DBGU0_IER ((AT91_REG *) 	0x400E0608) // (DBGU0) Interrupt Enable Register
#define AT91C_DBGU0_BRGR ((AT91_REG *) 	0x400E0620) // (DBGU0) Baud Rate Generator Register
#define AT91C_DBGU0_CSR ((AT91_REG *) 	0x400E0614) // (DBGU0) Channel Status Register
#define AT91C_DBGU0_VER ((AT91_REG *) 	0x400E06FC) // (DBGU0) DBGU VERSION REGISTER 
#define AT91C_DBGU0_IMR ((AT91_REG *) 	0x400E0610) // (DBGU0) Interrupt Mask Register
#define AT91C_DBGU0_IPNAME1 ((AT91_REG *) 	0x400E06F0) // (DBGU0) DBGU IPNAME1 REGISTER 
#define AT91C_DBGU0_EXID ((AT91_REG *) 	0x400E0744) // (DBGU0) Chip ID Extension Register
// ========== Register definition for PDC_DBGU1 peripheral ========== 
#define AT91C_DBGU1_RNCR ((AT91_REG *) 	0x400E0914) // (PDC_DBGU1) Receive Next Counter Register
#define AT91C_DBGU1_RPR ((AT91_REG *) 	0x400E0900) // (PDC_DBGU1) Receive Pointer Register
#define AT91C_DBGU1_TNCR ((AT91_REG *) 	0x400E091C) // (PDC_DBGU1) Transmit Next Counter Register
#define AT91C_DBGU1_TNPR ((AT91_REG *) 	0x400E0918) // (PDC_DBGU1) Transmit Next Pointer Register
#define AT91C_DBGU1_PTSR ((AT91_REG *) 	0x400E0924) // (PDC_DBGU1) PDC Transfer Status Register
#define AT91C_DBGU1_PTCR ((AT91_REG *) 	0x400E0920) // (PDC_DBGU1) PDC Transfer Control Register
#define AT91C_DBGU1_RCR ((AT91_REG *) 	0x400E0904) // (PDC_DBGU1) Receive Counter Register
#define AT91C_DBGU1_RNPR ((AT91_REG *) 	0x400E0910) // (PDC_DBGU1) Receive Next Pointer Register
#define AT91C_DBGU1_TPR ((AT91_REG *) 	0x400E0908) // (PDC_DBGU1) Transmit Pointer Register
#define AT91C_DBGU1_TCR ((AT91_REG *) 	0x400E090C) // (PDC_DBGU1) Transmit Counter Register
// ========== Register definition for DBGU1 peripheral ========== 
#define AT91C_DBGU1_RHR ((AT91_REG *) 	0x400E0818) // (DBGU1) Receiver Holding Register
#define AT91C_DBGU1_IPNAME1 ((AT91_REG *) 	0x400E08F0) // (DBGU1) DBGU IPNAME1 REGISTER 
#define AT91C_DBGU1_CIDR ((AT91_REG *) 	0x400E0940) // (DBGU1) Chip ID Register
#define AT91C_DBGU1_CR  ((AT91_REG *) 	0x400E0800) // (DBGU1) Control Register
#define AT91C_DBGU1_VER ((AT91_REG *) 	0x400E08FC) // (DBGU1) DBGU VERSION REGISTER 
#define AT91C_DBGU1_IPNAME2 ((AT91_REG *) 	0x400E08F4) // (DBGU1) DBGU IPNAME2 REGISTER 
#define AT91C_DBGU1_BRGR ((AT91_REG *) 	0x400E0820) // (DBGU1) Baud Rate Generator Register
#define AT91C_DBGU1_FNTR ((AT91_REG *) 	0x400E0848) // (DBGU1) Force NTRST Register
#define AT91C_DBGU1_MR  ((AT91_REG *) 	0x400E0804) // (DBGU1) Mode Register
#define AT91C_DBGU1_ADDRSIZE ((AT91_REG *) 	0x400E08EC) // (DBGU1) DBGU ADDRSIZE REGISTER 
#define AT91C_DBGU1_CSR ((AT91_REG *) 	0x400E0814) // (DBGU1) Channel Status Register
#define AT91C_DBGU1_IMR ((AT91_REG *) 	0x400E0810) // (DBGU1) Interrupt Mask Register
#define AT91C_DBGU1_EXID ((AT91_REG *) 	0x400E0944) // (DBGU1) Chip ID Extension Register
#define AT91C_DBGU1_IDR ((AT91_REG *) 	0x400E080C) // (DBGU1) Interrupt Disable Register
#define AT91C_DBGU1_FEATURES ((AT91_REG *) 	0x400E08F8) // (DBGU1) DBGU FEATURES REGISTER 
#define AT91C_DBGU1_IER ((AT91_REG *) 	0x400E0808) // (DBGU1) Interrupt Enable Register
#define AT91C_DBGU1_THR ((AT91_REG *) 	0x400E081C) // (DBGU1) Transmitter Holding Register
// ========== Register definition for PIOA peripheral ========== 
#define AT91C_PIOA_SENIDR ((AT91_REG *) 	0x400E0F58) // (PIOA) Sensor Interrupt Disable Register
#define AT91C_PIOA_OWSR ((AT91_REG *) 	0x400E0EA8) // (PIOA) Output Write Status Register
#define AT91C_PIOA_PSR  ((AT91_REG *) 	0x400E0E08) // (PIOA) PIO Status Register
#define AT91C_PIOA_MDER ((AT91_REG *) 	0x400E0E50) // (PIOA) Multi-driver Enable Register
#define AT91C_PIOA_IPNAME1 ((AT91_REG *) 	0x400E0EF0) // (PIOA) PIO IPNAME1 REGISTER 
#define AT91C_PIOA_FEATURES ((AT91_REG *) 	0x400E0EF8) // (PIOA) PIO FEATURES REGISTER 
#define AT91C_PIOA_SP2  ((AT91_REG *) 	0x400E0E74) // (PIOA) Select B Register
#define AT91C_PIOA_ODR  ((AT91_REG *) 	0x400E0E14) // (PIOA) Output Disable Registerr
#define AT91C_PIOA_IDR  ((AT91_REG *) 	0x400E0E44) // (PIOA) Interrupt Disable Register
#define AT91C_PIOA_PDR  ((AT91_REG *) 	0x400E0E04) // (PIOA) PIO Disable Register
#define AT91C_PIOA_PDSR ((AT91_REG *) 	0x400E0E3C) // (PIOA) Pin Data Status Register
#define AT91C_PIOA_PPDER ((AT91_REG *) 	0x400E0E94) // (PIOA) Pull-down Enable Register
#define AT91C_PIOA_SENIER ((AT91_REG *) 	0x400E0F54) // (PIOA) Sensor Interrupt Enable Register
#define AT91C_PIOA_SLEW2 ((AT91_REG *) 	0x400E0F04) // (PIOA) PIO SLEWRATE2 REGISTER 
#define AT91C_PIOA_SENMR ((AT91_REG *) 	0x400E0F50) // (PIOA) Sensor Mode Register
#define AT91C_PIOA_PPUDR ((AT91_REG *) 	0x400E0E60) // (PIOA) Pull-up Disable Register
#define AT91C_PIOA_OWDR ((AT91_REG *) 	0x400E0EA4) // (PIOA) Output Write Disable Register
#define AT91C_PIOA_ADDRSIZE ((AT91_REG *) 	0x400E0EEC) // (PIOA) PIO ADDRSIZE REGISTER 
#define AT91C_PIOA_IFER ((AT91_REG *) 	0x400E0E20) // (PIOA) Input Filter Enable Register
#define AT91C_PIOA_PPDSR ((AT91_REG *) 	0x400E0E98) // (PIOA) Pull-down Status Register
#define AT91C_PIOA_SP1  ((AT91_REG *) 	0x400E0E70) // (PIOA) Select B Register
#define AT91C_PIOA_SENIMR ((AT91_REG *) 	0x400E0F5C) // (PIOA) Sensor Interrupt Mask Register
#define AT91C_PIOA_SENDATA ((AT91_REG *) 	0x400E0F64) // (PIOA) Sensor Data Register
#define AT91C_PIOA_VER  ((AT91_REG *) 	0x400E0EFC) // (PIOA) PIO VERSION REGISTER 
#define AT91C_PIOA_PER  ((AT91_REG *) 	0x400E0E00) // (PIOA) PIO Enable Register
#define AT91C_PIOA_IMR  ((AT91_REG *) 	0x400E0E48) // (PIOA) Interrupt Mask Register
#define AT91C_PIOA_PPUSR ((AT91_REG *) 	0x400E0E68) // (PIOA) Pull-up Status Register
#define AT91C_PIOA_ODSR ((AT91_REG *) 	0x400E0E38) // (PIOA) Output Data Status Register
#define AT91C_PIOA_SENISR ((AT91_REG *) 	0x400E0F60) // (PIOA) Sensor Interrupt Status Register
#define AT91C_PIOA_IFDR ((AT91_REG *) 	0x400E0E24) // (PIOA) Input Filter Disable Register
#define AT91C_PIOA_SODR ((AT91_REG *) 	0x400E0E30) // (PIOA) Set Output Data Register
#define AT91C_PIOA_SLEW1 ((AT91_REG *) 	0x400E0F00) // (PIOA) PIO SLEWRATE1 REGISTER 
#define AT91C_PIOA_IER  ((AT91_REG *) 	0x400E0E40) // (PIOA) Interrupt Enable Register
