una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s4.h
#define AT91C_PIOA_MDSR ((AT91_REG *) 	0x400E0E58) // (PIOA) Multi-driver Status Register
#define AT91C_PIOA_ISR  ((AT91_REG *) 	0x400E0E4C) // (PIOA) Interrupt Status Register
#define AT91C_PIOA_IFSR ((AT91_REG *) 	0x400E0E28) // (PIOA) Input Filter Status Register
#define AT91C_PIOA_PPDDR ((AT91_REG *) 	0x400E0E90) // (PIOA) Pull-down Disable Register
#define AT91C_PIOA_PPUER ((AT91_REG *) 	0x400E0E64) // (PIOA) Pull-up Enable Register
#define AT91C_PIOA_OWER ((AT91_REG *) 	0x400E0EA0) // (PIOA) Output Write Enable Register
#define AT91C_PIOA_IPNAME2 ((AT91_REG *) 	0x400E0EF4) // (PIOA) PIO IPNAME2 REGISTER 
#define AT91C_PIOA_MDDR ((AT91_REG *) 	0x400E0E54) // (PIOA) Multi-driver Disable Register
#define AT91C_PIOA_CODR ((AT91_REG *) 	0x400E0E34) // (PIOA) Clear Output Data Register
#define AT91C_PIOA_OER  ((AT91_REG *) 	0x400E0E10) // (PIOA) Output Enable Register
#define AT91C_PIOA_OSR  ((AT91_REG *) 	0x400E0E18) // (PIOA) Output Status Register
#define AT91C_PIOA_ABSR ((AT91_REG *) 	0x400E0E78) // (PIOA) AB Select Status Register
// ========== Register definition for PDC_PIOA peripheral ========== 
#define AT91C_PIOA_RPR  ((AT91_REG *) 	0x400E0F68) // (PDC_PIOA) Receive Pointer Register
#define AT91C_PIOA_TPR  ((AT91_REG *) 	0x400E0F70) // (PDC_PIOA) Transmit Pointer Register
#define AT91C_PIOA_RCR  ((AT91_REG *) 	0x400E0F6C) // (PDC_PIOA) Receive Counter Register
#define AT91C_PIOA_PTSR ((AT91_REG *) 	0x400E0F8C) // (PDC_PIOA) PDC Transfer Status Register
#define AT91C_PIOA_TCR  ((AT91_REG *) 	0x400E0F74) // (PDC_PIOA) Transmit Counter Register
#define AT91C_PIOA_PTCR ((AT91_REG *) 	0x400E0F88) // (PDC_PIOA) PDC Transfer Control Register
#define AT91C_PIOA_RNPR ((AT91_REG *) 	0x400E0F78) // (PDC_PIOA) Receive Next Pointer Register
#define AT91C_PIOA_TNCR ((AT91_REG *) 	0x400E0F84) // (PDC_PIOA) Transmit Next Counter Register
#define AT91C_PIOA_RNCR ((AT91_REG *) 	0x400E0F7C) // (PDC_PIOA) Receive Next Counter Register
#define AT91C_PIOA_TNPR ((AT91_REG *) 	0x400E0F80) // (PDC_PIOA) Transmit Next Pointer Register
// ========== Register definition for PIOB peripheral ========== 
#define AT91C_PIOB_MDDR ((AT91_REG *) 	0x400E1054) // (PIOB) Multi-driver Disable Register
#define AT91C_PIOB_ABSR ((AT91_REG *) 	0x400E1078) // (PIOB) AB Select Status Register
#define AT91C_PIOB_SP1  ((AT91_REG *) 	0x400E1070) // (PIOB) Select B Register
#define AT91C_PIOB_ODSR ((AT91_REG *) 	0x400E1038) // (PIOB) Output Data Status Register
#define AT91C_PIOB_SLEW1 ((AT91_REG *) 	0x400E1100) // (PIOB) PIO SLEWRATE1 REGISTER 
#define AT91C_PIOB_SENISR ((AT91_REG *) 	0x400E1160) // (PIOB) Sensor Interrupt Status Register
#define AT91C_PIOB_OSR  ((AT91_REG *) 	0x400E1018) // (PIOB) Output Status Register
#define AT91C_PIOB_IFER ((AT91_REG *) 	0x400E1020) // (PIOB) Input Filter Enable Register
#define AT91C_PIOB_SENDATA ((AT91_REG *) 	0x400E1164) // (PIOB) Sensor Data Register
#define AT91C_PIOB_MDSR ((AT91_REG *) 	0x400E1058) // (PIOB) Multi-driver Status Register
#define AT91C_PIOB_IFDR ((AT91_REG *) 	0x400E1024) // (PIOB) Input Filter Disable Register
#define AT91C_PIOB_MDER ((AT91_REG *) 	0x400E1050) // (PIOB) Multi-driver Enable Register
#define AT91C_PIOB_SENIDR ((AT91_REG *) 	0x400E1158) // (PIOB) Sensor Interrupt Disable Register
#define AT91C_PIOB_IER  ((AT91_REG *) 	0x400E1040) // (PIOB) Interrupt Enable Register
#define AT91C_PIOB_OWDR ((AT91_REG *) 	0x400E10A4) // (PIOB) Output Write Disable Register
#define AT91C_PIOB_IFSR ((AT91_REG *) 	0x400E1028) // (PIOB) Input Filter Status Register
#define AT91C_PIOB_ISR  ((AT91_REG *) 	0x400E104C) // (PIOB) Interrupt Status Register
#define AT91C_PIOB_PPUDR ((AT91_REG *) 	0x400E1060) // (PIOB) Pull-up Disable Register
#define AT91C_PIOB_PDSR ((AT91_REG *) 	0x400E103C) // (PIOB) Pin Data Status Register
#define AT91C_PIOB_IPNAME2 ((AT91_REG *) 	0x400E10F4) // (PIOB) PIO IPNAME2 REGISTER 
#define AT91C_PIOB_PPUER ((AT91_REG *) 	0x400E1064) // (PIOB) Pull-up Enable Register
#define AT91C_PIOB_SLEW2 ((AT91_REG *) 	0x400E1104) // (PIOB) PIO SLEWRATE2 REGISTER 
#define AT91C_PIOB_OER  ((AT91_REG *) 	0x400E1010) // (PIOB) Output Enable Register
#define AT91C_PIOB_CODR ((AT91_REG *) 	0x400E1034) // (PIOB) Clear Output Data Register
#define AT91C_PIOB_PPDDR ((AT91_REG *) 	0x400E1090) // (PIOB) Pull-down Disable Register
#define AT91C_PIOB_OWER ((AT91_REG *) 	0x400E10A0) // (PIOB) Output Write Enable Register
#define AT91C_PIOB_VER  ((AT91_REG *) 	0x400E10FC) // (PIOB) PIO VERSION REGISTER 
#define AT91C_PIOB_PPDER ((AT91_REG *) 	0x400E1094) // (PIOB) Pull-down Enable Register
#define AT91C_PIOB_IMR  ((AT91_REG *) 	0x400E1048) // (PIOB) Interrupt Mask Register
#define AT91C_PIOB_PPUSR ((AT91_REG *) 	0x400E1068) // (PIOB) Pull-up Status Register
#define AT91C_PIOB_IPNAME1 ((AT91_REG *) 	0x400E10F0) // (PIOB) PIO IPNAME1 REGISTER 
#define AT91C_PIOB_ADDRSIZE ((AT91_REG *) 	0x400E10EC) // (PIOB) PIO ADDRSIZE REGISTER 
#define AT91C_PIOB_SP2  ((AT91_REG *) 	0x400E1074) // (PIOB) Select B Register
#define AT91C_PIOB_IDR  ((AT91_REG *) 	0x400E1044) // (PIOB) Interrupt Disable Register
#define AT91C_PIOB_SENMR ((AT91_REG *) 	0x400E1150) // (PIOB) Sensor Mode Register
#define AT91C_PIOB_SODR ((AT91_REG *) 	0x400E1030) // (PIOB) Set Output Data Register
#define AT91C_PIOB_PPDSR ((AT91_REG *) 	0x400E1098) // (PIOB) Pull-down Status Register
#define AT91C_PIOB_PSR  ((AT91_REG *) 	0x400E1008) // (PIOB) PIO Status Register
#define AT91C_PIOB_ODR  ((AT91_REG *) 	0x400E1014) // (PIOB) Output Disable Registerr
#define AT91C_PIOB_OWSR ((AT91_REG *) 	0x400E10A8) // (PIOB) Output Write Status Register
#define AT91C_PIOB_FEATURES ((AT91_REG *) 	0x400E10F8) // (PIOB) PIO FEATURES REGISTER 
#define AT91C_PIOB_PDR  ((AT91_REG *) 	0x400E1004) // (PIOB) PIO Disable Register
#define AT91C_PIOB_SENIMR ((AT91_REG *) 	0x400E115C) // (PIOB) Sensor Interrupt Mask Register
#define AT91C_PIOB_SENIER ((AT91_REG *) 	0x400E1154) // (PIOB) Sensor Interrupt Enable Register
#define AT91C_PIOB_PER  ((AT91_REG *) 	0x400E1000) // (PIOB) PIO Enable Register
// ========== Register definition for PIOC peripheral ========== 
#define AT91C_PIOC_VER  ((AT91_REG *) 	0x400E12FC) // (PIOC) PIO VERSION REGISTER 
#define AT91C_PIOC_IMR  ((AT91_REG *) 	0x400E1248) // (PIOC) Interrupt Mask Register
#define AT91C_PIOC_PSR  ((AT91_REG *) 	0x400E1208) // (PIOC) PIO Status Register
#define AT91C_PIOC_PPDSR ((AT91_REG *) 	0x400E1298) // (PIOC) Pull-down Status Register
#define AT91C_PIOC_OER  ((AT91_REG *) 	0x400E1210) // (PIOC) Output Enable Register
#define AT91C_PIOC_OSR  ((AT91_REG *) 	0x400E1218) // (PIOC) Output Status Register
#define AT91C_PIOC_MDDR ((AT91_REG *) 	0x400E1254) // (PIOC) Multi-driver Disable Register
#define AT91C_PIOC_PPUSR ((AT91_REG *) 	0x400E1268) // (PIOC) Pull-up Status Register
#define AT91C_PIOC_ODSR ((AT91_REG *) 	0x400E1238) // (PIOC) Output Data Status Register
#define AT91C_PIOC_SLEW2 ((AT91_REG *) 	0x400E1304) // (PIOC) PIO SLEWRATE2 REGISTER 
#define AT91C_PIOC_SENMR ((AT91_REG *) 	0x400E1350) // (PIOC) Sensor Mode Register
#define AT91C_PIOC_IFER ((AT91_REG *) 	0x400E1220) // (PIOC) Input Filter Enable Register
#define AT91C_PIOC_PDR  ((AT91_REG *) 	0x400E1204) // (PIOC) PIO Disable Register
#define AT91C_PIOC_MDER ((AT91_REG *) 	0x400E1250) // (PIOC) Multi-driver Enable Register
#define AT91C_PIOC_SP2  ((AT91_REG *) 	0x400E1274) // (PIOC) Select B Register
#define AT91C_PIOC_IPNAME1 ((AT91_REG *) 	0x400E12F0) // (PIOC) PIO IPNAME1 REGISTER 
#define AT91C_PIOC_IER  ((AT91_REG *) 	0x400E1240) // (PIOC) Interrupt Enable Register
#define AT91C_PIOC_OWDR ((AT91_REG *) 	0x400E12A4) // (PIOC) Output Write Disable Register
#define AT91C_PIOC_IDR  ((AT91_REG *) 	0x400E1244) // (PIOC) Interrupt Disable Register
#define AT91C_PIOC_PDSR ((AT91_REG *) 	0x400E123C) // (PIOC) Pin Data Status Register
#define AT91C_PIOC_SENIDR ((AT91_REG *) 	0x400E1358) // (PIOC) Sensor Interrupt Disable Register
#define AT91C_PIOC_SENISR ((AT91_REG *) 	0x400E1360) // (PIOC) Sensor Interrupt Status Register
#define AT91C_PIOC_PER  ((AT91_REG *) 	0x400E1200) // (PIOC) PIO Enable Register
#define AT91C_PIOC_SENDATA ((AT91_REG *) 	0x400E1364) // (PIOC) Sensor Data Register
#define AT91C_PIOC_IPNAME2 ((AT91_REG *) 	0x400E12F4) // (PIOC) PIO IPNAME2 REGISTER 
#define AT91C_PIOC_PPDDR ((AT91_REG *) 	0x400E1290) // (PIOC) Pull-down Disable Register
#define AT91C_PIOC_ADDRSIZE ((AT91_REG *) 	0x400E12EC) // (PIOC) PIO ADDRSIZE REGISTER 
#define AT91C_PIOC_IFDR ((AT91_REG *) 	0x400E1224) // (PIOC) Input Filter Disable Register
#define AT91C_PIOC_ODR  ((AT91_REG *) 	0x400E1214) // (PIOC) Output Disable Registerr
#define AT91C_PIOC_CODR ((AT91_REG *) 	0x400E1234) // (PIOC) Clear Output Data Register
#define AT91C_PIOC_MDSR ((AT91_REG *) 	0x400E1258) // (PIOC) Multi-driver Status Register
#define AT91C_PIOC_FEATURES ((AT91_REG *) 	0x400E12F8) // (PIOC) PIO FEATURES REGISTER 
#define AT91C_PIOC_IFSR ((AT91_REG *) 	0x400E1228) // (PIOC) Input Filter Status Register
#define AT91C_PIOC_PPUER ((AT91_REG *) 	0x400E1264) // (PIOC) Pull-up Enable Register
#define AT91C_PIOC_PPDER ((AT91_REG *) 	0x400E1294) // (PIOC) Pull-down Enable Register
#define AT91C_PIOC_OWSR ((AT91_REG *) 	0x400E12A8) // (PIOC) Output Write Status Register
#define AT91C_PIOC_ISR  ((AT91_REG *) 	0x400E124C) // (PIOC) Interrupt Status Register
#define AT91C_PIOC_OWER ((AT91_REG *) 	0x400E12A0) // (PIOC) Output Write Enable Register
#define AT91C_PIOC_PPUDR ((AT91_REG *) 	0x400E1260) // (PIOC) Pull-up Disable Register
#define AT91C_PIOC_SENIMR ((AT91_REG *) 	0x400E135C) // (PIOC) Sensor Interrupt Mask Register
#define AT91C_PIOC_SLEW1 ((AT91_REG *) 	0x400E1300) // (PIOC) PIO SLEWRATE1 REGISTER 
#define AT91C_PIOC_SENIER ((AT91_REG *) 	0x400E1354) // (PIOC) Sensor Interrupt Enable Register
#define AT91C_PIOC_SODR ((AT91_REG *) 	0x400E1230) // (PIOC) Set Output Data Register
#define AT91C_PIOC_SP1  ((AT91_REG *) 	0x400E1270) // (PIOC) Select B Register
#define AT91C_PIOC_ABSR ((AT91_REG *) 	0x400E1278) // (PIOC) AB Select Status Register
// ========== Register definition for PMC peripheral ========== 
#define AT91C_PMC_PLLAR ((AT91_REG *) 	0x400E0428) // (PMC) PLL Register
#define AT91C_PMC_UCKR  ((AT91_REG *) 	0x400E041C) // (PMC) UTMI Clock Configuration Register
#define AT91C_PMC_FSMR  ((AT91_REG *) 	0x400E0470) // (PMC) Fast Startup Mode Register
#define AT91C_PMC_MCKR  ((AT91_REG *) 	0x400E0430) // (PMC) Master Clock Register
#define AT91C_PMC_SCER  ((AT91_REG *) 	0x400E0400) // (PMC) System Clock Enable Register
#define AT91C_PMC_PCSR  ((AT91_REG *) 	0x400E0418) // (PMC) Peripheral Clock Status Register 0:31 PERI_ID
#define AT91C_PMC_MCFR  ((AT91_REG *) 	0x400E0424) // (PMC) Main Clock  Frequency Register
#define AT91C_PMC_PCER1 ((AT91_REG *) 	0x400E0500) // (PMC) Peripheral Clock Enable Register 32:63 PERI_ID
#define AT91C_PMC_FOCR  ((AT91_REG *) 	0x400E0478) // (PMC) Fault Output Clear Register
#define AT91C_PMC_PCSR1 ((AT91_REG *) 	0x400E0508) // (PMC) Peripheral Clock Status Register 32:63 PERI_ID
#define AT91C_PMC_FSPR  ((AT91_REG *) 	0x400E0474) // (PMC) Fast Startup Polarity Register
#define AT91C_PMC_SCSR  ((AT91_REG *) 	0x400E0408) // (PMC) System Clock Status Register
#define AT91C_PMC_IDR   ((AT91_REG *) 	0x400E0464) // (PMC) Interrupt Disable Register
#define AT91C_PMC_UDPR  ((AT91_REG *) 	0x400E0438) // (PMC) USB DEV Clock Configuration Register
#define AT91C_PMC_PCDR1 ((AT91_REG *) 	0x400E0504) // (PMC) Peripheral Clock Disable Register 32:63 PERI_ID
#define AT91C_PMC_VER   ((AT91_REG *) 	0x400E04FC) // (PMC) APMC VERSION REGISTER
#define AT91C_PMC_IMR   ((AT91_REG *) 	0x400E046C) // (PMC) Interrupt Mask Register
#define AT91C_PMC_IPNAME2 ((AT91_REG *) 	0x400E04F4) // (PMC) PMC IPNAME2 REGISTER 
#define AT91C_PMC_SCDR  ((AT91_REG *) 	0x400E0404) // (PMC) System Clock Disable Register
#define AT91C_PMC_PCKR  ((AT91_REG *) 	0x400E0440) // (PMC) Programmable Clock Register
#define AT91C_PMC_ADDRSIZE ((AT91_REG *) 	0x400E04EC) // (PMC) PMC ADDRSIZE REGISTER 
#define AT91C_PMC_PCDR  ((AT91_REG *) 	0x400E0414) // (PMC) Peripheral Clock Disable Register 0:31 PERI_ID
#define AT91C_PMC_MOR   ((AT91_REG *) 	0x400E0420) // (PMC) Main Oscillator Register
#define AT91C_PMC_SR    ((AT91_REG *) 	0x400E0468) // (PMC) Status Register
#define AT91C_PMC_IER   ((AT91_REG *) 	0x400E0460) // (PMC) Interrupt Enable Register
#define AT91C_PMC_PLLBR ((AT91_REG *) 	0x400E042C) // (PMC) PLL B Register
#define AT91C_PMC_IPNAME1 ((AT91_REG *) 	0x400E04F0) // (PMC) PMC IPNAME1 REGISTER 
#define AT91C_PMC_PCER  ((AT91_REG *) 	0x400E0410) // (PMC) Peripheral Clock Enable Register 0:31 PERI_ID
#define AT91C_PMC_FEATURES ((AT91_REG *) 	0x400E04F8) // (PMC) PMC FEATURES REGISTER 
#define AT91C_PMC_PCR   ((AT91_REG *) 	0x400E050C) // (PMC) Peripheral Control Register
// ========== Register definition for CKGR peripheral ========== 
#define AT91C_CKGR_PLLAR ((AT91_REG *) 	0x400E0428) // (CKGR) PLL Register
#define AT91C_CKGR_UCKR ((AT91_REG *) 	0x400E041C) // (CKGR) UTMI Clock Configuration Register
#define AT91C_CKGR_MOR  ((AT91_REG *) 	0x400E0420) // (CKGR) Main Oscillator Register
#define AT91C_CKGR_MCFR ((AT91_REG *) 	0x400E0424) // (CKGR) Main Clock  Frequency Register
#define AT91C_CKGR_PLLBR ((AT91_REG *) 	0x400E042C) // (CKGR) PLL B Register
// ========== Register definition for RSTC peripheral ========== 
#define AT91C_RSTC_RSR  ((AT91_REG *) 	0x400E1404) // (RSTC) Reset Status Register
#define AT91C_RSTC_RCR  ((AT91_REG *) 	0x400E1400) // (RSTC) Reset Control Register
#define AT91C_RSTC_RMR  ((AT91_REG *) 	0x400E1408) // (RSTC) Reset Mode Register
#define AT91C_RSTC_VER  ((AT91_REG *) 	0x400E14FC) // (RSTC) Version Register
// ========== Register definition for SUPC peripheral ========== 
#define AT91C_SUPC_FWUTR ((AT91_REG *) 	0x400E1428) // (SUPC) Flash Wake-up Timer Register
#define AT91C_SUPC_SR   ((AT91_REG *) 	0x400E1424) // (SUPC) Status Register
#define AT91C_SUPC_BOMR ((AT91_REG *) 	0x400E1414) // (SUPC) Brown Out Mode Register
#define AT91C_SUPC_WUMR ((AT91_REG *) 	0x400E141C) // (SUPC) Wake Up Mode Register
#define AT91C_SUPC_WUIR ((AT91_REG *) 	0x400E1420) // (SUPC) Wake Up Inputs Register
#define AT91C_SUPC_CR   ((AT91_REG *) 	0x400E1410) // (SUPC) Control Register
#define AT91C_SUPC_MR   ((AT91_REG *) 	0x400E1418) // (SUPC) Mode Register
// ========== Register definition for RTTC peripheral ========== 
#define AT91C_RTTC_RTSR ((AT91_REG *) 	0x400E143C) // (RTTC) Real-time Status Register
#define AT91C_RTTC_RTVR ((AT91_REG *) 	0x400E1438) // (RTTC) Real-time Value Register
#define AT91C_RTTC_RTMR ((AT91_REG *) 	0x400E1430) // (RTTC) Real-time Mode Register
#define AT91C_RTTC_RTAR ((AT91_REG *) 	0x400E1434) // (RTTC) Real-time Alarm Register
// ========== Register definition for WDTC peripheral ========== 
#define AT91C_WDTC_WDCR ((AT91_REG *) 	0x400E1450) // (WDTC) Watchdog Control Register
#define AT91C_WDTC_WDMR ((AT91_REG *) 	0x400E1454) // (WDTC) Watchdog Mode Register
#define AT91C_WDTC_WDSR ((AT91_REG *) 	0x400E1458) // (WDTC) Watchdog Status Register
// ========== Register definition for RTC peripheral ========== 
#define AT91C_RTC_VER   ((AT91_REG *) 	0x400E148C) // (RTC) Valid Entry Register
#define AT91C_RTC_TIMR  ((AT91_REG *) 	0x400E1468) // (RTC) Time Register
#define AT91C_RTC_CALALR ((AT91_REG *) 	0x400E1474) // (RTC) Calendar Alarm Register
#define AT91C_RTC_IER   ((AT91_REG *) 	0x400E1480) // (RTC) Interrupt Enable Register
#define AT91C_RTC_MR    ((AT91_REG *) 	0x400E1464) // (RTC) Mode Register
#define AT91C_RTC_CALR  ((AT91_REG *) 	0x400E146C) // (RTC) Calendar Register
#define AT91C_RTC_TIMALR ((AT91_REG *) 	0x400E1470) // (RTC) Time Alarm Register
#define AT91C_RTC_SCCR  ((AT91_REG *) 	0x400E147C) // (RTC) Status Clear Command Register
#define AT91C_RTC_CR    ((AT91_REG *) 	0x400E1460) // (RTC) Control Register
#define AT91C_RTC_IDR   ((AT91_REG *) 	0x400E1484) // (RTC) Interrupt Disable Register
#define AT91C_RTC_IMR   ((AT91_REG *) 	0x400E1488) // (RTC) Interrupt Mask Register
#define AT91C_RTC_SR    ((AT91_REG *) 	0x400E1478) // (RTC) Status Register
// ========== Register definition for ADC0 peripheral ========== 
#define AT91C_ADC0_CDR2 ((AT91_REG *) 	0x40038058) // (ADC0) ADC Channel Data Register 2
#define AT91C_ADC0_CGR  ((AT91_REG *) 	0x40038048) // (ADC0) Control gain register
#define AT91C_ADC0_CDR7 ((AT91_REG *) 	0x4003806C) // (ADC0) ADC Channel Data Register 7
#define AT91C_ADC0_IDR  ((AT91_REG *) 	0x40038028) // (ADC0) ADC Interrupt Disable Register
#define AT91C_ADC0_CR   ((AT91_REG *) 	0x40038000) // (ADC0) ADC Control Register
#define AT91C_ADC0_FEATURES ((AT91_REG *) 	0x400380F8) // (ADC0) ADC FEATURES REGISTER 
#define AT91C_ADC0_CWR  ((AT91_REG *) 	0x40038040) // (ADC0) unspecified
#define AT91C_ADC0_IPNAME1 ((AT91_REG *) 	0x400380F0) // (ADC0) ADC IPNAME1 REGISTER 
#define AT91C_ADC0_CDR9 ((AT91_REG *) 	0x40038074) // (ADC0) ADC Channel Data Register 9
#define AT91C_ADC0_CDR3 ((AT91_REG *) 	0x4003805C) // (ADC0) ADC Channel Data Register 3
#define AT91C_ADC0_SR   ((AT91_REG *) 	0x40038030) // (ADC0) ADC Status Register
#define AT91C_ADC0_CHER ((AT91_REG *) 	0x40038010) // (ADC0) ADC Channel Enable Register
#define AT91C_ADC0_CDR1 ((AT91_REG *) 	0x40038054) // (ADC0) ADC Channel Data Register 1
#define AT91C_ADC0_CDR6 ((AT91_REG *) 	0x40038068) // (ADC0) ADC Channel Data Register 6
#define AT91C_ADC0_MR   ((AT91_REG *) 	0x40038004) // (ADC0) ADC Mode Register
#define AT91C_ADC0_CWSR ((AT91_REG *) 	0x40038044) // (ADC0) unspecified
#define AT91C_ADC0_VER  ((AT91_REG *) 	0x400380FC) // (ADC0) ADC VERSION REGISTER
#define AT91C_ADC0_COR  ((AT91_REG *) 	0x4003804C) // (ADC0) unspecified
#define AT91C_ADC0_CDR8 ((AT91_REG *) 	0x40038070) // (ADC0) ADC Channel Data Register 8
#define AT91C_ADC0_IPNAME2 ((AT91_REG *) 	0x400380F4) // (ADC0) ADC IPNAME2 REGISTER 
#define AT91C_ADC0_CDR0 ((AT91_REG *) 	0x40038050) // (ADC0) ADC Channel Data Register 0
#define AT91C_ADC0_LCDR ((AT91_REG *) 	0x40038020) // (ADC0) ADC Last Converted Data Register
#define AT91C_ADC0_CDR12 ((AT91_REG *) 	0x40038080) // (ADC0) ADC Channel Data Register 12
#define AT91C_ADC0_CHDR ((AT91_REG *) 	0x40038014) // (ADC0) ADC Channel Disable Register
#define AT91C_ADC0_OVR  ((AT91_REG *) 	0x4003803C) // (ADC0) unspecified
#define AT91C_ADC0_CDR15 ((AT91_REG *) 	0x4003808C) // (ADC0) ADC Channel Data Register 15
#define AT91C_ADC0_CDR11 ((AT91_REG *) 	0x4003807C) // (ADC0) ADC Channel Data Register 11
#define AT91C_ADC0_ADDRSIZE ((AT91_REG *) 	0x400380EC) // (ADC0) ADC ADDRSIZE REGISTER 
#define AT91C_ADC0_CDR13 ((AT91_REG *) 	0x40038084) // (ADC0) ADC Channel Data Register 13
#define AT91C_ADC0_ACR  ((AT91_REG *) 	0x40038094) // (ADC0) unspecified
#define AT91C_ADC0_CDR5 ((AT91_REG *) 	0x40038064) // (ADC0) ADC Channel Data Register 5
#define AT91C_ADC0_CDR14 ((AT91_REG *) 	0x40038088) // (ADC0) ADC Channel Data Register 14
#define AT91C_ADC0_IMR  ((AT91_REG *) 	0x4003802C) // (ADC0) ADC Interrupt Mask Register
#define AT91C_ADC0_CHSR ((AT91_REG *) 	0x40038018) // (ADC0) ADC Channel Status Register
#define AT91C_ADC0_CDR10 ((AT91_REG *) 	0x40038078) // (ADC0) ADC Channel Data Register 10
#define AT91C_ADC0_IER  ((AT91_REG *) 	0x40038024) // (ADC0) ADC Interrupt Enable Register
#define AT91C_ADC0_CDR4 ((AT91_REG *) 	0x40038060) // (ADC0) ADC Channel Data Register 4
// ========== Register definition for DAC0 peripheral ========== 
#define AT91C_DAC0_FEATURES ((AT91_REG *) 	0x4003C0F8) // (DAC0) DAC FEATURES REGISTER 
#define AT91C_DAC0_ADDRSIZE ((AT91_REG *) 	0x4003C0EC) // (DAC0) DAC ADDRSIZE REGISTER 
#define AT91C_DAC0_WPMR ((AT91_REG *) 	0x4003C0E4) // (DAC0) Write Protect Mode Register
#define AT91C_DAC0_CHDR ((AT91_REG *) 	0x4003C014) // (DAC0) Channel Disable Register
#define AT91C_DAC0_IPNAME1 ((AT91_REG *) 	0x4003C0F0) // (DAC0) DAC IPNAME1 REGISTER 
#define AT91C_DAC0_IDR  ((AT91_REG *) 	0x4003C028) // (DAC0) Interrupt Disable Register
#define AT91C_DAC0_CR   ((AT91_REG *) 	0x4003C000) // (DAC0) Control Register
#define AT91C_DAC0_IPNAME2 ((AT91_REG *) 	0x4003C0F4) // (DAC0) DAC IPNAME2 REGISTER 
#define AT91C_DAC0_IMR  ((AT91_REG *) 	0x4003C02C) // (DAC0) Interrupt Mask Register
#define AT91C_DAC0_CHSR ((AT91_REG *) 	0x4003C018) // (DAC0) Channel Status Register
#define AT91C_DAC0_ACR  ((AT91_REG *) 	0x4003C094) // (DAC0) Analog Current Register
#define AT91C_DAC0_WPSR ((AT91_REG *) 	0x4003C0E8) // (DAC0) Write Protect Status Register
#define AT91C_DAC0_CHER ((AT91_REG *) 	0x4003C010) // (DAC0) Channel Enable Register
#define AT91C_DAC0_CDR  ((AT91_REG *) 	0x4003C020) // (DAC0) Coversion Data Register
#define AT91C_DAC0_IER  ((AT91_REG *) 	0x4003C024) // (DAC0) Interrupt Enable Register
#define AT91C_DAC0_ISR  ((AT91_REG *) 	0x4003C030) // (DAC0) Interrupt Status Register
#define AT91C_DAC0_VER  ((AT91_REG *) 	0x4003C0FC) // (DAC0) DAC VERSION REGISTER
#define AT91C_DAC0_MR   ((AT91_REG *) 	0x4003C004) // (DAC0) Mode Register
// ========== Register definition for ACC0 peripheral ========== 
#define AT91C_ACC0_IPNAME1 ((AT91_REG *) 	0x400400F0) // (ACC0) ACC IPNAME1 REGISTER 
#define AT91C_ACC0_MR   ((AT91_REG *) 	0x40040004) // (ACC0) Mode Register
#define AT91C_ACC0_FEATURES ((AT91_REG *) 	0x400400F8) // (ACC0) ACC FEATURES REGISTER 
#define AT91C_ACC0_IMR  ((AT91_REG *) 	0x4004002C) // (ACC0) Interrupt Mask Register
#define AT91C_ACC0_ACR  ((AT91_REG *) 	0x40040094) // (ACC0) Analog Control Register
#define AT91C_ACC0_ADDRSIZE ((AT91_REG *) 	0x400400EC) // (ACC0) ACC ADDRSIZE REGISTER 
#define AT91C_ACC0_IER  ((AT91_REG *) 	0x40040024) // (ACC0) Interrupt Enable Register
#define AT91C_ACC0_ISR  ((AT91_REG *) 	0x40040030) // (ACC0) Interrupt Status Register
#define AT91C_ACC0_IDR  ((AT91_REG *) 	0x40040028) // (ACC0) Interrupt Disable Register
#define AT91C_ACC0_MODE ((AT91_REG *) 	0x400400E4) // (ACC0) Write Protection Mode Register
#define AT91C_ACC0_VER  ((AT91_REG *) 	0x400400FC) // (ACC0) ACC VERSION REGISTER
#define AT91C_ACC0_CR   ((AT91_REG *) 	0x40040000) // (ACC0) Control Register
#define AT91C_ACC0_IPNAME2 ((AT91_REG *) 	0x400400F4) // (ACC0) ACC IPNAME2 REGISTER 
#define AT91C_ACC0_STATUS ((AT91_REG *) 	0x400400E8) // (ACC0) Write Protection Status
// ========== Register definition for HCBDMA peripheral ========== 
#define AT91C_HCBDMA_CBIMR ((AT91_REG *) 	0x4004401C) // (HCBDMA) CB DMA Interrupt mask Register
#define AT91C_HCBDMA_CBCRCCR ((AT91_REG *) 	0x40044034) // (HCBDMA) CB DMA CRC Control Resgister
#define AT91C_HCBDMA_CBSR ((AT91_REG *) 	0x40044010) // (HCBDMA) CB DMA Status Register
#define AT91C_HCBDMA_CBCRCISR ((AT91_REG *) 	0x4004404C) // (HCBDMA) CB DMA CRC Interrupt Status Resgister
#define AT91C_HCBDMA_CBCRCSR ((AT91_REG *) 	0x4004403C) // (HCBDMA) CB DMA CRC Status Resgister
#define AT91C_HCBDMA_CBIDR ((AT91_REG *) 	0x40044018) // (HCBDMA) CB DMA Interrupt Disable Register
#define AT91C_HCBDMA_CBCRCIDR ((AT91_REG *) 	0x40044044) // (HCBDMA) CB DMA CRC Interrupt Disable Resgister
#define AT91C_HCBDMA_CBDLIER ((AT91_REG *) 	0x40044024) // (HCBDMA) CB DMA Loaded Interrupt Enable Register
#define AT91C_HCBDMA_CBEN ((AT91_REG *) 	0x40044008) // (HCBDMA) CB DMA Enable Register
#define AT91C_HCBDMA_FEATURES ((AT91_REG *) 	0x400440F8) // (HCBDMA) HCBDMA FEATURES REGISTER 
#define AT91C_HCBDMA_CBDSCR ((AT91_REG *) 	0x40044000) // (HCBDMA) CB DMA Descriptor Base Register
#define AT91C_HCBDMA_ADDRSIZE ((AT91_REG *) 	0x400440EC) // (HCBDMA) HCBDMA ADDRSIZE REGISTER 
#define AT91C_HCBDMA_CBDLISR ((AT91_REG *) 	0x40044030) // (HCBDMA) CB DMA Loaded Interrupt Status Register
#define AT91C_HCBDMA_CBDLIDR ((AT91_REG *) 	0x40044028) // (HCBDMA) CB DMA Loaded Interrupt Disable Register
