una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s4.h
#define AT91C_SSC0_TCR  ((AT91_REG *) 	0x4000410C) // (PDC_SSC0) Transmit Counter Register
#define AT91C_SSC0_PTCR ((AT91_REG *) 	0x40004120) // (PDC_SSC0) PDC Transfer Control Register
#define AT91C_SSC0_TNPR ((AT91_REG *) 	0x40004118) // (PDC_SSC0) Transmit Next Pointer Register
#define AT91C_SSC0_RPR  ((AT91_REG *) 	0x40004100) // (PDC_SSC0) Receive Pointer Register
#define AT91C_SSC0_TNCR ((AT91_REG *) 	0x4000411C) // (PDC_SSC0) Transmit Next Counter Register
#define AT91C_SSC0_RNPR ((AT91_REG *) 	0x40004110) // (PDC_SSC0) Receive Next Pointer Register
#define AT91C_SSC0_RCR  ((AT91_REG *) 	0x40004104) // (PDC_SSC0) Receive Counter Register
#define AT91C_SSC0_PTSR ((AT91_REG *) 	0x40004124) // (PDC_SSC0) PDC Transfer Status Register
// ========== Register definition for SSC0 peripheral ========== 
#define AT91C_SSC0_FEATURES ((AT91_REG *) 	0x400040F8) // (SSC0) SSC FEATURES REGISTER 
#define AT91C_SSC0_ADDRSIZE ((AT91_REG *) 	0x400040F0) // (SSC0) SSC ADDRSIZE REGISTER 
#define AT91C_SSC0_CR   ((AT91_REG *) 	0x40004000) // (SSC0) Control Register
#define AT91C_SSC0_RHR  ((AT91_REG *) 	0x40004020) // (SSC0) Receive Holding Register
#define AT91C_SSC0_VER  ((AT91_REG *) 	0x400040FC) // (SSC0) Version Register
#define AT91C_SSC0_TSHR ((AT91_REG *) 	0x40004034) // (SSC0) Transmit Sync Holding Register
#define AT91C_SSC0_RFMR ((AT91_REG *) 	0x40004014) // (SSC0) Receive Frame Mode Register
#define AT91C_SSC0_IDR  ((AT91_REG *) 	0x40004048) // (SSC0) Interrupt Disable Register
#define AT91C_SSC0_TFMR ((AT91_REG *) 	0x4000401C) // (SSC0) Transmit Frame Mode Register
#define AT91C_SSC0_RSHR ((AT91_REG *) 	0x40004030) // (SSC0) Receive Sync Holding Register
#define AT91C_SSC0_TCMR ((AT91_REG *) 	0x40004018) // (SSC0) Transmit Clock Mode Register
#define AT91C_SSC0_RCMR ((AT91_REG *) 	0x40004010) // (SSC0) Receive Clock ModeRegister
#define AT91C_SSC0_SR   ((AT91_REG *) 	0x40004040) // (SSC0) Status Register
#define AT91C_SSC0_NAME ((AT91_REG *) 	0x400040F4) // (SSC0) SSC NAME REGISTER 
#define AT91C_SSC0_THR  ((AT91_REG *) 	0x40004024) // (SSC0) Transmit Holding Register
#define AT91C_SSC0_CMR  ((AT91_REG *) 	0x40004004) // (SSC0) Clock Mode Register
#define AT91C_SSC0_IER  ((AT91_REG *) 	0x40004044) // (SSC0) Interrupt Enable Register
#define AT91C_SSC0_IMR  ((AT91_REG *) 	0x4000404C) // (SSC0) Interrupt Mask Register
// ========== Register definition for PDC_PWMC peripheral ========== 
#define AT91C_PWMC_TNCR ((AT91_REG *) 	0x4002011C) // (PDC_PWMC) Transmit Next Counter Register
#define AT91C_PWMC_RCR  ((AT91_REG *) 	0x40020104) // (PDC_PWMC) Receive Counter Register
#define AT91C_PWMC_TCR  ((AT91_REG *) 	0x4002010C) // (PDC_PWMC) Transmit Counter Register
#define AT91C_PWMC_RNCR ((AT91_REG *) 	0x40020114) // (PDC_PWMC) Receive Next Counter Register
#define AT91C_PWMC_PTSR ((AT91_REG *) 	0x40020124) // (PDC_PWMC) PDC Transfer Status Register
#define AT91C_PWMC_RNPR ((AT91_REG *) 	0x40020110) // (PDC_PWMC) Receive Next Pointer Register
#define AT91C_PWMC_TNPR ((AT91_REG *) 	0x40020118) // (PDC_PWMC) Transmit Next Pointer Register
#define AT91C_PWMC_PTCR ((AT91_REG *) 	0x40020120) // (PDC_PWMC) PDC Transfer Control Register
#define AT91C_PWMC_RPR  ((AT91_REG *) 	0x40020100) // (PDC_PWMC) Receive Pointer Register
#define AT91C_PWMC_TPR  ((AT91_REG *) 	0x40020108) // (PDC_PWMC) Transmit Pointer Register
// ========== Register definition for PWMC_CH0 peripheral ========== 
#define AT91C_PWMC_CH0_CMR ((AT91_REG *) 	0x40020200) // (PWMC_CH0) Channel Mode Register
#define AT91C_PWMC_CH0_DTUPDR ((AT91_REG *) 	0x4002021C) // (PWMC_CH0) Channel Dead Time Update Value Register
#define AT91C_PWMC_CH0_CPRDR ((AT91_REG *) 	0x4002020C) // (PWMC_CH0) Channel Period Register
#define AT91C_PWMC_CH0_CPRDUPDR ((AT91_REG *) 	0x40020210) // (PWMC_CH0) Channel Period Update Register
#define AT91C_PWMC_CH0_CDTYR ((AT91_REG *) 	0x40020204) // (PWMC_CH0) Channel Duty Cycle Register
#define AT91C_PWMC_CH0_DTR ((AT91_REG *) 	0x40020218) // (PWMC_CH0) Channel Dead Time Value Register
#define AT91C_PWMC_CH0_CDTYUPDR ((AT91_REG *) 	0x40020208) // (PWMC_CH0) Channel Duty Cycle Update Register
#define AT91C_PWMC_CH0_CCNTR ((AT91_REG *) 	0x40020214) // (PWMC_CH0) Channel Counter Register
// ========== Register definition for PWMC_CH1 peripheral ========== 
#define AT91C_PWMC_CH1_DTUPDR ((AT91_REG *) 	0x4002023C) // (PWMC_CH1) Channel Dead Time Update Value Register
#define AT91C_PWMC_CH1_DTR ((AT91_REG *) 	0x40020238) // (PWMC_CH1) Channel Dead Time Value Register
#define AT91C_PWMC_CH1_CDTYUPDR ((AT91_REG *) 	0x40020228) // (PWMC_CH1) Channel Duty Cycle Update Register
#define AT91C_PWMC_CH1_CDTYR ((AT91_REG *) 	0x40020224) // (PWMC_CH1) Channel Duty Cycle Register
#define AT91C_PWMC_CH1_CCNTR ((AT91_REG *) 	0x40020234) // (PWMC_CH1) Channel Counter Register
#define AT91C_PWMC_CH1_CPRDR ((AT91_REG *) 	0x4002022C) // (PWMC_CH1) Channel Period Register
#define AT91C_PWMC_CH1_CMR ((AT91_REG *) 	0x40020220) // (PWMC_CH1) Channel Mode Register
#define AT91C_PWMC_CH1_CPRDUPDR ((AT91_REG *) 	0x40020230) // (PWMC_CH1) Channel Period Update Register
// ========== Register definition for PWMC_CH2 peripheral ========== 
#define AT91C_PWMC_CH2_CPRDUPDR ((AT91_REG *) 	0x40020250) // (PWMC_CH2) Channel Period Update Register
#define AT91C_PWMC_CH2_CDTYR ((AT91_REG *) 	0x40020244) // (PWMC_CH2) Channel Duty Cycle Register
#define AT91C_PWMC_CH2_CCNTR ((AT91_REG *) 	0x40020254) // (PWMC_CH2) Channel Counter Register
#define AT91C_PWMC_CH2_CMR ((AT91_REG *) 	0x40020240) // (PWMC_CH2) Channel Mode Register
#define AT91C_PWMC_CH2_CDTYUPDR ((AT91_REG *) 	0x40020248) // (PWMC_CH2) Channel Duty Cycle Update Register
#define AT91C_PWMC_CH2_DTUPDR ((AT91_REG *) 	0x4002025C) // (PWMC_CH2) Channel Dead Time Update Value Register
#define AT91C_PWMC_CH2_DTR ((AT91_REG *) 	0x40020258) // (PWMC_CH2) Channel Dead Time Value Register
#define AT91C_PWMC_CH2_CPRDR ((AT91_REG *) 	0x4002024C) // (PWMC_CH2) Channel Period Register
// ========== Register definition for PWMC_CH3 peripheral ========== 
#define AT91C_PWMC_CH3_CPRDR ((AT91_REG *) 	0x4002026C) // (PWMC_CH3) Channel Period Register
#define AT91C_PWMC_CH3_DTUPDR ((AT91_REG *) 	0x4002027C) // (PWMC_CH3) Channel Dead Time Update Value Register
#define AT91C_PWMC_CH3_DTR ((AT91_REG *) 	0x40020278) // (PWMC_CH3) Channel Dead Time Value Register
#define AT91C_PWMC_CH3_CDTYR ((AT91_REG *) 	0x40020264) // (PWMC_CH3) Channel Duty Cycle Register
#define AT91C_PWMC_CH3_CMR ((AT91_REG *) 	0x40020260) // (PWMC_CH3) Channel Mode Register
#define AT91C_PWMC_CH3_CCNTR ((AT91_REG *) 	0x40020274) // (PWMC_CH3) Channel Counter Register
#define AT91C_PWMC_CH3_CPRDUPDR ((AT91_REG *) 	0x40020270) // (PWMC_CH3) Channel Period Update Register
#define AT91C_PWMC_CH3_CDTYUPDR ((AT91_REG *) 	0x40020268) // (PWMC_CH3) Channel Duty Cycle Update Register
// ========== Register definition for PWMC peripheral ========== 
#define AT91C_PWMC_CMP6M ((AT91_REG *) 	0x40020198) // (PWMC) PWM Comparison Mode 6 Register
#define AT91C_PWMC_ADDRSIZE ((AT91_REG *) 	0x400200EC) // (PWMC) PWMC ADDRSIZE REGISTER 
#define AT91C_PWMC_CMP5V ((AT91_REG *) 	0x40020180) // (PWMC) PWM Comparison Value 5 Register
#define AT91C_PWMC_FMR  ((AT91_REG *) 	0x4002005C) // (PWMC) PWM Fault Mode Register
#define AT91C_PWMC_IER2 ((AT91_REG *) 	0x40020034) // (PWMC) PWMC Interrupt Enable Register 2
#define AT91C_PWMC_EL5MR ((AT91_REG *) 	0x40020090) // (PWMC) PWM Event Line 5 Mode Register
#define AT91C_PWMC_CMP0VUPD ((AT91_REG *) 	0x40020134) // (PWMC) PWM Comparison Value 0 Update Register
#define AT91C_PWMC_FPER1 ((AT91_REG *) 	0x4002006C) // (PWMC) PWM Fault Protection Enable Register 1
#define AT91C_PWMC_SCUPUPD ((AT91_REG *) 	0x40020030) // (PWMC) PWM Update Period Update Register
#define AT91C_PWMC_DIS  ((AT91_REG *) 	0x40020008) // (PWMC) PWMC Disable Register
#define AT91C_PWMC_CMP1M ((AT91_REG *) 	0x40020148) // (PWMC) PWM Comparison Mode 1 Register
#define AT91C_PWMC_CMP2V ((AT91_REG *) 	0x40020150) // (PWMC) PWM Comparison Value 2 Register
#define AT91C_PWMC_WPCR ((AT91_REG *) 	0x400200E4) // (PWMC) PWM Write Protection Enable Register
#define AT91C_PWMC_CMP5MUPD ((AT91_REG *) 	0x4002018C) // (PWMC) PWM Comparison Mode 5 Update Register
#define AT91C_PWMC_FPV  ((AT91_REG *) 	0x40020068) // (PWMC) PWM Fault Protection Value Register
#define AT91C_PWMC_UPCR ((AT91_REG *) 	0x40020028) // (PWMC) PWM Update Control Register
#define AT91C_PWMC_CMP4MUPD ((AT91_REG *) 	0x4002017C) // (PWMC) PWM Comparison Mode 4 Update Register
#define AT91C_PWMC_EL6MR ((AT91_REG *) 	0x40020094) // (PWMC) PWM Event Line 6 Mode Register
#define AT91C_PWMC_OS   ((AT91_REG *) 	0x40020048) // (PWMC) PWM Output Selection Register
#define AT91C_PWMC_OSSUPD ((AT91_REG *) 	0x40020054) // (PWMC) PWM Output Selection Set Update Register
#define AT91C_PWMC_FSR  ((AT91_REG *) 	0x40020060) // (PWMC) PWM Fault Mode Status Register
#define AT91C_PWMC_CMP2M ((AT91_REG *) 	0x40020158) // (PWMC) PWM Comparison Mode 2 Register
#define AT91C_PWMC_EL2MR ((AT91_REG *) 	0x40020084) // (PWMC) PWM Event Line 2 Mode Register
#define AT91C_PWMC_FPER3 ((AT91_REG *) 	0x40020074) // (PWMC) PWM Fault Protection Enable Register 3
#define AT91C_PWMC_CMP4M ((AT91_REG *) 	0x40020178) // (PWMC) PWM Comparison Mode 4 Register
#define AT91C_PWMC_ISR2 ((AT91_REG *) 	0x40020040) // (PWMC) PWMC Interrupt Status Register 2
#define AT91C_PWMC_CMP6VUPD ((AT91_REG *) 	0x40020194) // (PWMC) PWM Comparison Value 6 Update Register
#define AT91C_PWMC_CMP5VUPD ((AT91_REG *) 	0x40020184) // (PWMC) PWM Comparison Value 5 Update Register
#define AT91C_PWMC_EL7MR ((AT91_REG *) 	0x40020098) // (PWMC) PWM Event Line 7 Mode Register
#define AT91C_PWMC_OSC  ((AT91_REG *) 	0x40020050) // (PWMC) PWM Output Selection Clear Register
#define AT91C_PWMC_CMP3MUPD ((AT91_REG *) 	0x4002016C) // (PWMC) PWM Comparison Mode 3 Update Register
#define AT91C_PWMC_CMP2MUPD ((AT91_REG *) 	0x4002015C) // (PWMC) PWM Comparison Mode 2 Update Register
#define AT91C_PWMC_CMP0M ((AT91_REG *) 	0x40020138) // (PWMC) PWM Comparison Mode 0 Register
#define AT91C_PWMC_EL1MR ((AT91_REG *) 	0x40020080) // (PWMC) PWM Event Line 1 Mode Register
#define AT91C_PWMC_CMP0MUPD ((AT91_REG *) 	0x4002013C) // (PWMC) PWM Comparison Mode 0 Update Register
#define AT91C_PWMC_WPSR ((AT91_REG *) 	0x400200E8) // (PWMC) PWM Write Protection Status Register
#define AT91C_PWMC_CMP1MUPD ((AT91_REG *) 	0x4002014C) // (PWMC) PWM Comparison Mode 1 Update Register
#define AT91C_PWMC_IMR2 ((AT91_REG *) 	0x4002003C) // (PWMC) PWMC Interrupt Mask Register 2
#define AT91C_PWMC_CMP3V ((AT91_REG *) 	0x40020160) // (PWMC) PWM Comparison Value 3 Register
#define AT91C_PWMC_CMP3VUPD ((AT91_REG *) 	0x40020164) // (PWMC) PWM Comparison Value 3 Update Register
#define AT91C_PWMC_CMP3M ((AT91_REG *) 	0x40020168) // (PWMC) PWM Comparison Mode 3 Register
#define AT91C_PWMC_FPER4 ((AT91_REG *) 	0x40020078) // (PWMC) PWM Fault Protection Enable Register 4
#define AT91C_PWMC_OSCUPD ((AT91_REG *) 	0x40020058) // (PWMC) PWM Output Selection Clear Update Register
#define AT91C_PWMC_CMP0V ((AT91_REG *) 	0x40020130) // (PWMC) PWM Comparison Value 0 Register
#define AT91C_PWMC_OOV  ((AT91_REG *) 	0x40020044) // (PWMC) PWM Output Override Value Register
#define AT91C_PWMC_ENA  ((AT91_REG *) 	0x40020004) // (PWMC) PWMC Enable Register
#define AT91C_PWMC_CMP6MUPD ((AT91_REG *) 	0x4002019C) // (PWMC) PWM Comparison Mode 6 Update Register
#define AT91C_PWMC_SYNC ((AT91_REG *) 	0x40020020) // (PWMC) PWM Synchronized Channels Register
#define AT91C_PWMC_IPNAME1 ((AT91_REG *) 	0x400200F0) // (PWMC) PWMC IPNAME1 REGISTER 
#define AT91C_PWMC_IDR2 ((AT91_REG *) 	0x40020038) // (PWMC) PWMC Interrupt Disable Register 2
#define AT91C_PWMC_SR   ((AT91_REG *) 	0x4002000C) // (PWMC) PWMC Status Register
#define AT91C_PWMC_FPER2 ((AT91_REG *) 	0x40020070) // (PWMC) PWM Fault Protection Enable Register 2
#define AT91C_PWMC_EL3MR ((AT91_REG *) 	0x40020088) // (PWMC) PWM Event Line 3 Mode Register
#define AT91C_PWMC_IMR1 ((AT91_REG *) 	0x40020018) // (PWMC) PWMC Interrupt Mask Register 1
#define AT91C_PWMC_EL0MR ((AT91_REG *) 	0x4002007C) // (PWMC) PWM Event Line 0 Mode Register
#define AT91C_PWMC_STEP ((AT91_REG *) 	0x400200B0) // (PWMC) PWM Stepper Config Register
#define AT91C_PWMC_FCR  ((AT91_REG *) 	0x40020064) // (PWMC) PWM Fault Mode Clear Register
#define AT91C_PWMC_CMP7MUPD ((AT91_REG *) 	0x400201AC) // (PWMC) PWM Comparison Mode 7 Update Register
#define AT91C_PWMC_ISR1 ((AT91_REG *) 	0x4002001C) // (PWMC) PWMC Interrupt Status Register 1
#define AT91C_PWMC_CMP4VUPD ((AT91_REG *) 	0x40020174) // (PWMC) PWM Comparison Value 4 Update Register
#define AT91C_PWMC_VER  ((AT91_REG *) 	0x400200FC) // (PWMC) PWMC Version Register
#define AT91C_PWMC_CMP5M ((AT91_REG *) 	0x40020188) // (PWMC) PWM Comparison Mode 5 Register
#define AT91C_PWMC_IER1 ((AT91_REG *) 	0x40020010) // (PWMC) PWMC Interrupt Enable Register 1
#define AT91C_PWMC_MR   ((AT91_REG *) 	0x40020000) // (PWMC) PWMC Mode Register
#define AT91C_PWMC_OSS  ((AT91_REG *) 	0x4002004C) // (PWMC) PWM Output Selection Set Register
#define AT91C_PWMC_CMP7V ((AT91_REG *) 	0x400201A0) // (PWMC) PWM Comparison Value 7 Register
#define AT91C_PWMC_FEATURES ((AT91_REG *) 	0x400200F8) // (PWMC) PWMC FEATURES REGISTER 
#define AT91C_PWMC_CMP4V ((AT91_REG *) 	0x40020170) // (PWMC) PWM Comparison Value 4 Register
#define AT91C_PWMC_CMP7M ((AT91_REG *) 	0x400201A8) // (PWMC) PWM Comparison Mode 7 Register
#define AT91C_PWMC_EL4MR ((AT91_REG *) 	0x4002008C) // (PWMC) PWM Event Line 4 Mode Register
#define AT91C_PWMC_CMP2VUPD ((AT91_REG *) 	0x40020154) // (PWMC) PWM Comparison Value 2 Update Register
#define AT91C_PWMC_CMP6V ((AT91_REG *) 	0x40020190) // (PWMC) PWM Comparison Value 6 Register
#define AT91C_PWMC_CMP1V ((AT91_REG *) 	0x40020140) // (PWMC) PWM Comparison Value 1 Register
#define AT91C_PWMC_IDR1 ((AT91_REG *) 	0x40020014) // (PWMC) PWMC Interrupt Disable Register 1
#define AT91C_PWMC_SCUP ((AT91_REG *) 	0x4002002C) // (PWMC) PWM Update Period Register
#define AT91C_PWMC_CMP1VUPD ((AT91_REG *) 	0x40020144) // (PWMC) PWM Comparison Value 1 Update Register
#define AT91C_PWMC_CMP7VUPD ((AT91_REG *) 	0x400201A4) // (PWMC) PWM Comparison Value 7 Update Register
#define AT91C_PWMC_IPNAME2 ((AT91_REG *) 	0x400200F4) // (PWMC) PWMC IPNAME2 REGISTER 
// ========== Register definition for SPI0 peripheral ========== 
#define AT91C_SPI0_ADDRSIZE ((AT91_REG *) 	0x400080EC) // (SPI0) SPI ADDRSIZE REGISTER 
#define AT91C_SPI0_RDR  ((AT91_REG *) 	0x40008008) // (SPI0) Receive Data Register
#define AT91C_SPI0_FEATURES ((AT91_REG *) 	0x400080F8) // (SPI0) SPI FEATURES REGISTER 
#define AT91C_SPI0_CR   ((AT91_REG *) 	0x40008000) // (SPI0) Control Register
#define AT91C_SPI0_IPNAME1 ((AT91_REG *) 	0x400080F0) // (SPI0) SPI IPNAME1 REGISTER 
#define AT91C_SPI0_VER  ((AT91_REG *) 	0x400080FC) // (SPI0) Version Register
#define AT91C_SPI0_IDR  ((AT91_REG *) 	0x40008018) // (SPI0) Interrupt Disable Register
#define AT91C_SPI0_TDR  ((AT91_REG *) 	0x4000800C) // (SPI0) Transmit Data Register
#define AT91C_SPI0_MR   ((AT91_REG *) 	0x40008004) // (SPI0) Mode Register
#define AT91C_SPI0_IER  ((AT91_REG *) 	0x40008014) // (SPI0) Interrupt Enable Register
#define AT91C_SPI0_IMR  ((AT91_REG *) 	0x4000801C) // (SPI0) Interrupt Mask Register
#define AT91C_SPI0_IPNAME2 ((AT91_REG *) 	0x400080F4) // (SPI0) SPI IPNAME2 REGISTER 
#define AT91C_SPI0_CSR  ((AT91_REG *) 	0x40008030) // (SPI0) Chip Select Register
#define AT91C_SPI0_SR   ((AT91_REG *) 	0x40008010) // (SPI0) Status Register
// ========== Register definition for UDP peripheral ========== 
#define AT91C_UDP_RSTEP ((AT91_REG *) 	0x40034028) // (UDP) Reset Endpoint Register
#define AT91C_UDP_CSR   ((AT91_REG *) 	0x40034030) // (UDP) Endpoint Control and Status Register
#define AT91C_UDP_IMR   ((AT91_REG *) 	0x40034018) // (UDP) Interrupt Mask Register
#define AT91C_UDP_FDR   ((AT91_REG *) 	0x40034050) // (UDP) Endpoint FIFO Data Register
#define AT91C_UDP_ISR   ((AT91_REG *) 	0x4003401C) // (UDP) Interrupt Status Register
#define AT91C_UDP_IPNAME2 ((AT91_REG *) 	0x400340F4) // (UDP) UDP IPNAME2 REGISTER 
#define AT91C_UDP_ICR   ((AT91_REG *) 	0x40034020) // (UDP) Interrupt Clear Register
#define AT91C_UDP_VER   ((AT91_REG *) 	0x400340FC) // (UDP) UDP VERSION REGISTER
#define AT91C_UDP_IER   ((AT91_REG *) 	0x40034010) // (UDP) Interrupt Enable Register
#define AT91C_UDP_FEATURES ((AT91_REG *) 	0x400340F8) // (UDP) UDP FEATURES REGISTER 
#define AT91C_UDP_IPNAME1 ((AT91_REG *) 	0x400340F0) // (UDP) UDP IPNAME1 REGISTER 
#define AT91C_UDP_GLBSTATE ((AT91_REG *) 	0x40034004) // (UDP) Global State Register
#define AT91C_UDP_ADDRSIZE ((AT91_REG *) 	0x400340EC) // (UDP) UDP ADDRSIZE REGISTER 
#define AT91C_UDP_NUM   ((AT91_REG *) 	0x40034000) // (UDP) Frame Number Register
#define AT91C_UDP_IDR   ((AT91_REG *) 	0x40034014) // (UDP) Interrupt Disable Register
#define AT91C_UDP_TXVC  ((AT91_REG *) 	0x40034074) // (UDP) Transceiver Control Register
#define AT91C_UDP_FADDR ((AT91_REG *) 	0x40034008) // (UDP) Function Address Register

