una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s4.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Watchdog Timer Controller Interface
// - *****************************************************************************
// - -------- WDTC_WDCR : (WDTC Offset: 0x0) Periodic Interval Image Register -------- 
AT91C_WDTC_WDRSTT         EQU (0x1 <<  0) ;- (WDTC) Watchdog Restart
AT91C_WDTC_KEY            EQU (0xFF << 24) ;- (WDTC) Watchdog KEY Password
// - -------- WDTC_WDMR : (WDTC Offset: 0x4) Watchdog Mode Register -------- 
AT91C_WDTC_WDV            EQU (0xFFF <<  0) ;- (WDTC) Watchdog Timer Restart
AT91C_WDTC_WDFIEN         EQU (0x1 << 12) ;- (WDTC) Watchdog Fault Interrupt Enable
AT91C_WDTC_WDRSTEN        EQU (0x1 << 13) ;- (WDTC) Watchdog Reset Enable
AT91C_WDTC_WDRPROC        EQU (0x1 << 14) ;- (WDTC) Watchdog Timer Restart
AT91C_WDTC_WDDIS          EQU (0x1 << 15) ;- (WDTC) Watchdog Disable
AT91C_WDTC_WDD            EQU (0xFFF << 16) ;- (WDTC) Watchdog Delta Value
AT91C_WDTC_WDDBGHLT       EQU (0x1 << 28) ;- (WDTC) Watchdog Debug Halt
AT91C_WDTC_WDIDLEHLT      EQU (0x1 << 29) ;- (WDTC) Watchdog Idle Halt
// - -------- WDTC_WDSR : (WDTC Offset: 0x8) Watchdog Status Register -------- 
AT91C_WDTC_WDUNF          EQU (0x1 <<  0) ;- (WDTC) Watchdog Underflow
AT91C_WDTC_WDERR          EQU (0x1 <<  1) ;- (WDTC) Watchdog Error

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Real-time Clock Alarm and Parallel Load Interface
// - *****************************************************************************
// - -------- RTC_CR : (RTC Offset: 0x0) RTC Control Register -------- 
AT91C_RTC_UPDTIM          EQU (0x1 <<  0) ;- (RTC) Update Request Time Register
AT91C_RTC_UPDCAL          EQU (0x1 <<  1) ;- (RTC) Update Request Calendar Register
AT91C_RTC_TIMEVSEL        EQU (0x3 <<  8) ;- (RTC) Time Event Selection
AT91C_RTC_TIMEVSEL_MINUTE EQU (0x0 <<  8) ;- (RTC) Minute change.
AT91C_RTC_TIMEVSEL_HOUR   EQU (0x1 <<  8) ;- (RTC) Hour change.
AT91C_RTC_TIMEVSEL_DAY24  EQU (0x2 <<  8) ;- (RTC) Every day at midnight.
AT91C_RTC_TIMEVSEL_DAY12  EQU (0x3 <<  8) ;- (RTC) Every day at noon.
AT91C_RTC_CALEVSEL        EQU (0x3 << 16) ;- (RTC) Calendar Event Selection
AT91C_RTC_CALEVSEL_WEEK   EQU (0x0 << 16) ;- (RTC) Week change (every Monday at time 00:00:00).
AT91C_RTC_CALEVSEL_MONTH  EQU (0x1 << 16) ;- (RTC) Month change (every 01 of each month at time 00:00:00).
AT91C_RTC_CALEVSEL_YEAR   EQU (0x2 << 16) ;- (RTC) Year change (every January 1 at time 00:00:00).
// - -------- RTC_MR : (RTC Offset: 0x4) RTC Mode Register -------- 
AT91C_RTC_HRMOD           EQU (0x1 <<  0) ;- (RTC) 12-24 hour Mode
// - -------- RTC_TIMR : (RTC Offset: 0x8) RTC Time Register -------- 
AT91C_RTC_SEC             EQU (0x7F <<  0) ;- (RTC) Current Second
AT91C_RTC_MIN             EQU (0x7F <<  8) ;- (RTC) Current Minute
AT91C_RTC_HOUR            EQU (0x3F << 16) ;- (RTC) Current Hour
AT91C_RTC_AMPM            EQU (0x1 << 22) ;- (RTC) Ante Meridiem, Post Meridiem Indicator
// - -------- RTC_CALR : (RTC Offset: 0xc) RTC Calendar Register -------- 
AT91C_RTC_CENT            EQU (0x3F <<  0) ;- (RTC) Current Century
AT91C_RTC_YEAR            EQU (0xFF <<  8) ;- (RTC) Current Year
AT91C_RTC_MONTH           EQU (0x1F << 16) ;- (RTC) Current Month
AT91C_RTC_DAY             EQU (0x7 << 21) ;- (RTC) Current Day
AT91C_RTC_DATE            EQU (0x3F << 24) ;- (RTC) Current Date
// - -------- RTC_TIMALR : (RTC Offset: 0x10) RTC Time Alarm Register -------- 
AT91C_RTC_SECEN           EQU (0x1 <<  7) ;- (RTC) Second Alarm Enable
AT91C_RTC_MINEN           EQU (0x1 << 15) ;- (RTC) Minute Alarm
AT91C_RTC_HOUREN          EQU (0x1 << 23) ;- (RTC) Current Hour
// - -------- RTC_CALALR : (RTC Offset: 0x14) RTC Calendar Alarm Register -------- 
AT91C_RTC_MONTHEN         EQU (0x1 << 23) ;- (RTC) Month Alarm Enable
AT91C_RTC_DATEEN          EQU (0x1 << 31) ;- (RTC) Date Alarm Enable
// - -------- RTC_SR : (RTC Offset: 0x18) RTC Status Register -------- 
AT91C_RTC_ACKUPD          EQU (0x1 <<  0) ;- (RTC) Acknowledge for Update
AT91C_RTC_ALARM           EQU (0x1 <<  1) ;- (RTC) Alarm Flag
AT91C_RTC_SECEV           EQU (0x1 <<  2) ;- (RTC) Second Event
AT91C_RTC_TIMEV           EQU (0x1 <<  3) ;- (RTC) Time Event
AT91C_RTC_CALEV           EQU (0x1 <<  4) ;- (RTC) Calendar event
// - -------- RTC_SCCR : (RTC Offset: 0x1c) RTC Status Clear Command Register -------- 
// - -------- RTC_IER : (RTC Offset: 0x20) RTC Interrupt Enable Register -------- 
// - -------- RTC_IDR : (RTC Offset: 0x24) RTC Interrupt Disable Register -------- 
// - -------- RTC_IMR : (RTC Offset: 0x28) RTC Interrupt Mask Register -------- 
// - -------- RTC_VER : (RTC Offset: 0x2c) RTC Valid Entry Register -------- 
AT91C_RTC_NVTIM           EQU (0x1 <<  0) ;- (RTC) Non valid Time
AT91C_RTC_NVCAL           EQU (0x1 <<  1) ;- (RTC) Non valid Calendar
AT91C_RTC_NVTIMALR        EQU (0x1 <<  2) ;- (RTC) Non valid time Alarm
AT91C_RTC_NVCALALR        EQU (0x1 <<  3) ;- (RTC) Nonvalid Calendar Alarm

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Analog to Digital Convertor
// - *****************************************************************************
// - -------- ADC_CR : (ADC Offset: 0x0) ADC Control Register -------- 
AT91C_ADC_SWRST           EQU (0x1 <<  0) ;- (ADC) Software Reset
AT91C_ADC_START           EQU (0x1 <<  1) ;- (ADC) Start Conversion
// - -------- ADC_MR : (ADC Offset: 0x4) ADC Mode Register -------- 
AT91C_ADC_TRGEN           EQU (0x1 <<  0) ;- (ADC) Trigger Enable
AT91C_ADC_TRGEN_DIS       EQU (0x0) ;- (ADC) Hradware triggers are disabled. Starting a conversion is only possible by software
AT91C_ADC_TRGEN_EN        EQU (0x1) ;- (ADC) Hardware trigger selected by TRGSEL field is enabled.
AT91C_ADC_TRGSEL          EQU (0x7 <<  1) ;- (ADC) Trigger Selection
AT91C_ADC_TRGSEL_EXT      EQU (0x0 <<  1) ;- (ADC) Selected TRGSEL = External Trigger
AT91C_ADC_TRGSEL_TIOA0    EQU (0x1 <<  1) ;- (ADC) Selected TRGSEL = TIAO0
AT91C_ADC_TRGSEL_TIOA1    EQU (0x2 <<  1) ;- (ADC) Selected TRGSEL = TIAO1
AT91C_ADC_TRGSEL_TIOA2    EQU (0x3 <<  1) ;- (ADC) Selected TRGSEL = TIAO2
AT91C_ADC_TRGSEL_PWM0_TRIG EQU (0x4 <<  1) ;- (ADC) Selected TRGSEL = PWM trigger
AT91C_ADC_TRGSEL_PWM1_TRIG EQU (0x5 <<  1) ;- (ADC) Selected TRGSEL = PWM Trigger
AT91C_ADC_TRGSEL_RESERVED EQU (0x6 <<  1) ;- (ADC) Selected TRGSEL = Reserved
AT91C_ADC_LOWRES          EQU (0x1 <<  4) ;- (ADC) Resolution.
AT91C_ADC_LOWRES_10_BIT   EQU (0x0 <<  4) ;- (ADC) 10-bit resolution
AT91C_ADC_LOWRES_8_BIT    EQU (0x1 <<  4) ;- (ADC) 8-bit resolution
AT91C_ADC_SLEEP           EQU (0x1 <<  5) ;- (ADC) Sleep Mode
AT91C_ADC_SLEEP_NORMAL_MODE EQU (0x0 <<  5) ;- (ADC) Normal Mode
AT91C_ADC_SLEEP_MODE      EQU (0x1 <<  5) ;- (ADC) Sleep Mode
AT91C_ADC_PRESCAL         EQU (0x3F <<  8) ;- (ADC) Prescaler rate selection
AT91C_ADC_STARTUP         EQU (0x1F << 16) ;- (ADC) Startup Time
AT91C_ADC_SHTIM           EQU (0xF << 24) ;- (ADC) Sample & Hold Time
// - -------- 	ADC_CHER : (ADC Offset: 0x10) ADC Channel Enable Register -------- 
AT91C_ADC_CH0             EQU (0x1 <<  0) ;- (ADC) Channel 0
AT91C_ADC_CH1             EQU (0x1 <<  1) ;- (ADC) Channel 1
AT91C_ADC_CH2             EQU (0x1 <<  2) ;- (ADC) Channel 2
AT91C_ADC_CH3             EQU (0x1 <<  3) ;- (ADC) Channel 3
AT91C_ADC_CH4             EQU (0x1 <<  4) ;- (ADC) Channel 4
AT91C_ADC_CH5             EQU (0x1 <<  5) ;- (ADC) Channel 5
AT91C_ADC_CH6             EQU (0x1 <<  6) ;- (ADC) Channel 6
AT91C_ADC_CH7             EQU (0x1 <<  7) ;- (ADC) Channel 7
AT91C_ADC_CH8             EQU (0x1 <<  8) ;- (ADC) Channel 8
AT91C_ADC_CH9             EQU (0x1 <<  9) ;- (ADC) Channel 9
AT91C_ADC_CH10            EQU (0x1 << 10) ;- (ADC) Channel 10
AT91C_ADC_CH11            EQU (0x1 << 11) ;- (ADC) Channel 11
AT91C_ADC_CH12            EQU (0x1 << 12) ;- (ADC) Channel 12
AT91C_ADC_CH13            EQU (0x1 << 13) ;- (ADC) Channel 13
AT91C_ADC_CH14            EQU (0x1 << 14) ;- (ADC) Channel 14
AT91C_ADC_CH15            EQU (0x1 << 15) ;- (ADC) Channel 15
// - -------- 	ADC_CHDR : (ADC Offset: 0x14) ADC Channel Disable Register -------- 
// - -------- 	ADC_CHSR : (ADC Offset: 0x18) ADC Channel Status Register -------- 
// - -------- ADC_LCDR : (ADC Offset: 0x20) ADC Last Converted Data Register -------- 
AT91C_ADC_LDATA           EQU (0x3FF <<  0) ;- (ADC) Last Data Converted
// - -------- ADC_IER : (ADC Offset: 0x24) ADC Interrupt Enable Register -------- 
AT91C_ADC_EOC0            EQU (0x1 <<  0) ;- (ADC) End of Conversion
AT91C_ADC_EOC1            EQU (0x1 <<  1) ;- (ADC) End of Conversion
AT91C_ADC_EOC2            EQU (0x1 <<  2) ;- (ADC) End of Conversion
AT91C_ADC_EOC3            EQU (0x1 <<  3) ;- (ADC) End of Conversion
AT91C_ADC_EOC4            EQU (0x1 <<  4) ;- (ADC) End of Conversion
AT91C_ADC_EOC5            EQU (0x1 <<  5) ;- (ADC) End of Conversion
AT91C_ADC_EOC6            EQU (0x1 <<  6) ;- (ADC) End of Conversion
AT91C_ADC_EOC7            EQU (0x1 <<  7) ;- (ADC) End of Conversion
AT91C_ADC_EOC8            EQU (0x1 <<  8) ;- (ADC) End of Conversion
AT91C_ADC_EOC9            EQU (0x1 <<  9) ;- (ADC) End of Conversion
AT91C_ADC_EOC10           EQU (0x1 << 10) ;- (ADC) End of Conversion
AT91C_ADC_EOC11           EQU (0x1 << 11) ;- (ADC) End of Conversion
AT91C_ADC_EOC12           EQU (0x1 << 12) ;- (ADC) End of Conversion
AT91C_ADC_EOC13           EQU (0x1 << 13) ;- (ADC) End of Conversion
AT91C_ADC_EOC14           EQU (0x1 << 14) ;- (ADC) End of Conversion
AT91C_ADC_EOC15           EQU (0x1 << 15) ;- (ADC) End of Conversion
AT91C_ADC_DRDY            EQU (0x1 << 24) ;- (ADC) Data Ready
AT91C_ADC_GOVRE           EQU (0x1 << 25) ;- (ADC) General Overrun
AT91C_ADC_ENDRX           EQU (0x1 << 27) ;- (ADC) End of Receiver Transfer
AT91C_ADC_RXBUFF          EQU (0x1 << 28) ;- (ADC) RXBUFF Interrupt
// - -------- ADC_IDR : (ADC Offset: 0x28) ADC Interrupt Disable Register -------- 
// - -------- ADC_IMR : (ADC Offset: 0x2c) ADC Interrupt Mask Register -------- 
// - -------- ADC_SR : (ADC Offset: 0x30) ADC Status Register -------- 
// - -------- ADC_OVR : (ADC Offset: 0x3c)  -------- 
AT91C_ADC_OVRE2           EQU (0x1 << 10) ;- (ADC) Overrun Error
AT91C_ADC_OVRE3           EQU (0x1 << 11) ;- (ADC) Overrun Error
AT91C_ADC_OVRE4           EQU (0x1 << 12) ;- (ADC) Overrun Error
AT91C_ADC_OVRE5           EQU (0x1 << 13) ;- (ADC) Overrun Error
// - -------- ADC_CWR : (ADC Offset: 0x40)  -------- 
// - -------- ADC_CWSR : (ADC Offset: 0x44)  -------- 
// - -------- ADC_CGR : (ADC Offset: 0x48)  -------- 
// - -------- ADC_COR : (ADC Offset: 0x4c)  -------- 
// - -------- ADC_CDR0 : (ADC Offset: 0x50) ADC Channel Data Register 0 -------- 
AT91C_ADC_DATA            EQU (0x3FF <<  0) ;- (ADC) Converted Data
// - -------- ADC_CDR1 : (ADC Offset: 0x54) ADC Channel Data Register 1 -------- 
// - -------- ADC_CDR2 : (ADC Offset: 0x58) ADC Channel Data Register 2 -------- 
// - -------- ADC_CDR3 : (ADC Offset: 0x5c) ADC Channel Data Register 3 -------- 
// - -------- ADC_CDR4 : (ADC Offset: 0x60) ADC Channel Data Register 4 -------- 
// - -------- ADC_CDR5 : (ADC Offset: 0x64) ADC Channel Data Register 5 -------- 
// - -------- ADC_CDR6 : (ADC Offset: 0x68) ADC Channel Data Register 6 -------- 
// - -------- ADC_CDR7 : (ADC Offset: 0x6c) ADC Channel Data Register 7 -------- 
// - -------- ADC_CDR8 : (ADC Offset: 0x70) ADC Channel Data Register 8 -------- 
// - -------- ADC_CDR9 : (ADC Offset: 0x74) ADC Channel Data Register 9 -------- 
// - -------- ADC_CDR10 : (ADC Offset: 0x78) ADC Channel Data Register 10 -------- 
// - -------- ADC_CDR11 : (ADC Offset: 0x7c) ADC Channel Data Register 11 -------- 
// - -------- ADC_CDR12 : (ADC Offset: 0x80) ADC Channel Data Register 12 -------- 
// - -------- ADC_CDR13 : (ADC Offset: 0x84) ADC Channel Data Register 13 -------- 
// - -------- ADC_CDR14 : (ADC Offset: 0x88) ADC Channel Data Register 14 -------- 
// - -------- ADC_CDR15 : (ADC Offset: 0x8c) ADC Channel Data Register 15 -------- 
// - -------- ADC_VER : (ADC Offset: 0xfc) ADC VER -------- 
AT91C_ADC_VER             EQU (0xF <<  0) ;- (ADC) ADC VER

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Digital to Analog Convertor
// - *****************************************************************************
// - -------- DAC_CR : (DAC Offset: 0x0) Control Register -------- 
AT91C_DAC_SWRST           EQU (0x1 <<  0) ;- (DAC) Software Reset
// - -------- DAC_MR : (DAC Offset: 0x4) Mode Register -------- 
AT91C_DAC_TRGEN           EQU (0x1 <<  0) ;- (DAC) Trigger Enable
AT91C_DAC_TRGSEL          EQU (0x7 <<  1) ;- (DAC) Trigger Selection
AT91C_DAC_TRGSEL_EXTRG0   EQU (0x0 <<  1) ;- (DAC) External Trigger 0
AT91C_DAC_TRGSEL_EXTRG1   EQU (0x1 <<  1) ;- (DAC) External Trigger 1
AT91C_DAC_TRGSEL_EXTRG2   EQU (0x2 <<  1) ;- (DAC) External Trigger 2
AT91C_DAC_TRGSEL_EXTRG3   EQU (0x3 <<  1) ;- (DAC) External Trigger 3
AT91C_DAC_TRGSEL_EXTRG4   EQU (0x4 <<  1) ;- (DAC) External Trigger 4
AT91C_DAC_TRGSEL_EXTRG5   EQU (0x5 <<  1) ;- (DAC) External Trigger 5
AT91C_DAC_TRGSEL_EXTRG6   EQU (0x6 <<  1) ;- (DAC) External Trigger 6
AT91C_DAC_WORD            EQU (0x1 <<  4) ;- (DAC) Word Transfer
AT91C_DAC_SLEEP           EQU (0x1 <<  5) ;- (DAC) Sleep Mode
AT91C_DAC_FASTW           EQU (0x1 <<  6) ;- (DAC) Fast Wake up Mode
AT91C_DAC_REFRESH         EQU (0xFF <<  8) ;- (DAC) Refresh period
AT91C_DAC_USER_SEL        EQU (0x3 << 16) ;- (DAC) User Channel Selection
AT91C_DAC_USER_SEL_CH0    EQU (0x0 << 16) ;- (DAC) Channel 0
AT91C_DAC_USER_SEL_CH1    EQU (0x1 << 16) ;- (DAC) Channel 1
AT91C_DAC_USER_SEL_CH2    EQU (0x2 << 16) ;- (DAC) Channel 2
AT91C_DAC_TAG             EQU (0x1 << 20) ;- (DAC) Tag selection mode
AT91C_DAC_MAXSPEED        EQU (0x1 << 21) ;- (DAC) Max speed mode
AT91C_DAC_STARTUP         EQU (0x3F << 24) ;- (DAC) Startup Time Selection
// - -------- DAC_CHER : (DAC Offset: 0x10) Channel Enable Register -------- 
AT91C_DAC_CH0             EQU (0x1 <<  0) ;- (DAC) Channel 0
AT91C_DAC_CH1             EQU (0x1 <<  1) ;- (DAC) Channel 1
AT91C_DAC_CH2             EQU (0x1 <<  2) ;- (DAC) Channel 2
// - -------- DAC_CHDR : (DAC Offset: 0x14) Channel Disable Register -------- 
// - -------- DAC_CHSR : (DAC Offset: 0x18) Channel Status Register -------- 
// - -------- DAC_CDR : (DAC Offset: 0x20) Conversion Data Register -------- 
AT91C_DAC_DATA            EQU (0x0 <<  0) ;- (DAC) Data to convert
// - -------- DAC_IER : (DAC Offset: 0x24) DAC Interrupt Enable -------- 
AT91C_DAC_TXRDY           EQU (0x1 <<  0) ;- (DAC) Transmission Ready Interrupt
AT91C_DAC_EOC             EQU (0x1 <<  1) ;- (DAC) End of Conversion Interrupt
AT91C_DAC_TXDMAEND        EQU (0x1 <<  2) ;- (DAC) End of DMA Interrupt
AT91C_DAC_TXBUFEMPT       EQU (0x1 <<  3) ;- (DAC) Buffer Empty Interrupt
// - -------- DAC_IDR : (DAC Offset: 0x28) DAC Interrupt Disable -------- 
// - -------- DAC_IMR : (DAC Offset: 0x2c) DAC Interrupt Mask -------- 
// - -------- DAC_ISR : (DAC Offset: 0x30) DAC Interrupt Status -------- 
// - -------- DAC_ACR : (DAC Offset: 0x94) Analog Current Register -------- 
AT91C_DAC_IBCTL           EQU (0x1FF <<  0) ;- (DAC) Bias current control
// - -------- DAC_WPMR : (DAC Offset: 0xe4) Write Protect Mode Register -------- 
AT91C_DAC_WPEN            EQU (0x1 <<  0) ;- (DAC) Write Protect Enable
AT91C_DAC_WPKEY           EQU (0xFFFFFF <<  8) ;- (DAC) Write Protect KEY
// - -------- DAC_WPSR : (DAC Offset: 0xe8) Write Protect Status Register -------- 
AT91C_DAC_WPROTERR        EQU (0x1 <<  0) ;- (DAC) Write protection error
AT91C_DAC_WPROTADDR       EQU (0xFF <<  8) ;- (DAC) Write protection error address

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Digital to Analog Convertor
// - *****************************************************************************
// - -------- ACC_IER : (ACC Offset: 0x24) Data Ready for Conversion Interrupt Enable -------- 
AT91C_ACC_DATRDY          EQU (0x1 <<  0) ;- (ACC) Data Ready for Conversion
// - -------- ACC_IDR : (ACC Offset: 0x28) Data Ready for Conversion Interrupt Disable -------- 
// - -------- ACC_IMR : (ACC Offset: 0x2c) Data Ready for Conversion Interrupt Mask -------- 
// - -------- ACC_ISR : (ACC Offset: 0x30) Status Register -------- 
// - -------- ACC_VER : (ACC Offset: 0xfc) ACC VER -------- 
AT91C_ACC_VER             EQU (0xF <<  0) ;- (ACC) ACC VER

