una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s4.h
// - *****************************************************************************
// -               REGISTER ADDRESS DEFINITION FOR AT91SAM3S4
// - *****************************************************************************
// - ========== Register definition for SYS peripheral ========== 
AT91C_SYS_GPBR            EQU (0x400E1490) ;- (SYS) General Purpose Register
// - ========== Register definition for SMC peripheral ========== 
AT91C_SMC_DELAY2          EQU (0x400E00C4) ;- (SMC) SMC Delay Control Register
AT91C_SMC_CYCLE4          EQU (0x400E0048) ;- (SMC)  Cycle Register for CS 4
AT91C_SMC_CTRL5           EQU (0x400E005C) ;- (SMC)  Control Register for CS 5
AT91C_SMC_IPNAME2         EQU (0x400E00F4) ;- (SMC) HSMC3 IPNAME2 REGISTER 
AT91C_SMC_DELAY5          EQU (0x400E00D0) ;- (SMC) SMC Delay Control Register
AT91C_SMC_DELAY4          EQU (0x400E00CC) ;- (SMC) SMC Delay Control Register
AT91C_SMC_CYCLE0          EQU (0x400E0008) ;- (SMC)  Cycle Register for CS 0
AT91C_SMC_PULSE1          EQU (0x400E0014) ;- (SMC)  Pulse Register for CS 1
AT91C_SMC_DELAY6          EQU (0x400E00D4) ;- (SMC) SMC Delay Control Register
AT91C_SMC_FEATURES        EQU (0x400E00F8) ;- (SMC) HSMC3 FEATURES REGISTER 
AT91C_SMC_DELAY3          EQU (0x400E00C8) ;- (SMC) SMC Delay Control Register
AT91C_SMC_CTRL1           EQU (0x400E001C) ;- (SMC)  Control Register for CS 1
AT91C_SMC_PULSE7          EQU (0x400E0074) ;- (SMC)  Pulse Register for CS 7
AT91C_SMC_CTRL7           EQU (0x400E007C) ;- (SMC)  Control Register for CS 7
AT91C_SMC_VER             EQU (0x400E00FC) ;- (SMC) HSMC3 VERSION REGISTER
AT91C_SMC_SETUP5          EQU (0x400E0050) ;- (SMC)  Setup Register for CS 5
AT91C_SMC_CYCLE3          EQU (0x400E0038) ;- (SMC)  Cycle Register for CS 3
AT91C_SMC_SETUP3          EQU (0x400E0030) ;- (SMC)  Setup Register for CS 3
AT91C_SMC_DELAY1          EQU (0x400E00C0) ;- (SMC) SMC Delay Control Register
AT91C_SMC_ADDRSIZE        EQU (0x400E00EC) ;- (SMC) HSMC3 ADDRSIZE REGISTER 
AT91C_SMC_PULSE3          EQU (0x400E0034) ;- (SMC)  Pulse Register for CS 3
AT91C_SMC_PULSE5          EQU (0x400E0054) ;- (SMC)  Pulse Register for CS 5
AT91C_SMC_PULSE4          EQU (0x400E0044) ;- (SMC)  Pulse Register for CS 4
AT91C_SMC_SETUP2          EQU (0x400E0020) ;- (SMC)  Setup Register for CS 2
AT91C_SMC_DELAY8          EQU (0x400E00DC) ;- (SMC) SMC Delay Control Register
AT91C_SMC_CYCLE7          EQU (0x400E0078) ;- (SMC)  Cycle Register for CS 7
AT91C_SMC_CTRL0           EQU (0x400E000C) ;- (SMC)  Control Register for CS 0
AT91C_SMC_CYCLE2          EQU (0x400E0028) ;- (SMC)  Cycle Register for CS 2
AT91C_SMC_IPNAME1         EQU (0x400E00F0) ;- (SMC) HSMC3 IPNAME1 REGISTER 
AT91C_SMC_SETUP1          EQU (0x400E0010) ;- (SMC)  Setup Register for CS 1
AT91C_SMC_CTRL2           EQU (0x400E002C) ;- (SMC)  Control Register for CS 2
AT91C_SMC_CTRL4           EQU (0x400E004C) ;- (SMC)  Control Register for CS 4
AT91C_SMC_SETUP6          EQU (0x400E0060) ;- (SMC)  Setup Register for CS 6
AT91C_SMC_CYCLE5          EQU (0x400E0058) ;- (SMC)  Cycle Register for CS 5
AT91C_SMC_CTRL6           EQU (0x400E006C) ;- (SMC)  Control Register for CS 6
AT91C_SMC_SETUP4          EQU (0x400E0040) ;- (SMC)  Setup Register for CS 4
AT91C_SMC_PULSE2          EQU (0x400E0024) ;- (SMC)  Pulse Register for CS 2
AT91C_SMC_DELAY7          EQU (0x400E00D8) ;- (SMC) SMC Delay Control Register
AT91C_SMC_SETUP7          EQU (0x400E0070) ;- (SMC)  Setup Register for CS 7
AT91C_SMC_CYCLE1          EQU (0x400E0018) ;- (SMC)  Cycle Register for CS 1
AT91C_SMC_CTRL3           EQU (0x400E003C) ;- (SMC)  Control Register for CS 3
AT91C_SMC_SETUP0          EQU (0x400E0000) ;- (SMC)  Setup Register for CS 0
AT91C_SMC_PULSE0          EQU (0x400E0004) ;- (SMC)  Pulse Register for CS 0
AT91C_SMC_PULSE6          EQU (0x400E0064) ;- (SMC)  Pulse Register for CS 6
AT91C_SMC_CYCLE6          EQU (0x400E0068) ;- (SMC)  Cycle Register for CS 6
// - ========== Register definition for MATRIX peripheral ========== 
AT91C_MATRIX_SFR2         EQU (0x400E0318) ;- (MATRIX)  Special Function Register 2
AT91C_MATRIX_SFR3         EQU (0x400E031C) ;- (MATRIX)  Special Function Register 3
AT91C_MATRIX_SCFG8        EQU (0x400E0260) ;- (MATRIX)  Slave Configuration Register 8
AT91C_MATRIX_MCFG2        EQU (0x400E0208) ;- (MATRIX)  Master Configuration Register 2
AT91C_MATRIX_MCFG7        EQU (0x400E021C) ;- (MATRIX)  Master Configuration Register 7
AT91C_MATRIX_SCFG3        EQU (0x400E024C) ;- (MATRIX)  Slave Configuration Register 3
AT91C_MATRIX_SCFG0        EQU (0x400E0240) ;- (MATRIX)  Slave Configuration Register 0
AT91C_MATRIX_SFR12        EQU (0x400E0340) ;- (MATRIX)  Special Function Register 12
AT91C_MATRIX_SCFG1        EQU (0x400E0244) ;- (MATRIX)  Slave Configuration Register 1
AT91C_MATRIX_SFR8         EQU (0x400E0330) ;- (MATRIX)  Special Function Register 8
AT91C_MATRIX_VER          EQU (0x400E03FC) ;- (MATRIX) HMATRIX2 VERSION REGISTER 
AT91C_MATRIX_SFR13        EQU (0x400E0344) ;- (MATRIX)  Special Function Register 13
AT91C_MATRIX_SFR5         EQU (0x400E0324) ;- (MATRIX)  Special Function Register 5
AT91C_MATRIX_MCFG0        EQU (0x400E0200) ;- (MATRIX)  Master Configuration Register 0 : ARM I and D
AT91C_MATRIX_SCFG6        EQU (0x400E0258) ;- (MATRIX)  Slave Configuration Register 6
AT91C_MATRIX_SFR14        EQU (0x400E0348) ;- (MATRIX)  Special Function Register 14
AT91C_MATRIX_SFR1         EQU (0x400E0314) ;- (MATRIX)  Special Function Register 1
AT91C_MATRIX_SFR15        EQU (0x400E034C) ;- (MATRIX)  Special Function Register 15
AT91C_MATRIX_SFR6         EQU (0x400E0328) ;- (MATRIX)  Special Function Register 6
AT91C_MATRIX_SFR11        EQU (0x400E033C) ;- (MATRIX)  Special Function Register 11
AT91C_MATRIX_IPNAME2      EQU (0x400E03F4) ;- (MATRIX) HMATRIX2 IPNAME2 REGISTER 
AT91C_MATRIX_ADDRSIZE     EQU (0x400E03EC) ;- (MATRIX) HMATRIX2 ADDRSIZE REGISTER 
AT91C_MATRIX_MCFG5        EQU (0x400E0214) ;- (MATRIX)  Master Configuration Register 5
AT91C_MATRIX_SFR9         EQU (0x400E0334) ;- (MATRIX)  Special Function Register 9
AT91C_MATRIX_MCFG3        EQU (0x400E020C) ;- (MATRIX)  Master Configuration Register 3
AT91C_MATRIX_SCFG4        EQU (0x400E0250) ;- (MATRIX)  Slave Configuration Register 4
AT91C_MATRIX_MCFG1        EQU (0x400E0204) ;- (MATRIX)  Master Configuration Register 1 : ARM S
AT91C_MATRIX_SCFG7        EQU (0x400E025C) ;- (MATRIX)  Slave Configuration Register 5
AT91C_MATRIX_SFR10        EQU (0x400E0338) ;- (MATRIX)  Special Function Register 10
AT91C_MATRIX_SCFG2        EQU (0x400E0248) ;- (MATRIX)  Slave Configuration Register 2
AT91C_MATRIX_SFR7         EQU (0x400E032C) ;- (MATRIX)  Special Function Register 7
AT91C_MATRIX_IPNAME1      EQU (0x400E03F0) ;- (MATRIX) HMATRIX2 IPNAME1 REGISTER 
AT91C_MATRIX_MCFG4        EQU (0x400E0210) ;- (MATRIX)  Master Configuration Register 4
AT91C_MATRIX_SFR0         EQU (0x400E0310) ;- (MATRIX)  Special Function Register 0
AT91C_MATRIX_FEATURES     EQU (0x400E03F8) ;- (MATRIX) HMATRIX2 FEATURES REGISTER 
AT91C_MATRIX_SCFG5        EQU (0x400E0254) ;- (MATRIX)  Slave Configuration Register 5
AT91C_MATRIX_MCFG6        EQU (0x400E0218) ;- (MATRIX)  Master Configuration Register 6
AT91C_MATRIX_SCFG9        EQU (0x400E0264) ;- (MATRIX)  Slave Configuration Register 9
AT91C_MATRIX_SFR4         EQU (0x400E0320) ;- (MATRIX)  Special Function Register 4
// - ========== Register definition for CCFG peripheral ========== 
AT91C_CCFG_FLASH0         EQU (0x400E0318) ;- (CCFG)  FLASH0 configuration
AT91C_CCFG_RAM0           EQU (0x400E0310) ;- (CCFG)  RAM0 configuration
AT91C_CCFG_ROM            EQU (0x400E0314) ;- (CCFG)  ROM  configuration
AT91C_CCFG_EBICSA         EQU (0x400E031C) ;- (CCFG)  EBI Chip Select Assignement Register
AT91C_CCFG_BRIDGE         EQU (0x400E0320) ;- (CCFG)  BRIDGE configuration
// - ========== Register definition for NVIC peripheral ========== 
AT91C_NVIC_MMAR           EQU (0xE000ED34) ;- (NVIC) Mem Manage Address Register
AT91C_NVIC_STIR           EQU (0xE000EF00) ;- (NVIC) Software Trigger Interrupt Register
AT91C_NVIC_MMFR2          EQU (0xE000ED58) ;- (NVIC) Memory Model Feature register2
AT91C_NVIC_CPUID          EQU (0xE000ED00) ;- (NVIC) CPUID Base Register
AT91C_NVIC_DFSR           EQU (0xE000ED30) ;- (NVIC) Debug Fault Status Register
AT91C_NVIC_HAND4PR        EQU (0xE000ED18) ;- (NVIC) System Handlers 4-7 Priority Register
AT91C_NVIC_HFSR           EQU (0xE000ED2C) ;- (NVIC) Hard Fault Status Register
AT91C_NVIC_PID6           EQU (0xE000EFD8) ;- (NVIC) Peripheral identification register
AT91C_NVIC_PFR0           EQU (0xE000ED40) ;- (NVIC) Processor Feature register0
AT91C_NVIC_VTOFFR         EQU (0xE000ED08) ;- (NVIC) Vector Table Offset Register
AT91C_NVIC_ISPR           EQU (0xE000E200) ;- (NVIC) Set Pending Register
AT91C_NVIC_PID0           EQU (0xE000EFE0) ;- (NVIC) Peripheral identification register b7:0
AT91C_NVIC_PID7           EQU (0xE000EFDC) ;- (NVIC) Peripheral identification register
AT91C_NVIC_STICKRVR       EQU (0xE000E014) ;- (NVIC) SysTick Reload Value Register
AT91C_NVIC_PID2           EQU (0xE000EFE8) ;- (NVIC) Peripheral identification register b23:16
AT91C_NVIC_ISAR0          EQU (0xE000ED60) ;- (NVIC) ISA Feature register0
AT91C_NVIC_SCR            EQU (0xE000ED10) ;- (NVIC) System Control Register
AT91C_NVIC_PID4           EQU (0xE000EFD0) ;- (NVIC) Peripheral identification register
AT91C_NVIC_ISAR2          EQU (0xE000ED68) ;- (NVIC) ISA Feature register2
AT91C_NVIC_ISER           EQU (0xE000E100) ;- (NVIC) Set Enable Register
AT91C_NVIC_IPR            EQU (0xE000E400) ;- (NVIC) Interrupt Mask Register
AT91C_NVIC_AIRCR          EQU (0xE000ED0C) ;- (NVIC) Application Interrupt/Reset Control Reg
AT91C_NVIC_CID2           EQU (0xE000EFF8) ;- (NVIC) Component identification register b23:16
AT91C_NVIC_ICPR           EQU (0xE000E280) ;- (NVIC) Clear Pending Register
AT91C_NVIC_CID3           EQU (0xE000EFFC) ;- (NVIC) Component identification register b31:24
AT91C_NVIC_CFSR           EQU (0xE000ED28) ;- (NVIC) Configurable Fault Status Register
AT91C_NVIC_AFR0           EQU (0xE000ED4C) ;- (NVIC) Auxiliary Feature register0
AT91C_NVIC_ICSR           EQU (0xE000ED04) ;- (NVIC) Interrupt Control State Register
AT91C_NVIC_CCR            EQU (0xE000ED14) ;- (NVIC) Configuration Control Register
AT91C_NVIC_CID0           EQU (0xE000EFF0) ;- (NVIC) Component identification register b7:0
AT91C_NVIC_ISAR1          EQU (0xE000ED64) ;- (NVIC) ISA Feature register1
AT91C_NVIC_STICKCVR       EQU (0xE000E018) ;- (NVIC) SysTick Current Value Register
AT91C_NVIC_STICKCSR       EQU (0xE000E010) ;- (NVIC) SysTick Control and Status Register
AT91C_NVIC_CID1           EQU (0xE000EFF4) ;- (NVIC) Component identification register b15:8
AT91C_NVIC_DFR0           EQU (0xE000ED48) ;- (NVIC) Debug Feature register0
AT91C_NVIC_MMFR3          EQU (0xE000ED5C) ;- (NVIC) Memory Model Feature register3
AT91C_NVIC_MMFR0          EQU (0xE000ED50) ;- (NVIC) Memory Model Feature register0
AT91C_NVIC_STICKCALVR     EQU (0xE000E01C) ;- (NVIC) SysTick Calibration Value Register
AT91C_NVIC_PID1           EQU (0xE000EFE4) ;- (NVIC) Peripheral identification register b15:8
AT91C_NVIC_HAND12PR       EQU (0xE000ED20) ;- (NVIC) System Handlers 12-15 Priority Register
AT91C_NVIC_MMFR1          EQU (0xE000ED54) ;- (NVIC) Memory Model Feature register1
AT91C_NVIC_AFSR           EQU (0xE000ED3C) ;- (NVIC) Auxiliary Fault Status Register
AT91C_NVIC_HANDCSR        EQU (0xE000ED24) ;- (NVIC) System Handler Control and State Register
AT91C_NVIC_ISAR4          EQU (0xE000ED70) ;- (NVIC) ISA Feature register4
AT91C_NVIC_ABR            EQU (0xE000E300) ;- (NVIC) Active Bit Register
AT91C_NVIC_PFR1           EQU (0xE000ED44) ;- (NVIC) Processor Feature register1
AT91C_NVIC_PID5           EQU (0xE000EFD4) ;- (NVIC) Peripheral identification register
AT91C_NVIC_ICTR           EQU (0xE000E004) ;- (NVIC) Interrupt Control Type Register
AT91C_NVIC_ICER           EQU (0xE000E180) ;- (NVIC) Clear enable Register
AT91C_NVIC_PID3           EQU (0xE000EFEC) ;- (NVIC) Peripheral identification register b31:24
AT91C_NVIC_ISAR3          EQU (0xE000ED6C) ;- (NVIC) ISA Feature register3
AT91C_NVIC_HAND8PR        EQU (0xE000ED1C) ;- (NVIC) System Handlers 8-11 Priority Register
AT91C_NVIC_BFAR           EQU (0xE000ED38) ;- (NVIC) Bus Fault Address Register
// - ========== Register definition for MPU peripheral ========== 
AT91C_MPU_REG_BASE_ADDR3  EQU (0xE000EDB4) ;- (MPU) MPU Region Base Address Register alias 3
AT91C_MPU_REG_NB          EQU (0xE000ED98) ;- (MPU) MPU Region Number Register
AT91C_MPU_ATTR_SIZE1      EQU (0xE000EDA8) ;- (MPU) MPU  Attribute and Size Register alias 1
AT91C_MPU_REG_BASE_ADDR1  EQU (0xE000EDA4) ;- (MPU) MPU Region Base Address Register alias 1
AT91C_MPU_ATTR_SIZE3      EQU (0xE000EDB8) ;- (MPU) MPU  Attribute and Size Register alias 3
AT91C_MPU_CTRL            EQU (0xE000ED94) ;- (MPU) MPU Control Register
AT91C_MPU_ATTR_SIZE2      EQU (0xE000EDB0) ;- (MPU) MPU  Attribute and Size Register alias 2
AT91C_MPU_REG_BASE_ADDR   EQU (0xE000ED9C) ;- (MPU) MPU Region Base Address Register
AT91C_MPU_REG_BASE_ADDR2  EQU (0xE000EDAC) ;- (MPU) MPU Region Base Address Register alias 2
AT91C_MPU_ATTR_SIZE       EQU (0xE000EDA0) ;- (MPU) MPU  Attribute and Size Register
AT91C_MPU_TYPE            EQU (0xE000ED90) ;- (MPU) MPU Type Register
// - ========== Register definition for CM3 peripheral ========== 
AT91C_CM3_SHCSR           EQU (0xE000ED24) ;- (CM3) System Handler Control and State Register
AT91C_CM3_CCR             EQU (0xE000ED14) ;- (CM3) Configuration Control Register
AT91C_CM3_ICSR            EQU (0xE000ED04) ;- (CM3) Interrupt Control State Register
AT91C_CM3_CPUID           EQU (0xE000ED00) ;- (CM3) CPU ID Base Register
AT91C_CM3_SCR             EQU (0xE000ED10) ;- (CM3) System Controller Register
AT91C_CM3_AIRCR           EQU (0xE000ED0C) ;- (CM3) Application Interrupt and Reset Control Register
AT91C_CM3_SHPR            EQU (0xE000ED18) ;- (CM3) System Handler Priority Register
AT91C_CM3_VTOR            EQU (0xE000ED08) ;- (CM3) Vector Table Offset Register
// - ========== Register definition for PDC_DBGU0 peripheral ========== 
AT91C_DBGU0_TPR           EQU (0x400E0708) ;- (PDC_DBGU0) Transmit Pointer Register
AT91C_DBGU0_PTCR          EQU (0x400E0720) ;- (PDC_DBGU0) PDC Transfer Control Register
AT91C_DBGU0_TNCR          EQU (0x400E071C) ;- (PDC_DBGU0) Transmit Next Counter Register
AT91C_DBGU0_PTSR          EQU (0x400E0724) ;- (PDC_DBGU0) PDC Transfer Status Register
AT91C_DBGU0_RNCR          EQU (0x400E0714) ;- (PDC_DBGU0) Receive Next Counter Register
AT91C_DBGU0_RPR           EQU (0x400E0700) ;- (PDC_DBGU0) Receive Pointer Register
AT91C_DBGU0_TCR           EQU (0x400E070C) ;- (PDC_DBGU0) Transmit Counter Register
AT91C_DBGU0_RNPR          EQU (0x400E0710) ;- (PDC_DBGU0) Receive Next Pointer Register
AT91C_DBGU0_TNPR          EQU (0x400E0718) ;- (PDC_DBGU0) Transmit Next Pointer Register
AT91C_DBGU0_RCR           EQU (0x400E0704) ;- (PDC_DBGU0) Receive Counter Register
// - ========== Register definition for DBGU0 peripheral ========== 
AT91C_DBGU0_CR            EQU (0x400E0600) ;- (DBGU0) Control Register
AT91C_DBGU0_IDR           EQU (0x400E060C) ;- (DBGU0) Interrupt Disable Register
AT91C_DBGU0_CIDR          EQU (0x400E0740) ;- (DBGU0) Chip ID Register
AT91C_DBGU0_IPNAME2       EQU (0x400E06F4) ;- (DBGU0) DBGU IPNAME2 REGISTER 
AT91C_DBGU0_FEATURES      EQU (0x400E06F8) ;- (DBGU0) DBGU FEATURES REGISTER 
AT91C_DBGU0_FNTR          EQU (0x400E0648) ;- (DBGU0) Force NTRST Register
AT91C_DBGU0_RHR           EQU (0x400E0618) ;- (DBGU0) Receiver Holding Register
AT91C_DBGU0_THR           EQU (0x400E061C) ;- (DBGU0) Transmitter Holding Register
AT91C_DBGU0_ADDRSIZE      EQU (0x400E06EC) ;- (DBGU0) DBGU ADDRSIZE REGISTER 
AT91C_DBGU0_MR            EQU (0x400E0604) ;- (DBGU0) Mode Register
AT91C_DBGU0_IER           EQU (0x400E0608) ;- (DBGU0) Interrupt Enable Register
AT91C_DBGU0_BRGR          EQU (0x400E0620) ;- (DBGU0) Baud Rate Generator Register
AT91C_DBGU0_CSR           EQU (0x400E0614) ;- (DBGU0) Channel Status Register
AT91C_DBGU0_VER           EQU (0x400E06FC) ;- (DBGU0) DBGU VERSION REGISTER 
AT91C_DBGU0_IMR           EQU (0x400E0610) ;- (DBGU0) Interrupt Mask Register
AT91C_DBGU0_IPNAME1       EQU (0x400E06F0) ;- (DBGU0) DBGU IPNAME1 REGISTER 
AT91C_DBGU0_EXID          EQU (0x400E0744) ;- (DBGU0) Chip ID Extension Register
// - ========== Register definition for PDC_DBGU1 peripheral ========== 
AT91C_DBGU1_RNCR          EQU (0x400E0914) ;- (PDC_DBGU1) Receive Next Counter Register
AT91C_DBGU1_RPR           EQU (0x400E0900) ;- (PDC_DBGU1) Receive Pointer Register
AT91C_DBGU1_TNCR          EQU (0x400E091C) ;- (PDC_DBGU1) Transmit Next Counter Register
AT91C_DBGU1_TNPR          EQU (0x400E0918) ;- (PDC_DBGU1) Transmit Next Pointer Register
AT91C_DBGU1_PTSR          EQU (0x400E0924) ;- (PDC_DBGU1) PDC Transfer Status Register
AT91C_DBGU1_PTCR          EQU (0x400E0920) ;- (PDC_DBGU1) PDC Transfer Control Register
AT91C_DBGU1_RCR           EQU (0x400E0904) ;- (PDC_DBGU1) Receive Counter Register
AT91C_DBGU1_RNPR          EQU (0x400E0910) ;- (PDC_DBGU1) Receive Next Pointer Register
AT91C_DBGU1_TPR           EQU (0x400E0908) ;- (PDC_DBGU1) Transmit Pointer Register
AT91C_DBGU1_TCR           EQU (0x400E090C) ;- (PDC_DBGU1) Transmit Counter Register
// - ========== Register definition for DBGU1 peripheral ========== 
AT91C_DBGU1_RHR           EQU (0x400E0818) ;- (DBGU1) Receiver Holding Register
AT91C_DBGU1_IPNAME1       EQU (0x400E08F0) ;- (DBGU1) DBGU IPNAME1 REGISTER 
AT91C_DBGU1_CIDR          EQU (0x400E0940) ;- (DBGU1) Chip ID Register
AT91C_DBGU1_CR            EQU (0x400E0800) ;- (DBGU1) Control Register
AT91C_DBGU1_VER           EQU (0x400E08FC) ;- (DBGU1) DBGU VERSION REGISTER 
AT91C_DBGU1_IPNAME2       EQU (0x400E08F4) ;- (DBGU1) DBGU IPNAME2 REGISTER 
AT91C_DBGU1_BRGR          EQU (0x400E0820) ;- (DBGU1) Baud Rate Generator Register
AT91C_DBGU1_FNTR          EQU (0x400E0848) ;- (DBGU1) Force NTRST Register
AT91C_DBGU1_MR            EQU (0x400E0804) ;- (DBGU1) Mode Register
AT91C_DBGU1_ADDRSIZE      EQU (0x400E08EC) ;- (DBGU1) DBGU ADDRSIZE REGISTER 
AT91C_DBGU1_CSR           EQU (0x400E0814) ;- (DBGU1) Channel Status Register
AT91C_DBGU1_IMR           EQU (0x400E0810) ;- (DBGU1) Interrupt Mask Register
AT91C_DBGU1_EXID          EQU (0x400E0944) ;- (DBGU1) Chip ID Extension Register
AT91C_DBGU1_IDR           EQU (0x400E080C) ;- (DBGU1) Interrupt Disable Register
AT91C_DBGU1_FEATURES      EQU (0x400E08F8) ;- (DBGU1) DBGU FEATURES REGISTER 
AT91C_DBGU1_IER           EQU (0x400E0808) ;- (DBGU1) Interrupt Enable Register
AT91C_DBGU1_THR           EQU (0x400E081C) ;- (DBGU1) Transmitter Holding Register
// - ========== Register definition for PIOA peripheral ========== 
AT91C_PIOA_SENIDR         EQU (0x400E0F58) ;- (PIOA) Sensor Interrupt Disable Register
AT91C_PIOA_OWSR           EQU (0x400E0EA8) ;- (PIOA) Output Write Status Register
AT91C_PIOA_PSR            EQU (0x400E0E08) ;- (PIOA) PIO Status Register
AT91C_PIOA_MDER           EQU (0x400E0E50) ;- (PIOA) Multi-driver Enable Register
AT91C_PIOA_IPNAME1        EQU (0x400E0EF0) ;- (PIOA) PIO IPNAME1 REGISTER 
AT91C_PIOA_FEATURES       EQU (0x400E0EF8) ;- (PIOA) PIO FEATURES REGISTER 
AT91C_PIOA_SP2            EQU (0x400E0E74) ;- (PIOA) Select B Register
AT91C_PIOA_ODR            EQU (0x400E0E14) ;- (PIOA) Output Disable Registerr
AT91C_PIOA_IDR            EQU (0x400E0E44) ;- (PIOA) Interrupt Disable Register
AT91C_PIOA_PDR            EQU (0x400E0E04) ;- (PIOA) PIO Disable Register
AT91C_PIOA_PDSR           EQU (0x400E0E3C) ;- (PIOA) Pin Data Status Register
AT91C_PIOA_PPDER          EQU (0x400E0E94) ;- (PIOA) Pull-down Enable Register
AT91C_PIOA_SENIER         EQU (0x400E0F54) ;- (PIOA) Sensor Interrupt Enable Register
AT91C_PIOA_SLEW2          EQU (0x400E0F04) ;- (PIOA) PIO SLEWRATE2 REGISTER 
AT91C_PIOA_SENMR          EQU (0x400E0F50) ;- (PIOA) Sensor Mode Register
AT91C_PIOA_PPUDR          EQU (0x400E0E60) ;- (PIOA) Pull-up Disable Register
AT91C_PIOA_OWDR           EQU (0x400E0EA4) ;- (PIOA) Output Write Disable Register
AT91C_PIOA_ADDRSIZE       EQU (0x400E0EEC) ;- (PIOA) PIO ADDRSIZE REGISTER 
AT91C_PIOA_IFER           EQU (0x400E0E20) ;- (PIOA) Input Filter Enable Register
AT91C_PIOA_PPDSR          EQU (0x400E0E98) ;- (PIOA) Pull-down Status Register
AT91C_PIOA_SP1            EQU (0x400E0E70) ;- (PIOA) Select B Register
AT91C_PIOA_SENIMR         EQU (0x400E0F5C) ;- (PIOA) Sensor Interrupt Mask Register
AT91C_PIOA_SENDATA        EQU (0x400E0F64) ;- (PIOA) Sensor Data Register
AT91C_PIOA_VER            EQU (0x400E0EFC) ;- (PIOA) PIO VERSION REGISTER 
AT91C_PIOA_PER            EQU (0x400E0E00) ;- (PIOA) PIO Enable Register
AT91C_PIOA_IMR            EQU (0x400E0E48) ;- (PIOA) Interrupt Mask Register
AT91C_PIOA_PPUSR          EQU (0x400E0E68) ;- (PIOA) Pull-up Status Register
AT91C_PIOA_ODSR           EQU (0x400E0E38) ;- (PIOA) Output Data Status Register
AT91C_PIOA_SENISR         EQU (0x400E0F60) ;- (PIOA) Sensor Interrupt Status Register
AT91C_PIOA_IFDR           EQU (0x400E0E24) ;- (PIOA) Input Filter Disable Register
AT91C_PIOA_SODR           EQU (0x400E0E30) ;- (PIOA) Set Output Data Register
AT91C_PIOA_SLEW1          EQU (0x400E0F00) ;- (PIOA) PIO SLEWRATE1 REGISTER 
AT91C_PIOA_IER            EQU (0x400E0E40) ;- (PIOA) Interrupt Enable Register
AT91C_PIOA_MDSR           EQU (0x400E0E58) ;- (PIOA) Multi-driver Status Register
AT91C_PIOA_ISR            EQU (0x400E0E4C) ;- (PIOA) Interrupt Status Register
AT91C_PIOA_IFSR           EQU (0x400E0E28) ;- (PIOA) Input Filter Status Register
AT91C_PIOA_PPDDR          EQU (0x400E0E90) ;- (PIOA) Pull-down Disable Register
AT91C_PIOA_PPUER          EQU (0x400E0E64) ;- (PIOA) Pull-up Enable Register
AT91C_PIOA_OWER           EQU (0x400E0EA0) ;- (PIOA) Output Write Enable Register
AT91C_PIOA_IPNAME2        EQU (0x400E0EF4) ;- (PIOA) PIO IPNAME2 REGISTER 
AT91C_PIOA_MDDR           EQU (0x400E0E54) ;- (PIOA) Multi-driver Disable Register
AT91C_PIOA_CODR           EQU (0x400E0E34) ;- (PIOA) Clear Output Data Register
AT91C_PIOA_OER            EQU (0x400E0E10) ;- (PIOA) Output Enable Register
AT91C_PIOA_OSR            EQU (0x400E0E18) ;- (PIOA) Output Status Register
AT91C_PIOA_ABSR           EQU (0x400E0E78) ;- (PIOA) AB Select Status Register
// - ========== Register definition for PDC_PIOA peripheral ========== 
AT91C_PIOA_RPR            EQU (0x400E0F68) ;- (PDC_PIOA) Receive Pointer Register
AT91C_PIOA_TPR            EQU (0x400E0F70) ;- (PDC_PIOA) Transmit Pointer Register
AT91C_PIOA_RCR            EQU (0x400E0F6C) ;- (PDC_PIOA) Receive Counter Register
AT91C_PIOA_PTSR           EQU (0x400E0F8C) ;- (PDC_PIOA) PDC Transfer Status Register
AT91C_PIOA_TCR            EQU (0x400E0F74) ;- (PDC_PIOA) Transmit Counter Register
AT91C_PIOA_PTCR           EQU (0x400E0F88) ;- (PDC_PIOA) PDC Transfer Control Register
AT91C_PIOA_RNPR           EQU (0x400E0F78) ;- (PDC_PIOA) Receive Next Pointer Register
AT91C_PIOA_TNCR           EQU (0x400E0F84) ;- (PDC_PIOA) Transmit Next Counter Register
AT91C_PIOA_RNCR           EQU (0x400E0F7C) ;- (PDC_PIOA) Receive Next Counter Register
AT91C_PIOA_TNPR           EQU (0x400E0F80) ;- (PDC_PIOA) Transmit Next Pointer Register
// - ========== Register definition for PIOB peripheral ========== 
AT91C_PIOB_MDDR           EQU (0x400E1054) ;- (PIOB) Multi-driver Disable Register
AT91C_PIOB_ABSR           EQU (0x400E1078) ;- (PIOB) AB Select Status Register
AT91C_PIOB_SP1            EQU (0x400E1070) ;- (PIOB) Select B Register
AT91C_PIOB_ODSR           EQU (0x400E1038) ;- (PIOB) Output Data Status Register
