una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s4.h
AT91C_TC4_IMR             EQU (0x4001406C) ;- (TC4) Interrupt Mask Register
AT91C_TC4_RC              EQU (0x4001405C) ;- (TC4) Register C
AT91C_TC4_SR              EQU (0x40014060) ;- (TC4) Status Register
AT91C_TC4_RB              EQU (0x40014058) ;- (TC4) Register B
AT91C_TC4_IDR             EQU (0x40014068) ;- (TC4) Interrupt Disable Register
AT91C_TC4_IER             EQU (0x40014064) ;- (TC4) Interrupt Enable Register
AT91C_TC4_CCR             EQU (0x40014040) ;- (TC4) Channel Control Register
// - ========== Register definition for TC5 peripheral ========== 
AT91C_TC5_CV              EQU (0x40014090) ;- (TC5) Counter Value
AT91C_TC5_IER             EQU (0x400140A4) ;- (TC5) Interrupt Enable Register
AT91C_TC5_CMR             EQU (0x40014084) ;- (TC5) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC5_IMR             EQU (0x400140AC) ;- (TC5) Interrupt Mask Register
AT91C_TC5_RA              EQU (0x40014094) ;- (TC5) Register A
AT91C_TC5_RB              EQU (0x40014098) ;- (TC5) Register B
AT91C_TC5_RC              EQU (0x4001409C) ;- (TC5) Register C
AT91C_TC5_SR              EQU (0x400140A0) ;- (TC5) Status Register
AT91C_TC5_CCR             EQU (0x40014080) ;- (TC5) Channel Control Register
AT91C_TC5_IDR             EQU (0x400140A8) ;- (TC5) Interrupt Disable Register
// - ========== Register definition for TCB0 peripheral ========== 
AT91C_TCB0_BCR            EQU (0x400100C0) ;- (TCB0) TC Block Control Register
AT91C_TCB0_VER            EQU (0x400100FC) ;- (TCB0)  Version Register
AT91C_TCB0_ADDRSIZE       EQU (0x400100EC) ;- (TCB0) TC ADDRSIZE REGISTER 
AT91C_TCB0_FEATURES       EQU (0x400100F8) ;- (TCB0) TC FEATURES REGISTER 
AT91C_TCB0_IPNAME2        EQU (0x400100F4) ;- (TCB0) TC IPNAME2 REGISTER 
AT91C_TCB0_BMR            EQU (0x400100C4) ;- (TCB0) TC Block Mode Register
AT91C_TCB0_IPNAME1        EQU (0x400100F0) ;- (TCB0) TC IPNAME1 REGISTER 
// - ========== Register definition for TCB1 peripheral ========== 
AT91C_TCB1_IPNAME1        EQU (0x40010130) ;- (TCB1) TC IPNAME1 REGISTER 
AT91C_TCB1_IPNAME2        EQU (0x40010134) ;- (TCB1) TC IPNAME2 REGISTER 
AT91C_TCB1_BCR            EQU (0x40010100) ;- (TCB1) TC Block Control Register
AT91C_TCB1_VER            EQU (0x4001013C) ;- (TCB1)  Version Register
AT91C_TCB1_FEATURES       EQU (0x40010138) ;- (TCB1) TC FEATURES REGISTER 
AT91C_TCB1_ADDRSIZE       EQU (0x4001012C) ;- (TCB1) TC ADDRSIZE REGISTER 
AT91C_TCB1_BMR            EQU (0x40010104) ;- (TCB1) TC Block Mode Register
// - ========== Register definition for TCB2 peripheral ========== 
AT91C_TCB2_VER            EQU (0x4001017C) ;- (TCB2)  Version Register
AT91C_TCB2_ADDRSIZE       EQU (0x4001016C) ;- (TCB2) TC ADDRSIZE REGISTER 
AT91C_TCB2_FEATURES       EQU (0x40010178) ;- (TCB2) TC FEATURES REGISTER 
AT91C_TCB2_BCR            EQU (0x40010140) ;- (TCB2) TC Block Control Register
AT91C_TCB2_IPNAME2        EQU (0x40010174) ;- (TCB2) TC IPNAME2 REGISTER 
AT91C_TCB2_BMR            EQU (0x40010144) ;- (TCB2) TC Block Mode Register
AT91C_TCB2_IPNAME1        EQU (0x40010170) ;- (TCB2) TC IPNAME1 REGISTER 
// - ========== Register definition for TCB3 peripheral ========== 
AT91C_TCB3_IPNAME2        EQU (0x400140F4) ;- (TCB3) TC IPNAME2 REGISTER 
AT91C_TCB3_BMR            EQU (0x400140C4) ;- (TCB3) TC Block Mode Register
AT91C_TCB3_IPNAME1        EQU (0x400140F0) ;- (TCB3) TC IPNAME1 REGISTER 
AT91C_TCB3_FEATURES       EQU (0x400140F8) ;- (TCB3) TC FEATURES REGISTER 
AT91C_TCB3_ADDRSIZE       EQU (0x400140EC) ;- (TCB3) TC ADDRSIZE REGISTER 
AT91C_TCB3_VER            EQU (0x400140FC) ;- (TCB3)  Version Register
AT91C_TCB3_BCR            EQU (0x400140C0) ;- (TCB3) TC Block Control Register
// - ========== Register definition for TCB4 peripheral ========== 
AT91C_TCB4_BMR            EQU (0x40014104) ;- (TCB4) TC Block Mode Register
AT91C_TCB4_BCR            EQU (0x40014100) ;- (TCB4) TC Block Control Register
AT91C_TCB4_IPNAME2        EQU (0x40014134) ;- (TCB4) TC IPNAME2 REGISTER 
AT91C_TCB4_FEATURES       EQU (0x40014138) ;- (TCB4) TC FEATURES REGISTER 
AT91C_TCB4_IPNAME1        EQU (0x40014130) ;- (TCB4) TC IPNAME1 REGISTER 
AT91C_TCB4_VER            EQU (0x4001413C) ;- (TCB4)  Version Register
AT91C_TCB4_ADDRSIZE       EQU (0x4001412C) ;- (TCB4) TC ADDRSIZE REGISTER 
// - ========== Register definition for TCB5 peripheral ========== 
AT91C_TCB5_VER            EQU (0x4001417C) ;- (TCB5)  Version Register
AT91C_TCB5_ADDRSIZE       EQU (0x4001416C) ;- (TCB5) TC ADDRSIZE REGISTER 
AT91C_TCB5_BMR            EQU (0x40014144) ;- (TCB5) TC Block Mode Register
AT91C_TCB5_FEATURES       EQU (0x40014178) ;- (TCB5) TC FEATURES REGISTER 
AT91C_TCB5_IPNAME2        EQU (0x40014174) ;- (TCB5) TC IPNAME2 REGISTER 
AT91C_TCB5_IPNAME1        EQU (0x40014170) ;- (TCB5) TC IPNAME1 REGISTER 
AT91C_TCB5_BCR            EQU (0x40014140) ;- (TCB5) TC Block Control Register
// - ========== Register definition for EFC0 peripheral ========== 
AT91C_EFC0_FMR            EQU (0x400E0A00) ;- (EFC0) EFC Flash Mode Register
AT91C_EFC0_FVR            EQU (0x400E0A14) ;- (EFC0) EFC Flash Version Register
AT91C_EFC0_FSR            EQU (0x400E0A08) ;- (EFC0) EFC Flash Status Register
AT91C_EFC0_FCR            EQU (0x400E0A04) ;- (EFC0) EFC Flash Command Register
AT91C_EFC0_FRR            EQU (0x400E0A0C) ;- (EFC0) EFC Flash Result Register
// - ========== Register definition for MCI0 peripheral ========== 
AT91C_MCI0_DMA            EQU (0x40000050) ;- (MCI0) MCI DMA Configuration Register
AT91C_MCI0_SDCR           EQU (0x4000000C) ;- (MCI0) MCI SD/SDIO Card Register
AT91C_MCI0_IPNAME1        EQU (0x400000F0) ;- (MCI0) MCI IPNAME1 REGISTER 
AT91C_MCI0_CSTOR          EQU (0x4000001C) ;- (MCI0) MCI Completion Signal Timeout Register
AT91C_MCI0_RDR            EQU (0x40000030) ;- (MCI0) MCI Receive Data Register
AT91C_MCI0_CMDR           EQU (0x40000014) ;- (MCI0) MCI Command Register
AT91C_MCI0_IDR            EQU (0x40000048) ;- (MCI0) MCI Interrupt Disable Register
AT91C_MCI0_ADDRSIZE       EQU (0x400000EC) ;- (MCI0) MCI ADDRSIZE REGISTER 
AT91C_MCI0_WPCR           EQU (0x400000E4) ;- (MCI0) MCI Write Protection Control Register
AT91C_MCI0_RSPR           EQU (0x40000020) ;- (MCI0) MCI Response Register
AT91C_MCI0_IPNAME2        EQU (0x400000F4) ;- (MCI0) MCI IPNAME2 REGISTER 
AT91C_MCI0_CR             EQU (0x40000000) ;- (MCI0) MCI Control Register
AT91C_MCI0_IMR            EQU (0x4000004C) ;- (MCI0) MCI Interrupt Mask Register
AT91C_MCI0_WPSR           EQU (0x400000E8) ;- (MCI0) MCI Write Protection Status Register
AT91C_MCI0_DTOR           EQU (0x40000008) ;- (MCI0) MCI Data Timeout Register
AT91C_MCI0_MR             EQU (0x40000004) ;- (MCI0) MCI Mode Register
AT91C_MCI0_SR             EQU (0x40000040) ;- (MCI0) MCI Status Register
AT91C_MCI0_IER            EQU (0x40000044) ;- (MCI0) MCI Interrupt Enable Register
AT91C_MCI0_VER            EQU (0x400000FC) ;- (MCI0) MCI VERSION REGISTER 
AT91C_MCI0_FEATURES       EQU (0x400000F8) ;- (MCI0) MCI FEATURES REGISTER 
AT91C_MCI0_BLKR           EQU (0x40000018) ;- (MCI0) MCI Block Register
AT91C_MCI0_ARGR           EQU (0x40000010) ;- (MCI0) MCI Argument Register
AT91C_MCI0_FIFO           EQU (0x40000200) ;- (MCI0) MCI FIFO Aperture Register
AT91C_MCI0_TDR            EQU (0x40000034) ;- (MCI0) MCI Transmit Data Register
AT91C_MCI0_CFG            EQU (0x40000054) ;- (MCI0) MCI Configuration Register
// - ========== Register definition for PDC_TWI0 peripheral ========== 
AT91C_TWI0_PTSR           EQU (0x40018124) ;- (PDC_TWI0) PDC Transfer Status Register
AT91C_TWI0_TPR            EQU (0x40018108) ;- (PDC_TWI0) Transmit Pointer Register
AT91C_TWI0_RPR            EQU (0x40018100) ;- (PDC_TWI0) Receive Pointer Register
AT91C_TWI0_TNPR           EQU (0x40018118) ;- (PDC_TWI0) Transmit Next Pointer Register
AT91C_TWI0_PTCR           EQU (0x40018120) ;- (PDC_TWI0) PDC Transfer Control Register
AT91C_TWI0_RCR            EQU (0x40018104) ;- (PDC_TWI0) Receive Counter Register
AT91C_TWI0_RNCR           EQU (0x40018114) ;- (PDC_TWI0) Receive Next Counter Register
AT91C_TWI0_RNPR           EQU (0x40018110) ;- (PDC_TWI0) Receive Next Pointer Register
AT91C_TWI0_TNCR           EQU (0x4001811C) ;- (PDC_TWI0) Transmit Next Counter Register
AT91C_TWI0_TCR            EQU (0x4001810C) ;- (PDC_TWI0) Transmit Counter Register
// - ========== Register definition for PDC_TWI1 peripheral ========== 
AT91C_TWI1_TPR            EQU (0x4001C108) ;- (PDC_TWI1) Transmit Pointer Register
AT91C_TWI1_RNCR           EQU (0x4001C114) ;- (PDC_TWI1) Receive Next Counter Register
AT91C_TWI1_TNCR           EQU (0x4001C11C) ;- (PDC_TWI1) Transmit Next Counter Register
AT91C_TWI1_TCR            EQU (0x4001C10C) ;- (PDC_TWI1) Transmit Counter Register
AT91C_TWI1_TNPR           EQU (0x4001C118) ;- (PDC_TWI1) Transmit Next Pointer Register
AT91C_TWI1_PTCR           EQU (0x4001C120) ;- (PDC_TWI1) PDC Transfer Control Register
AT91C_TWI1_RNPR           EQU (0x4001C110) ;- (PDC_TWI1) Receive Next Pointer Register
AT91C_TWI1_PTSR           EQU (0x4001C124) ;- (PDC_TWI1) PDC Transfer Status Register
AT91C_TWI1_RPR            EQU (0x4001C100) ;- (PDC_TWI1) Receive Pointer Register
AT91C_TWI1_RCR            EQU (0x4001C104) ;- (PDC_TWI1) Receive Counter Register
// - ========== Register definition for TWI0 peripheral ========== 
AT91C_TWI0_IMR            EQU (0x4001802C) ;- (TWI0) Interrupt Mask Register
AT91C_TWI0_IPNAME1        EQU (0x400180F0) ;- (TWI0) TWI IPNAME1 REGISTER 
AT91C_TWI0_CR             EQU (0x40018000) ;- (TWI0) Control Register
AT91C_TWI0_IPNAME2        EQU (0x400180F4) ;- (TWI0) TWI IPNAME2 REGISTER 
AT91C_TWI0_CWGR           EQU (0x40018010) ;- (TWI0) Clock Waveform Generator Register
AT91C_TWI0_SMR            EQU (0x40018008) ;- (TWI0) Slave Mode Register
AT91C_TWI0_ADDRSIZE       EQU (0x400180EC) ;- (TWI0) TWI ADDRSIZE REGISTER 
AT91C_TWI0_SR             EQU (0x40018020) ;- (TWI0) Status Register
AT91C_TWI0_IER            EQU (0x40018024) ;- (TWI0) Interrupt Enable Register
AT91C_TWI0_VER            EQU (0x400180FC) ;- (TWI0) Version Register
AT91C_TWI0_RHR            EQU (0x40018030) ;- (TWI0) Receive Holding Register
AT91C_TWI0_IADR           EQU (0x4001800C) ;- (TWI0) Internal Address Register
AT91C_TWI0_IDR            EQU (0x40018028) ;- (TWI0) Interrupt Disable Register
AT91C_TWI0_THR            EQU (0x40018034) ;- (TWI0) Transmit Holding Register
AT91C_TWI0_FEATURES       EQU (0x400180F8) ;- (TWI0) TWI FEATURES REGISTER 
AT91C_TWI0_MMR            EQU (0x40018004) ;- (TWI0) Master Mode Register
// - ========== Register definition for TWI1 peripheral ========== 
AT91C_TWI1_CR             EQU (0x4001C000) ;- (TWI1) Control Register
AT91C_TWI1_VER            EQU (0x4001C0FC) ;- (TWI1) Version Register
AT91C_TWI1_IMR            EQU (0x4001C02C) ;- (TWI1) Interrupt Mask Register
AT91C_TWI1_IADR           EQU (0x4001C00C) ;- (TWI1) Internal Address Register
AT91C_TWI1_THR            EQU (0x4001C034) ;- (TWI1) Transmit Holding Register
AT91C_TWI1_IPNAME2        EQU (0x4001C0F4) ;- (TWI1) TWI IPNAME2 REGISTER 
AT91C_TWI1_FEATURES       EQU (0x4001C0F8) ;- (TWI1) TWI FEATURES REGISTER 
AT91C_TWI1_SMR            EQU (0x4001C008) ;- (TWI1) Slave Mode Register
AT91C_TWI1_IDR            EQU (0x4001C028) ;- (TWI1) Interrupt Disable Register
AT91C_TWI1_SR             EQU (0x4001C020) ;- (TWI1) Status Register
AT91C_TWI1_IPNAME1        EQU (0x4001C0F0) ;- (TWI1) TWI IPNAME1 REGISTER 
AT91C_TWI1_IER            EQU (0x4001C024) ;- (TWI1) Interrupt Enable Register
AT91C_TWI1_ADDRSIZE       EQU (0x4001C0EC) ;- (TWI1) TWI ADDRSIZE REGISTER 
AT91C_TWI1_CWGR           EQU (0x4001C010) ;- (TWI1) Clock Waveform Generator Register
AT91C_TWI1_MMR            EQU (0x4001C004) ;- (TWI1) Master Mode Register
AT91C_TWI1_RHR            EQU (0x4001C030) ;- (TWI1) Receive Holding Register
// - ========== Register definition for PDC_US0 peripheral ========== 
AT91C_US0_RNCR            EQU (0x40024114) ;- (PDC_US0) Receive Next Counter Register
AT91C_US0_PTCR            EQU (0x40024120) ;- (PDC_US0) PDC Transfer Control Register
AT91C_US0_TCR             EQU (0x4002410C) ;- (PDC_US0) Transmit Counter Register
AT91C_US0_RPR             EQU (0x40024100) ;- (PDC_US0) Receive Pointer Register
AT91C_US0_RNPR            EQU (0x40024110) ;- (PDC_US0) Receive Next Pointer Register
AT91C_US0_TNCR            EQU (0x4002411C) ;- (PDC_US0) Transmit Next Counter Register
AT91C_US0_PTSR            EQU (0x40024124) ;- (PDC_US0) PDC Transfer Status Register
AT91C_US0_RCR             EQU (0x40024104) ;- (PDC_US0) Receive Counter Register
AT91C_US0_TNPR            EQU (0x40024118) ;- (PDC_US0) Transmit Next Pointer Register
AT91C_US0_TPR             EQU (0x40024108) ;- (PDC_US0) Transmit Pointer Register
// - ========== Register definition for US0 peripheral ========== 
AT91C_US0_MAN             EQU (0x40024050) ;- (US0) Manchester Encoder Decoder Register
AT91C_US0_IER             EQU (0x40024008) ;- (US0) Interrupt Enable Register
AT91C_US0_NER             EQU (0x40024044) ;- (US0) Nb Errors Register
AT91C_US0_BRGR            EQU (0x40024020) ;- (US0) Baud Rate Generator Register
AT91C_US0_VER             EQU (0x400240FC) ;- (US0) VERSION Register
AT91C_US0_IF              EQU (0x4002404C) ;- (US0) IRDA_FILTER Register
AT91C_US0_RHR             EQU (0x40024018) ;- (US0) Receiver Holding Register
AT91C_US0_CSR             EQU (0x40024014) ;- (US0) Channel Status Register
AT91C_US0_FEATURES        EQU (0x400240F8) ;- (US0) US FEATURES REGISTER 
AT91C_US0_ADDRSIZE        EQU (0x400240EC) ;- (US0) US ADDRSIZE REGISTER 
AT91C_US0_IMR             EQU (0x40024010) ;- (US0) Interrupt Mask Register
AT91C_US0_THR             EQU (0x4002401C) ;- (US0) Transmitter Holding Register
AT91C_US0_FIDI            EQU (0x40024040) ;- (US0) FI_DI_Ratio Register
AT91C_US0_MR              EQU (0x40024004) ;- (US0) Mode Register
AT91C_US0_RTOR            EQU (0x40024024) ;- (US0) Receiver Time-out Register
AT91C_US0_IPNAME1         EQU (0x400240F0) ;- (US0) US IPNAME1 REGISTER 
AT91C_US0_IDR             EQU (0x4002400C) ;- (US0) Interrupt Disable Register
AT91C_US0_IPNAME2         EQU (0x400240F4) ;- (US0) US IPNAME2 REGISTER 
AT91C_US0_CR              EQU (0x40024000) ;- (US0) Control Register
AT91C_US0_TTGR            EQU (0x40024028) ;- (US0) Transmitter Time-guard Register
// - ========== Register definition for PDC_US1 peripheral ========== 
AT91C_US1_TNPR            EQU (0x40028118) ;- (PDC_US1) Transmit Next Pointer Register
AT91C_US1_RPR             EQU (0x40028100) ;- (PDC_US1) Receive Pointer Register
AT91C_US1_TCR             EQU (0x4002810C) ;- (PDC_US1) Transmit Counter Register
AT91C_US1_RCR             EQU (0x40028104) ;- (PDC_US1) Receive Counter Register
AT91C_US1_TPR             EQU (0x40028108) ;- (PDC_US1) Transmit Pointer Register
AT91C_US1_RNPR            EQU (0x40028110) ;- (PDC_US1) Receive Next Pointer Register
AT91C_US1_TNCR            EQU (0x4002811C) ;- (PDC_US1) Transmit Next Counter Register
AT91C_US1_PTCR            EQU (0x40028120) ;- (PDC_US1) PDC Transfer Control Register
AT91C_US1_RNCR            EQU (0x40028114) ;- (PDC_US1) Receive Next Counter Register
AT91C_US1_PTSR            EQU (0x40028124) ;- (PDC_US1) PDC Transfer Status Register
// - ========== Register definition for US1 peripheral ========== 
AT91C_US1_ADDRSIZE        EQU (0x400280EC) ;- (US1) US ADDRSIZE REGISTER 
AT91C_US1_IDR             EQU (0x4002800C) ;- (US1) Interrupt Disable Register
AT91C_US1_FEATURES        EQU (0x400280F8) ;- (US1) US FEATURES REGISTER 
AT91C_US1_IPNAME2         EQU (0x400280F4) ;- (US1) US IPNAME2 REGISTER 
AT91C_US1_MAN             EQU (0x40028050) ;- (US1) Manchester Encoder Decoder Register
AT91C_US1_CR              EQU (0x40028000) ;- (US1) Control Register
AT91C_US1_TTGR            EQU (0x40028028) ;- (US1) Transmitter Time-guard Register
AT91C_US1_IF              EQU (0x4002804C) ;- (US1) IRDA_FILTER Register
AT91C_US1_FIDI            EQU (0x40028040) ;- (US1) FI_DI_Ratio Register
AT91C_US1_THR             EQU (0x4002801C) ;- (US1) Transmitter Holding Register
AT91C_US1_VER             EQU (0x400280FC) ;- (US1) VERSION Register
AT91C_US1_MR              EQU (0x40028004) ;- (US1) Mode Register
AT91C_US1_CSR             EQU (0x40028014) ;- (US1) Channel Status Register
AT91C_US1_IER             EQU (0x40028008) ;- (US1) Interrupt Enable Register
AT91C_US1_NER             EQU (0x40028044) ;- (US1) Nb Errors Register
AT91C_US1_RHR             EQU (0x40028018) ;- (US1) Receiver Holding Register
AT91C_US1_IPNAME1         EQU (0x400280F0) ;- (US1) US IPNAME1 REGISTER 
AT91C_US1_IMR             EQU (0x40028010) ;- (US1) Interrupt Mask Register
AT91C_US1_BRGR            EQU (0x40028020) ;- (US1) Baud Rate Generator Register
AT91C_US1_RTOR            EQU (0x40028024) ;- (US1) Receiver Time-out Register
// - ========== Register definition for PDC_SSC0 peripheral ========== 
AT91C_SSC0_RNCR           EQU (0x40004114) ;- (PDC_SSC0) Receive Next Counter Register
AT91C_SSC0_TPR            EQU (0x40004108) ;- (PDC_SSC0) Transmit Pointer Register
AT91C_SSC0_TCR            EQU (0x4000410C) ;- (PDC_SSC0) Transmit Counter Register
AT91C_SSC0_PTCR           EQU (0x40004120) ;- (PDC_SSC0) PDC Transfer Control Register
AT91C_SSC0_TNPR           EQU (0x40004118) ;- (PDC_SSC0) Transmit Next Pointer Register
AT91C_SSC0_RPR            EQU (0x40004100) ;- (PDC_SSC0) Receive Pointer Register
AT91C_SSC0_TNCR           EQU (0x4000411C) ;- (PDC_SSC0) Transmit Next Counter Register
AT91C_SSC0_RNPR           EQU (0x40004110) ;- (PDC_SSC0) Receive Next Pointer Register
AT91C_SSC0_RCR            EQU (0x40004104) ;- (PDC_SSC0) Receive Counter Register
AT91C_SSC0_PTSR           EQU (0x40004124) ;- (PDC_SSC0) PDC Transfer Status Register
// - ========== Register definition for SSC0 peripheral ========== 
AT91C_SSC0_FEATURES       EQU (0x400040F8) ;- (SSC0) SSC FEATURES REGISTER 
AT91C_SSC0_ADDRSIZE       EQU (0x400040F0) ;- (SSC0) SSC ADDRSIZE REGISTER 
AT91C_SSC0_CR             EQU (0x40004000) ;- (SSC0) Control Register
AT91C_SSC0_RHR            EQU (0x40004020) ;- (SSC0) Receive Holding Register
AT91C_SSC0_VER            EQU (0x400040FC) ;- (SSC0) Version Register
AT91C_SSC0_TSHR           EQU (0x40004034) ;- (SSC0) Transmit Sync Holding Register
AT91C_SSC0_RFMR           EQU (0x40004014) ;- (SSC0) Receive Frame Mode Register
AT91C_SSC0_IDR            EQU (0x40004048) ;- (SSC0) Interrupt Disable Register
AT91C_SSC0_TFMR           EQU (0x4000401C) ;- (SSC0) Transmit Frame Mode Register
AT91C_SSC0_RSHR           EQU (0x40004030) ;- (SSC0) Receive Sync Holding Register
AT91C_SSC0_TCMR           EQU (0x40004018) ;- (SSC0) Transmit Clock Mode Register
AT91C_SSC0_RCMR           EQU (0x40004010) ;- (SSC0) Receive Clock ModeRegister
AT91C_SSC0_SR             EQU (0x40004040) ;- (SSC0) Status Register
AT91C_SSC0_NAME           EQU (0x400040F4) ;- (SSC0) SSC NAME REGISTER 
AT91C_SSC0_THR            EQU (0x40004024) ;- (SSC0) Transmit Holding Register
AT91C_SSC0_CMR            EQU (0x40004004) ;- (SSC0) Clock Mode Register
AT91C_SSC0_IER            EQU (0x40004044) ;- (SSC0) Interrupt Enable Register
AT91C_SSC0_IMR            EQU (0x4000404C) ;- (SSC0) Interrupt Mask Register
// - ========== Register definition for PDC_PWMC peripheral ========== 
AT91C_PWMC_TNCR           EQU (0x4002011C) ;- (PDC_PWMC) Transmit Next Counter Register
AT91C_PWMC_RCR            EQU (0x40020104) ;- (PDC_PWMC) Receive Counter Register
AT91C_PWMC_TCR            EQU (0x4002010C) ;- (PDC_PWMC) Transmit Counter Register
AT91C_PWMC_RNCR           EQU (0x40020114) ;- (PDC_PWMC) Receive Next Counter Register
AT91C_PWMC_PTSR           EQU (0x40020124) ;- (PDC_PWMC) PDC Transfer Status Register
AT91C_PWMC_RNPR           EQU (0x40020110) ;- (PDC_PWMC) Receive Next Pointer Register
AT91C_PWMC_TNPR           EQU (0x40020118) ;- (PDC_PWMC) Transmit Next Pointer Register
AT91C_PWMC_PTCR           EQU (0x40020120) ;- (PDC_PWMC) PDC Transfer Control Register
AT91C_PWMC_RPR            EQU (0x40020100) ;- (PDC_PWMC) Receive Pointer Register
AT91C_PWMC_TPR            EQU (0x40020108) ;- (PDC_PWMC) Transmit Pointer Register
// - ========== Register definition for PWMC_CH0 peripheral ========== 
AT91C_PWMC_CH0_CMR        EQU (0x40020200) ;- (PWMC_CH0) Channel Mode Register
AT91C_PWMC_CH0_DTUPDR     EQU (0x4002021C) ;- (PWMC_CH0) Channel Dead Time Update Value Register
AT91C_PWMC_CH0_CPRDR      EQU (0x4002020C) ;- (PWMC_CH0) Channel Period Register
AT91C_PWMC_CH0_CPRDUPDR   EQU (0x40020210) ;- (PWMC_CH0) Channel Period Update Register
AT91C_PWMC_CH0_CDTYR      EQU (0x40020204) ;- (PWMC_CH0) Channel Duty Cycle Register
AT91C_PWMC_CH0_DTR        EQU (0x40020218) ;- (PWMC_CH0) Channel Dead Time Value Register
AT91C_PWMC_CH0_CDTYUPDR   EQU (0x40020208) ;- (PWMC_CH0) Channel Duty Cycle Update Register
AT91C_PWMC_CH0_CCNTR      EQU (0x40020214) ;- (PWMC_CH0) Channel Counter Register
// - ========== Register definition for PWMC_CH1 peripheral ========== 
AT91C_PWMC_CH1_DTUPDR     EQU (0x4002023C) ;- (PWMC_CH1) Channel Dead Time Update Value Register
AT91C_PWMC_CH1_DTR        EQU (0x40020238) ;- (PWMC_CH1) Channel Dead Time Value Register
AT91C_PWMC_CH1_CDTYUPDR   EQU (0x40020228) ;- (PWMC_CH1) Channel Duty Cycle Update Register
AT91C_PWMC_CH1_CDTYR      EQU (0x40020224) ;- (PWMC_CH1) Channel Duty Cycle Register
AT91C_PWMC_CH1_CCNTR      EQU (0x40020234) ;- (PWMC_CH1) Channel Counter Register
AT91C_PWMC_CH1_CPRDR      EQU (0x4002022C) ;- (PWMC_CH1) Channel Period Register
AT91C_PWMC_CH1_CMR        EQU (0x40020220) ;- (PWMC_CH1) Channel Mode Register
AT91C_PWMC_CH1_CPRDUPDR   EQU (0x40020230) ;- (PWMC_CH1) Channel Period Update Register
// - ========== Register definition for PWMC_CH2 peripheral ========== 
AT91C_PWMC_CH2_CPRDUPDR   EQU (0x40020250) ;- (PWMC_CH2) Channel Period Update Register
AT91C_PWMC_CH2_CDTYR      EQU (0x40020244) ;- (PWMC_CH2) Channel Duty Cycle Register
AT91C_PWMC_CH2_CCNTR      EQU (0x40020254) ;- (PWMC_CH2) Channel Counter Register
AT91C_PWMC_CH2_CMR        EQU (0x40020240) ;- (PWMC_CH2) Channel Mode Register
AT91C_PWMC_CH2_CDTYUPDR   EQU (0x40020248) ;- (PWMC_CH2) Channel Duty Cycle Update Register
AT91C_PWMC_CH2_DTUPDR     EQU (0x4002025C) ;- (PWMC_CH2) Channel Dead Time Update Value Register
AT91C_PWMC_CH2_DTR        EQU (0x40020258) ;- (PWMC_CH2) Channel Dead Time Value Register
AT91C_PWMC_CH2_CPRDR      EQU (0x4002024C) ;- (PWMC_CH2) Channel Period Register
// - ========== Register definition for PWMC_CH3 peripheral ========== 
AT91C_PWMC_CH3_CPRDR      EQU (0x4002026C) ;- (PWMC_CH3) Channel Period Register
AT91C_PWMC_CH3_DTUPDR     EQU (0x4002027C) ;- (PWMC_CH3) Channel Dead Time Update Value Register
AT91C_PWMC_CH3_DTR        EQU (0x40020278) ;- (PWMC_CH3) Channel Dead Time Value Register
AT91C_PWMC_CH3_CDTYR      EQU (0x40020264) ;- (PWMC_CH3) Channel Duty Cycle Register
AT91C_PWMC_CH3_CMR        EQU (0x40020260) ;- (PWMC_CH3) Channel Mode Register
AT91C_PWMC_CH3_CCNTR      EQU (0x40020274) ;- (PWMC_CH3) Channel Counter Register
AT91C_PWMC_CH3_CPRDUPDR   EQU (0x40020270) ;- (PWMC_CH3) Channel Period Update Register
AT91C_PWMC_CH3_CDTYUPDR   EQU (0x40020268) ;- (PWMC_CH3) Channel Duty Cycle Update Register
// - ========== Register definition for PWMC peripheral ========== 
AT91C_PWMC_CMP6M          EQU (0x40020198) ;- (PWMC) PWM Comparison Mode 6 Register
AT91C_PWMC_ADDRSIZE       EQU (0x400200EC) ;- (PWMC) PWMC ADDRSIZE REGISTER 
AT91C_PWMC_CMP5V          EQU (0x40020180) ;- (PWMC) PWM Comparison Value 5 Register
AT91C_PWMC_FMR            EQU (0x4002005C) ;- (PWMC) PWM Fault Mode Register
AT91C_PWMC_IER2           EQU (0x40020034) ;- (PWMC) PWMC Interrupt Enable Register 2
