una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam3s4.h
AT91C_PWMC_EL5MR          EQU (0x40020090) ;- (PWMC) PWM Event Line 5 Mode Register
AT91C_PWMC_CMP0VUPD       EQU (0x40020134) ;- (PWMC) PWM Comparison Value 0 Update Register
AT91C_PWMC_FPER1          EQU (0x4002006C) ;- (PWMC) PWM Fault Protection Enable Register 1
AT91C_PWMC_SCUPUPD        EQU (0x40020030) ;- (PWMC) PWM Update Period Update Register
AT91C_PWMC_DIS            EQU (0x40020008) ;- (PWMC) PWMC Disable Register
AT91C_PWMC_CMP1M          EQU (0x40020148) ;- (PWMC) PWM Comparison Mode 1 Register
AT91C_PWMC_CMP2V          EQU (0x40020150) ;- (PWMC) PWM Comparison Value 2 Register
AT91C_PWMC_WPCR           EQU (0x400200E4) ;- (PWMC) PWM Write Protection Enable Register
AT91C_PWMC_CMP5MUPD       EQU (0x4002018C) ;- (PWMC) PWM Comparison Mode 5 Update Register
AT91C_PWMC_FPV            EQU (0x40020068) ;- (PWMC) PWM Fault Protection Value Register
AT91C_PWMC_UPCR           EQU (0x40020028) ;- (PWMC) PWM Update Control Register
AT91C_PWMC_CMP4MUPD       EQU (0x4002017C) ;- (PWMC) PWM Comparison Mode 4 Update Register
AT91C_PWMC_EL6MR          EQU (0x40020094) ;- (PWMC) PWM Event Line 6 Mode Register
AT91C_PWMC_OS             EQU (0x40020048) ;- (PWMC) PWM Output Selection Register
AT91C_PWMC_OSSUPD         EQU (0x40020054) ;- (PWMC) PWM Output Selection Set Update Register
AT91C_PWMC_FSR            EQU (0x40020060) ;- (PWMC) PWM Fault Mode Status Register
AT91C_PWMC_CMP2M          EQU (0x40020158) ;- (PWMC) PWM Comparison Mode 2 Register
AT91C_PWMC_EL2MR          EQU (0x40020084) ;- (PWMC) PWM Event Line 2 Mode Register
AT91C_PWMC_FPER3          EQU (0x40020074) ;- (PWMC) PWM Fault Protection Enable Register 3
AT91C_PWMC_CMP4M          EQU (0x40020178) ;- (PWMC) PWM Comparison Mode 4 Register
AT91C_PWMC_ISR2           EQU (0x40020040) ;- (PWMC) PWMC Interrupt Status Register 2
AT91C_PWMC_CMP6VUPD       EQU (0x40020194) ;- (PWMC) PWM Comparison Value 6 Update Register
AT91C_PWMC_CMP5VUPD       EQU (0x40020184) ;- (PWMC) PWM Comparison Value 5 Update Register
AT91C_PWMC_EL7MR          EQU (0x40020098) ;- (PWMC) PWM Event Line 7 Mode Register
AT91C_PWMC_OSC            EQU (0x40020050) ;- (PWMC) PWM Output Selection Clear Register
AT91C_PWMC_CMP3MUPD       EQU (0x4002016C) ;- (PWMC) PWM Comparison Mode 3 Update Register
AT91C_PWMC_CMP2MUPD       EQU (0x4002015C) ;- (PWMC) PWM Comparison Mode 2 Update Register
AT91C_PWMC_CMP0M          EQU (0x40020138) ;- (PWMC) PWM Comparison Mode 0 Register
AT91C_PWMC_EL1MR          EQU (0x40020080) ;- (PWMC) PWM Event Line 1 Mode Register
AT91C_PWMC_CMP0MUPD       EQU (0x4002013C) ;- (PWMC) PWM Comparison Mode 0 Update Register
AT91C_PWMC_WPSR           EQU (0x400200E8) ;- (PWMC) PWM Write Protection Status Register
AT91C_PWMC_CMP1MUPD       EQU (0x4002014C) ;- (PWMC) PWM Comparison Mode 1 Update Register
AT91C_PWMC_IMR2           EQU (0x4002003C) ;- (PWMC) PWMC Interrupt Mask Register 2
AT91C_PWMC_CMP3V          EQU (0x40020160) ;- (PWMC) PWM Comparison Value 3 Register
AT91C_PWMC_CMP3VUPD       EQU (0x40020164) ;- (PWMC) PWM Comparison Value 3 Update Register
AT91C_PWMC_CMP3M          EQU (0x40020168) ;- (PWMC) PWM Comparison Mode 3 Register
AT91C_PWMC_FPER4          EQU (0x40020078) ;- (PWMC) PWM Fault Protection Enable Register 4
AT91C_PWMC_OSCUPD         EQU (0x40020058) ;- (PWMC) PWM Output Selection Clear Update Register
AT91C_PWMC_CMP0V          EQU (0x40020130) ;- (PWMC) PWM Comparison Value 0 Register
AT91C_PWMC_OOV            EQU (0x40020044) ;- (PWMC) PWM Output Override Value Register
AT91C_PWMC_ENA            EQU (0x40020004) ;- (PWMC) PWMC Enable Register
AT91C_PWMC_CMP6MUPD       EQU (0x4002019C) ;- (PWMC) PWM Comparison Mode 6 Update Register
AT91C_PWMC_SYNC           EQU (0x40020020) ;- (PWMC) PWM Synchronized Channels Register
AT91C_PWMC_IPNAME1        EQU (0x400200F0) ;- (PWMC) PWMC IPNAME1 REGISTER 
AT91C_PWMC_IDR2           EQU (0x40020038) ;- (PWMC) PWMC Interrupt Disable Register 2
AT91C_PWMC_SR             EQU (0x4002000C) ;- (PWMC) PWMC Status Register
AT91C_PWMC_FPER2          EQU (0x40020070) ;- (PWMC) PWM Fault Protection Enable Register 2
AT91C_PWMC_EL3MR          EQU (0x40020088) ;- (PWMC) PWM Event Line 3 Mode Register
AT91C_PWMC_IMR1           EQU (0x40020018) ;- (PWMC) PWMC Interrupt Mask Register 1
AT91C_PWMC_EL0MR          EQU (0x4002007C) ;- (PWMC) PWM Event Line 0 Mode Register
AT91C_PWMC_STEP           EQU (0x400200B0) ;- (PWMC) PWM Stepper Config Register
AT91C_PWMC_FCR            EQU (0x40020064) ;- (PWMC) PWM Fault Mode Clear Register
AT91C_PWMC_CMP7MUPD       EQU (0x400201AC) ;- (PWMC) PWM Comparison Mode 7 Update Register
AT91C_PWMC_ISR1           EQU (0x4002001C) ;- (PWMC) PWMC Interrupt Status Register 1
AT91C_PWMC_CMP4VUPD       EQU (0x40020174) ;- (PWMC) PWM Comparison Value 4 Update Register
AT91C_PWMC_VER            EQU (0x400200FC) ;- (PWMC) PWMC Version Register
AT91C_PWMC_CMP5M          EQU (0x40020188) ;- (PWMC) PWM Comparison Mode 5 Register
AT91C_PWMC_IER1           EQU (0x40020010) ;- (PWMC) PWMC Interrupt Enable Register 1
AT91C_PWMC_MR             EQU (0x40020000) ;- (PWMC) PWMC Mode Register
AT91C_PWMC_OSS            EQU (0x4002004C) ;- (PWMC) PWM Output Selection Set Register
AT91C_PWMC_CMP7V          EQU (0x400201A0) ;- (PWMC) PWM Comparison Value 7 Register
AT91C_PWMC_FEATURES       EQU (0x400200F8) ;- (PWMC) PWMC FEATURES REGISTER 
AT91C_PWMC_CMP4V          EQU (0x40020170) ;- (PWMC) PWM Comparison Value 4 Register
AT91C_PWMC_CMP7M          EQU (0x400201A8) ;- (PWMC) PWM Comparison Mode 7 Register
AT91C_PWMC_EL4MR          EQU (0x4002008C) ;- (PWMC) PWM Event Line 4 Mode Register
AT91C_PWMC_CMP2VUPD       EQU (0x40020154) ;- (PWMC) PWM Comparison Value 2 Update Register
AT91C_PWMC_CMP6V          EQU (0x40020190) ;- (PWMC) PWM Comparison Value 6 Register
AT91C_PWMC_CMP1V          EQU (0x40020140) ;- (PWMC) PWM Comparison Value 1 Register
AT91C_PWMC_IDR1           EQU (0x40020014) ;- (PWMC) PWMC Interrupt Disable Register 1
AT91C_PWMC_SCUP           EQU (0x4002002C) ;- (PWMC) PWM Update Period Register
AT91C_PWMC_CMP1VUPD       EQU (0x40020144) ;- (PWMC) PWM Comparison Value 1 Update Register
AT91C_PWMC_CMP7VUPD       EQU (0x400201A4) ;- (PWMC) PWM Comparison Value 7 Update Register
AT91C_PWMC_IPNAME2        EQU (0x400200F4) ;- (PWMC) PWMC IPNAME2 REGISTER 
// - ========== Register definition for SPI0 peripheral ========== 
AT91C_SPI0_ADDRSIZE       EQU (0x400080EC) ;- (SPI0) SPI ADDRSIZE REGISTER 
AT91C_SPI0_RDR            EQU (0x40008008) ;- (SPI0) Receive Data Register
AT91C_SPI0_FEATURES       EQU (0x400080F8) ;- (SPI0) SPI FEATURES REGISTER 
AT91C_SPI0_CR             EQU (0x40008000) ;- (SPI0) Control Register
AT91C_SPI0_IPNAME1        EQU (0x400080F0) ;- (SPI0) SPI IPNAME1 REGISTER 
AT91C_SPI0_VER            EQU (0x400080FC) ;- (SPI0) Version Register
AT91C_SPI0_IDR            EQU (0x40008018) ;- (SPI0) Interrupt Disable Register
AT91C_SPI0_TDR            EQU (0x4000800C) ;- (SPI0) Transmit Data Register
AT91C_SPI0_MR             EQU (0x40008004) ;- (SPI0) Mode Register
AT91C_SPI0_IER            EQU (0x40008014) ;- (SPI0) Interrupt Enable Register
AT91C_SPI0_IMR            EQU (0x4000801C) ;- (SPI0) Interrupt Mask Register
AT91C_SPI0_IPNAME2        EQU (0x400080F4) ;- (SPI0) SPI IPNAME2 REGISTER 
AT91C_SPI0_CSR            EQU (0x40008030) ;- (SPI0) Chip Select Register
AT91C_SPI0_SR             EQU (0x40008010) ;- (SPI0) Status Register
// - ========== Register definition for UDP peripheral ========== 
AT91C_UDP_RSTEP           EQU (0x40034028) ;- (UDP) Reset Endpoint Register
AT91C_UDP_CSR             EQU (0x40034030) ;- (UDP) Endpoint Control and Status Register
AT91C_UDP_IMR             EQU (0x40034018) ;- (UDP) Interrupt Mask Register
AT91C_UDP_FDR             EQU (0x40034050) ;- (UDP) Endpoint FIFO Data Register
AT91C_UDP_ISR             EQU (0x4003401C) ;- (UDP) Interrupt Status Register
AT91C_UDP_IPNAME2         EQU (0x400340F4) ;- (UDP) UDP IPNAME2 REGISTER 
AT91C_UDP_ICR             EQU (0x40034020) ;- (UDP) Interrupt Clear Register
AT91C_UDP_VER             EQU (0x400340FC) ;- (UDP) UDP VERSION REGISTER
AT91C_UDP_IER             EQU (0x40034010) ;- (UDP) Interrupt Enable Register
AT91C_UDP_FEATURES        EQU (0x400340F8) ;- (UDP) UDP FEATURES REGISTER 
AT91C_UDP_IPNAME1         EQU (0x400340F0) ;- (UDP) UDP IPNAME1 REGISTER 
AT91C_UDP_GLBSTATE        EQU (0x40034004) ;- (UDP) Global State Register
AT91C_UDP_ADDRSIZE        EQU (0x400340EC) ;- (UDP) UDP ADDRSIZE REGISTER 
AT91C_UDP_NUM             EQU (0x40034000) ;- (UDP) Frame Number Register
AT91C_UDP_IDR             EQU (0x40034014) ;- (UDP) Interrupt Disable Register
AT91C_UDP_TXVC            EQU (0x40034074) ;- (UDP) Transceiver Control Register
AT91C_UDP_FADDR           EQU (0x40034008) ;- (UDP) Function Address Register

// - *****************************************************************************
// -               PIO DEFINITIONS FOR AT91SAM3S4
// - *****************************************************************************
AT91C_PIO_PA0             EQU (1 <<  0) ;- Pin Controlled by PA0
AT91C_PA0_PWMH0           EQU (AT91C_PIO_PA0) ;-  
AT91C_PA0_TIOA0           EQU (AT91C_PIO_PA0) ;-  
AT91C_PA0_A17             EQU (AT91C_PIO_PA0) ;-  
AT91C_PIO_PA1             EQU (1 <<  1) ;- Pin Controlled by PA1
AT91C_PA1_PWMH1           EQU (AT91C_PIO_PA1) ;-  
AT91C_PA1_TIOB0           EQU (AT91C_PIO_PA1) ;-  
AT91C_PA1_A18             EQU (AT91C_PIO_PA1) ;-  
AT91C_PIO_PA10            EQU (1 << 10) ;- Pin Controlled by PA10
AT91C_PA10_UTXD0          EQU (AT91C_PIO_PA10) ;-  
AT91C_PA10_SPI0_NPCS2     EQU (AT91C_PIO_PA10) ;-  
AT91C_PIO_PA11            EQU (1 << 11) ;- Pin Controlled by PA11
AT91C_PA11_SPI0_NPCS0     EQU (AT91C_PIO_PA11) ;-  
AT91C_PA11_PWMH0          EQU (AT91C_PIO_PA11) ;-  
AT91C_PIO_PA12            EQU (1 << 12) ;- Pin Controlled by PA12
AT91C_PA12_SPI0_MISO      EQU (AT91C_PIO_PA12) ;-  
AT91C_PA12_PWMH1          EQU (AT91C_PIO_PA12) ;-  
AT91C_PIO_PA13            EQU (1 << 13) ;- Pin Controlled by PA13
AT91C_PA13_SPI0_MOSI      EQU (AT91C_PIO_PA13) ;-  
AT91C_PA13_PWMH2          EQU (AT91C_PIO_PA13) ;-  
AT91C_PIO_PA14            EQU (1 << 14) ;- Pin Controlled by PA14
AT91C_PA14_SPI0_SPCK      EQU (AT91C_PIO_PA14) ;-  
AT91C_PA14_PWMH3          EQU (AT91C_PIO_PA14) ;-  
AT91C_PIO_PA15            EQU (1 << 15) ;- Pin Controlled by PA15
AT91C_PA15_TF             EQU (AT91C_PIO_PA15) ;-  
AT91C_PA15_TIOA1          EQU (AT91C_PIO_PA15) ;-  
AT91C_PA15_PWML3          EQU (AT91C_PIO_PA15) ;-  
AT91C_PIO_PA16            EQU (1 << 16) ;- Pin Controlled by PA16
AT91C_PA16_TK             EQU (AT91C_PIO_PA16) ;-  
AT91C_PA16_TIOB1          EQU (AT91C_PIO_PA16) ;-  
AT91C_PA16_PWML2          EQU (AT91C_PIO_PA16) ;-  
AT91C_PIO_PA17            EQU (1 << 17) ;- Pin Controlled by PA17
AT91C_PA17_TD             EQU (AT91C_PIO_PA17) ;-  
AT91C_PA17_PCK1           EQU (AT91C_PIO_PA17) ;-  
AT91C_PA17_PWMH3          EQU (AT91C_PIO_PA17) ;-  
AT91C_PIO_PA18            EQU (1 << 18) ;- Pin Controlled by PA18
AT91C_PA18_RD             EQU (AT91C_PIO_PA18) ;-  
AT91C_PA18_PCK2           EQU (AT91C_PIO_PA18) ;-  
AT91C_PA18_A14            EQU (AT91C_PIO_PA18) ;-  
AT91C_PIO_PA19            EQU (1 << 19) ;- Pin Controlled by PA19
AT91C_PA19_RK             EQU (AT91C_PIO_PA19) ;-  
AT91C_PA19_PWML0          EQU (AT91C_PIO_PA19) ;-  
AT91C_PA19_A15            EQU (AT91C_PIO_PA19) ;-  
AT91C_PIO_PA2             EQU (1 <<  2) ;- Pin Controlled by PA2
AT91C_PA2_PWMH2           EQU (AT91C_PIO_PA2) ;-  
AT91C_PA2_SCK0            EQU (AT91C_PIO_PA2) ;-  
AT91C_PA2_DATRG           EQU (AT91C_PIO_PA2) ;-  
AT91C_PIO_PA20            EQU (1 << 20) ;- Pin Controlled by PA20
AT91C_PA20_RF             EQU (AT91C_PIO_PA20) ;-  
AT91C_PA20_PWML1          EQU (AT91C_PIO_PA20) ;-  
AT91C_PA20_A16            EQU (AT91C_PIO_PA20) ;-  
AT91C_PIO_PA21            EQU (1 << 21) ;- Pin Controlled by PA21
AT91C_PA21_RXD1           EQU (AT91C_PIO_PA21) ;-  
AT91C_PA21_PCK1           EQU (AT91C_PIO_PA21) ;-  
AT91C_PIO_PA22            EQU (1 << 22) ;- Pin Controlled by PA22
AT91C_PA22_TXD1           EQU (AT91C_PIO_PA22) ;-  
AT91C_PA22_SPI0_NPCS3     EQU (AT91C_PIO_PA22) ;-  
AT91C_PA22_NCS2           EQU (AT91C_PIO_PA22) ;-  
AT91C_PIO_PA23            EQU (1 << 23) ;- Pin Controlled by PA23
AT91C_PA23_SCK1           EQU (AT91C_PIO_PA23) ;-  
AT91C_PA23_PWMH0          EQU (AT91C_PIO_PA23) ;-  
AT91C_PA23_A19            EQU (AT91C_PIO_PA23) ;-  
AT91C_PIO_PA24            EQU (1 << 24) ;- Pin Controlled by PA24
AT91C_PA24_RTS1           EQU (AT91C_PIO_PA24) ;-  
AT91C_PA24_PWMH1          EQU (AT91C_PIO_PA24) ;-  
AT91C_PA24_A20            EQU (AT91C_PIO_PA24) ;-  
AT91C_PIO_PA25            EQU (1 << 25) ;- Pin Controlled by PA25
AT91C_PA25_CTS1           EQU (AT91C_PIO_PA25) ;-  
AT91C_PA25_PWMH2          EQU (AT91C_PIO_PA25) ;-  
AT91C_PA25_A23            EQU (AT91C_PIO_PA25) ;-  
AT91C_PIO_PA26            EQU (1 << 26) ;- Pin Controlled by PA26
AT91C_PA26_DCD1           EQU (AT91C_PIO_PA26) ;-  
AT91C_PA26_TIOA2          EQU (AT91C_PIO_PA26) ;-  
AT91C_PA26_MCI0_DA2       EQU (AT91C_PIO_PA26) ;-  
AT91C_PIO_PA27            EQU (1 << 27) ;- Pin Controlled by PA27
AT91C_PA27_DTR1           EQU (AT91C_PIO_PA27) ;-  
AT91C_PA27_TIOB2          EQU (AT91C_PIO_PA27) ;-  
AT91C_PA27_MCI0_DA3       EQU (AT91C_PIO_PA27) ;-  
AT91C_PIO_PA28            EQU (1 << 28) ;- Pin Controlled by PA28
AT91C_PA28_DSR1           EQU (AT91C_PIO_PA28) ;-  
AT91C_PA28_TCLK1          EQU (AT91C_PIO_PA28) ;-  
AT91C_PA28_MCI0_CDA       EQU (AT91C_PIO_PA28) ;-  
AT91C_PIO_PA29            EQU (1 << 29) ;- Pin Controlled by PA29
AT91C_PA29_RI1            EQU (AT91C_PIO_PA29) ;-  
AT91C_PA29_TCLK2          EQU (AT91C_PIO_PA29) ;-  
AT91C_PA29_MCI0_CK        EQU (AT91C_PIO_PA29) ;-  
AT91C_PIO_PA3             EQU (1 <<  3) ;- Pin Controlled by PA3
AT91C_PA3_TWD0            EQU (AT91C_PIO_PA3) ;-  
AT91C_PA3_SPI0_NPCS3      EQU (AT91C_PIO_PA3) ;-  
AT91C_PIO_PA30            EQU (1 << 30) ;- Pin Controlled by PA30
AT91C_PA30_PWML2          EQU (AT91C_PIO_PA30) ;-  
AT91C_PA30_SPI0_NPCS2     EQU (AT91C_PIO_PA30) ;-  
AT91C_PA30_MCI0_DA0       EQU (AT91C_PIO_PA30) ;-  
AT91C_PIO_PA31            EQU (1 << 31) ;- Pin Controlled by PA31
AT91C_PA31_SPI0_NPCS1     EQU (AT91C_PIO_PA31) ;-  
AT91C_PA31_PCK2           EQU (AT91C_PIO_PA31) ;-  
AT91C_PA31_MCI0_DA1       EQU (AT91C_PIO_PA31) ;-  
AT91C_PIO_PA4             EQU (1 <<  4) ;- Pin Controlled by PA4
AT91C_PA4_TWCK0           EQU (AT91C_PIO_PA4) ;-  
AT91C_PA4_TCLK0           EQU (AT91C_PIO_PA4) ;-  
AT91C_PIO_PA5             EQU (1 <<  5) ;- Pin Controlled by PA5
AT91C_PA5_RXD0            EQU (AT91C_PIO_PA5) ;-  
AT91C_PA5_SPI0_NPCS3      EQU (AT91C_PIO_PA5) ;-  
AT91C_PIO_PA6             EQU (1 <<  6) ;- Pin Controlled by PA6
AT91C_PA6_TXD0            EQU (AT91C_PIO_PA6) ;-  
AT91C_PA6_PCK0            EQU (AT91C_PIO_PA6) ;-  
AT91C_PIO_PA7             EQU (1 <<  7) ;- Pin Controlled by PA7
AT91C_PA7_RTS0            EQU (AT91C_PIO_PA7) ;-  
AT91C_PA7_PWMH3           EQU (AT91C_PIO_PA7) ;-  
AT91C_PIO_PA8             EQU (1 <<  8) ;- Pin Controlled by PA8
AT91C_PA8_CTS0            EQU (AT91C_PIO_PA8) ;-  
AT91C_PA8_ADTRG           EQU (AT91C_PIO_PA8) ;-  
AT91C_PIO_PA9             EQU (1 <<  9) ;- Pin Controlled by PA9
AT91C_PA9_URXD0           EQU (AT91C_PIO_PA9) ;-  
AT91C_PA9_SPI0_NPCS1      EQU (AT91C_PIO_PA9) ;-  
AT91C_PA9_PWMFI0          EQU (AT91C_PIO_PA9) ;-  
AT91C_PIO_PB0             EQU (1 <<  0) ;- Pin Controlled by PB0
AT91C_PB0_PWMH0           EQU (AT91C_PIO_PB0) ;-  
AT91C_PIO_PB1             EQU (1 <<  1) ;- Pin Controlled by PB1
AT91C_PB1_PWMH1           EQU (AT91C_PIO_PB1) ;-  
AT91C_PIO_PB10            EQU (1 << 10) ;- Pin Controlled by PB10
AT91C_PIO_PB11            EQU (1 << 11) ;- Pin Controlled by PB11
AT91C_PIO_PB12            EQU (1 << 12) ;- Pin Controlled by PB12
AT91C_PB12_PWML1          EQU (AT91C_PIO_PB12) ;-  
AT91C_PIO_PB13            EQU (1 << 13) ;- Pin Controlled by PB13
AT91C_PB13_PWML2          EQU (AT91C_PIO_PB13) ;-  
AT91C_PB13_PCK0           EQU (AT91C_PIO_PB13) ;-  
AT91C_PIO_PB14            EQU (1 << 14) ;- Pin Controlled by PB14
AT91C_PB14_SPI0_NPCS1     EQU (AT91C_PIO_PB14) ;-  
AT91C_PB14_PWMH3          EQU (AT91C_PIO_PB14) ;-  
AT91C_PIO_PB2             EQU (1 <<  2) ;- Pin Controlled by PB2
AT91C_PB2_URXD1           EQU (AT91C_PIO_PB2) ;-  
AT91C_PB2_SPI0_NPCS2      EQU (AT91C_PIO_PB2) ;-  
AT91C_PIO_PB3             EQU (1 <<  3) ;- Pin Controlled by PB3
AT91C_PB3_UTXD1           EQU (AT91C_PIO_PB3) ;-  
AT91C_PB3_PCK2            EQU (AT91C_PIO_PB3) ;-  
AT91C_PIO_PB4             EQU (1 <<  4) ;- Pin Controlled by PB4
AT91C_PB4_TWD1            EQU (AT91C_PIO_PB4) ;-  
AT91C_PB4_PWMH2           EQU (AT91C_PIO_PB4) ;-  
AT91C_PIO_PB5             EQU (1 <<  5) ;- Pin Controlled by PB5
AT91C_PB5_TWCK1           EQU (AT91C_PIO_PB5) ;-  
AT91C_PB5_PWML0           EQU (AT91C_PIO_PB5) ;-  
AT91C_PIO_PB6             EQU (1 <<  6) ;- Pin Controlled by PB6
AT91C_PIO_PB7             EQU (1 <<  7) ;- Pin Controlled by PB7
AT91C_PIO_PB8             EQU (1 <<  8) ;- Pin Controlled by PB8
AT91C_PIO_PB9             EQU (1 <<  9) ;- Pin Controlled by PB9
AT91C_PIO_PC0             EQU (1 <<  0) ;- Pin Controlled by PC0
AT91C_PC0_D0              EQU (AT91C_PIO_PC0) ;-  
AT91C_PC0_PWML0           EQU (AT91C_PIO_PC0) ;-  
AT91C_PIO_PC1             EQU (1 <<  1) ;- Pin Controlled by PC1
AT91C_PC1_D1              EQU (AT91C_PIO_PC1) ;-  
AT91C_PC1_PWML1           EQU (AT91C_PIO_PC1) ;-  
AT91C_PIO_PC10            EQU (1 << 10) ;- Pin Controlled by PC10
AT91C_PC10_NANDWE         EQU (AT91C_PIO_PC10) ;-  
AT91C_PIO_PC11            EQU (1 << 11) ;- Pin Controlled by PC11
AT91C_PC11_NRD            EQU (AT91C_PIO_PC11) ;-  
AT91C_PIO_PC12            EQU (1 << 12) ;- Pin Controlled by PC12
AT91C_PC12_NCS3           EQU (AT91C_PIO_PC12) ;-  
AT91C_PIO_PC13            EQU (1 << 13) ;- Pin Controlled by PC13
AT91C_PC13_NWAIT          EQU (AT91C_PIO_PC13) ;-  
AT91C_PC13_PWML0          EQU (AT91C_PIO_PC13) ;-  
AT91C_PIO_PC14            EQU (1 << 14) ;- Pin Controlled by PC14
AT91C_PC14_NCS0           EQU (AT91C_PIO_PC14) ;-  
AT91C_PIO_PC15            EQU (1 << 15) ;- Pin Controlled by PC15
AT91C_PC15_NCS1           EQU (AT91C_PIO_PC15) ;-  
AT91C_PC15_PWML1          EQU (AT91C_PIO_PC15) ;-  
AT91C_PIO_PC16            EQU (1 << 16) ;- Pin Controlled by PC16
AT91C_PC16_A21_NANDALE    EQU (AT91C_PIO_PC16) ;-  
AT91C_PIO_PC17            EQU (1 << 17) ;- Pin Controlled by PC17
AT91C_PC17_A22_NANDCLE    EQU (AT91C_PIO_PC17) ;-  
AT91C_PIO_PC18            EQU (1 << 18) ;- Pin Controlled by PC18
AT91C_PC18_A0_NBS0        EQU (AT91C_PIO_PC18) ;-  
AT91C_PC18_PWMH0          EQU (AT91C_PIO_PC18) ;-  
AT91C_PIO_PC19            EQU (1 << 19) ;- Pin Controlled by PC19
AT91C_PC19_A1             EQU (AT91C_PIO_PC19) ;-  
AT91C_PC19_PWMH1          EQU (AT91C_PIO_PC19) ;-  
AT91C_PIO_PC2             EQU (1 <<  2) ;- Pin Controlled by PC2
AT91C_PC2_D2              EQU (AT91C_PIO_PC2) ;-  
AT91C_PC2_PWML2           EQU (AT91C_PIO_PC2) ;-  
AT91C_PIO_PC20            EQU (1 << 20) ;- Pin Controlled by PC20
AT91C_PC20_A2             EQU (AT91C_PIO_PC20) ;-  
AT91C_PC20_PWMH2          EQU (AT91C_PIO_PC20) ;-  
AT91C_PIO_PC21            EQU (1 << 21) ;- Pin Controlled by PC21
AT91C_PC21_A3             EQU (AT91C_PIO_PC21) ;-  
AT91C_PC21_PWMH3          EQU (AT91C_PIO_PC21) ;-  
AT91C_PIO_PC22            EQU (1 << 22) ;- Pin Controlled by PC22
AT91C_PC22_A4             EQU (AT91C_PIO_PC22) ;-  
AT91C_PC22_PWML3          EQU (AT91C_PIO_PC22) ;-  
AT91C_PIO_PC23            EQU (1 << 23) ;- Pin Controlled by PC23
AT91C_PC23_A5             EQU (AT91C_PIO_PC23) ;-  
AT91C_PC23_TIOA3          EQU (AT91C_PIO_PC23) ;-  
AT91C_PIO_PC24            EQU (1 << 24) ;- Pin Controlled by PC24
AT91C_PC24_A6             EQU (AT91C_PIO_PC24) ;-  
AT91C_PC24_TIOB3          EQU (AT91C_PIO_PC24) ;-  
AT91C_PIO_PC25            EQU (1 << 25) ;- Pin Controlled by PC25
AT91C_PC25_A7             EQU (AT91C_PIO_PC25) ;-  
AT91C_PC25_TCLK3          EQU (AT91C_PIO_PC25) ;-  
AT91C_PIO_PC26            EQU (1 << 26) ;- Pin Controlled by PC26
AT91C_PC26_A8             EQU (AT91C_PIO_PC26) ;-  
AT91C_PC26_TIOA4          EQU (AT91C_PIO_PC26) ;-  
AT91C_PIO_PC27            EQU (1 << 27) ;- Pin Controlled by PC27
AT91C_PC27_A9             EQU (AT91C_PIO_PC27) ;-  
AT91C_PC27_TIOB4          EQU (AT91C_PIO_PC27) ;-  
AT91C_PIO_PC28            EQU (1 << 28) ;- Pin Controlled by PC28
AT91C_PC28_A10            EQU (AT91C_PIO_PC28) ;-  
AT91C_PC28_TCLK4          EQU (AT91C_PIO_PC28) ;-  
AT91C_PIO_PC29            EQU (1 << 29) ;- Pin Controlled by PC29
AT91C_PC29_A11            EQU (AT91C_PIO_PC29) ;-  
AT91C_PC29_TIOA5          EQU (AT91C_PIO_PC29) ;-  
AT91C_PIO_PC3             EQU (1 <<  3) ;- Pin Controlled by PC3
AT91C_PC3_D3              EQU (AT91C_PIO_PC3) ;-  
AT91C_PC3_PWML3           EQU (AT91C_PIO_PC3) ;-  
AT91C_PIO_PC30            EQU (1 << 30) ;- Pin Controlled by PC30
AT91C_PC30_A12            EQU (AT91C_PIO_PC30) ;-  
AT91C_PC30_TIOB5          EQU (AT91C_PIO_PC30) ;-  
AT91C_PIO_PC31            EQU (1 << 31) ;- Pin Controlled by PC31
AT91C_PC31_A13            EQU (AT91C_PIO_PC31) ;-  
AT91C_PC31_TCLK5          EQU (AT91C_PIO_PC31) ;-  
AT91C_PIO_PC4             EQU (1 <<  4) ;- Pin Controlled by PC4
AT91C_PC4_D4              EQU (AT91C_PIO_PC4) ;-  
AT91C_PC4_SPI0_NPCS1      EQU (AT91C_PIO_PC4) ;-  
AT91C_PIO_PC5             EQU (1 <<  5) ;- Pin Controlled by PC5
AT91C_PC5_D5              EQU (AT91C_PIO_PC5) ;-  
AT91C_PIO_PC6             EQU (1 <<  6) ;- Pin Controlled by PC6
AT91C_PC6_D6              EQU (AT91C_PIO_PC6) ;-  
AT91C_PIO_PC7             EQU (1 <<  7) ;- Pin Controlled by PC7
AT91C_PC7_D7              EQU (AT91C_PIO_PC7) ;-  
AT91C_PIO_PC8             EQU (1 <<  8) ;- Pin Controlled by PC8
AT91C_PC8_NWR0_NWE        EQU (AT91C_PIO_PC8) ;-  
AT91C_PIO_PC9             EQU (1 <<  9) ;- Pin Controlled by PC9
AT91C_PC9_NANDOE          EQU (AT91C_PIO_PC9) ;-  

